[
    {
        "id": "clay-city-board-meets",
        "title": "CLAY CITY BOARD MEETS",
        "summary": "Village trustees approve a 5% pay increase and set an eight-hour workday for all employees amidst heated discussions.",
        "source": "Beth Fancher",
        "date": "2026-01-07",
        "tags": [
            "Flora",
            "Clay City"
        ],
        "full_story": "1/7/25\nBy Beth Fancher\nClay City village trustees met last night, dealing with a continuing employee benefits matter that has been under discussion for several months. Board members expressed concern regarding the disparity in benefits provided to office personnel compared to other village employees. Village trustees unanimously voted for all village employees to receive a five percent pay increase...",
        "link": "#"
    },
    {
        "id": "gingerbread-house-winners",
        "title": "GINGERBREAD HOUSE WINNERS",
        "summary": "Flora High School Foods Class announces the winners of their 117-student Gingerbread House Competition.",
        "source": "Flora High School",
        "date": "2026-01-07",
        "tags": [
            "Flora"
        ],
        "full_story": "1/7/26\nThe Flora High School Foods Class has announced the winners of the Annual Gingerbread House Competition. There were 117 students that competed in 30 different groups. All of the houses were based off a Children’s Christmas book...",
        "link": "#"
    },
    {
        "id": "weather-2025",
        "title": "WEATHER 2025",
        "summary": "Statistics from WNOI reveal a record-setting 2025 with 50.33 total inches of rain and a high of 100 degrees.",
        "source": "WNOI / US Weather Bureau",
        "date": "2026-01-07",
        "tags": [
            "Clay County"
        ],
        "full_story": "1/7/25\nWeather statistics kept at WNOI the US Weather Bureau Station in Clay County for 2025 have been compiled. The average high for the year was 84.75 and the average low was 30.5. We recorded 50.33 total inches of precipitation during the year...",
        "link": "#"
    },
    {
        "id": "flora-competition-2026",
        "title": "Flora High School Wins Regional",
        "summary": "The Flora High School academic team secured first place in this year's regional competition.",
        "source": "WNOI News",
        "date": "2026-01-07",
        "tags": [
            "Flora"
        ],
        "full_story": "Full details about the regional competition go here...",
        "link": "https://example.com/original-source"
    }
]
