[
    {
        "id": "countyfairqueenpageant",
        "title": "COUNTY FAIR QUEEN PAGEANT",
        "summary": "The 2026 Miss Illinois County Fair Queen Pageant will be held on Saturday, January 17th and Sunday the 18th in Springfield.  Clay County Fair Queen Olivia Haun will be honored at a sendoff party at the State Bank Suites Sunday from 1 to 3 ...",
        "full_story": "1/2/26\nThe 2026 Miss Illinois County Fair Queen Pageant will be held on Saturday, January 17\nth\n and Sunday the 18\nth\n in Springfield.  Clay County Fair Queen Olivia Haun will be honored at a sendoff party at the State Bank Suites Sunday from 1 to 3 pm.\nThe pageant happens during the annual meeting and convention of the Illinois Association of Agricultural Fairs.  With former county fair queens taking part, the actual competition on Saturday will include Speech, Swimsuit, and Evening Gown Competitions and Pageant Finals on Sunday the 18\nth\n.\nThe sendoff will be a come and go event.  Everyone is welcome to wish Olivia Good Luck as she heads off to represent Clay County.  T-shirt orders will also be ready for pickup at the party.\nVoting for this year’s People’s Choice award winner is now open.  Through midnight January 17\nth\n, use the link in this story to make your voice count and show support for Olivia by voting.  The cost is $1 per vote and you can vote as many times as you like.  The People’s Choice winner will be announced on stage and will earn a cash scholarship.  The winner will also get to donate $500 to a charity of their choice.\nJohnna Fulcher is the retiring Miss Illinois County Fair Queen.\nhttps://illinoiscountyfairs.org/peoples-choice/",
        "category": "General News",
        "tags": [
            "County News"
        ],
        "link": "https://supportmylocalcommunity.com/clay-county-news-center/#countyfairqueenpageant",
        "date_added": "2026-01-04T14:34:34.097640"
    },
    {
        "id": "hohoholidayhighlightcontest",
        "title": "HO HO HOLIDAY HIGHLIGHT CONTEST",
        "summary": "Ho Ho Holiday Highlight entries are now due.  Each day in December a different business was featured, listeners were asked to keep track of those business’s then send us your list of all 31 highlighted business’s. Your completed contest entry list can be mailed ...",
        "full_story": "1/2/26\nHo Ho Holiday Highlight entries are now due.  Each day in December a different business was featured, listeners were asked to keep track of those business’s then send us your list of all 31 highlighted business’s.\nYour completed contest entry list can be mailed to P.O. Box 368 in Flora, emailed to \n[email protected]\n, faxed to 618-662-2407 or hand delivered to WNOI Studios at 1001 North Olive Road in Flora.  Please include your name, address & phone number.  Entries must be received at WNOI by close of business (4pm) on Monday.\nThree winners will be drawn from all correct entries during The Revue Show at 2pm on Wednesday, January 7\nth\n.  1\nst\n Prize is a $300 Shopping Spree, 2\nnd\n Prize is a $150 Shopping Spree and 3\nrd\n Prize is a $75 Shopping Spree.  Winners will have three days to determine which one business sponsor they will redeem their prize at.",
        "category": "General News",
        "tags": [
            "County News"
        ],
        "link": "https://supportmylocalcommunity.com/clay-county-news-center/#hohoholidayhighlightcontest",
        "date_added": "2026-01-04T14:34:34.097640"
    },
    {
        "id": "peakscholarship",
        "title": "PEAK SCHOLARSHIP",
        "summary": "Frontier Community College and Olney Central College are pleased to announce the Kenton Peak Scholarship, a $1,000 annual award supporting students pursuing para-medical fields, emergency medical response, and other healthcare-related programs. The Kenton Peak Scholarship can be awarded to either an incoming freshman or ...",
        "full_story": "1/2/26\nFrontier Community College and Olney Central College are pleased to announce the Kenton Peak Scholarship, a $1,000 annual award supporting students pursuing para-medical fields, emergency medical response, and other healthcare-related programs.\nThe Kenton Peak Scholarship can be awarded to either an incoming freshman or a returning sophomore.  Funds may be used for tuition, textbooks, fees, and other program-related expenses, helping students prepare for vital roles as future first responders and healthcare providers.\nTo be eligible, applicants must, be enrolled in a para-medical, EM responder, or healthcare program at FCC or OCC, maintain a minimum 2.5 GPA, take an active role in emergency preparedness, and plan to serve as an EMT or healthcare provider after graduation.\nThe application deadline for the Kenton Peak Scholarship is February 27\nth\n.\nFor more information or to apply, visit https://iecc.edu/fcc/admissions-aid/scholarships or contact FCC or OCC Student Services.",
        "category": "School News",
        "tags": [
            "County News"
        ],
        "link": "https://supportmylocalcommunity.com/clay-county-news-center/#peakscholarship",
        "date_added": "2026-01-04T14:34:34.097640"
    },
    {
        "id": "grocerytaxgone",
        "title": "GROCERY TAX GONE?",
        "summary": "Illinois’ statewide 1% grocery tax went away yesterday, although many people continue to pay it at the local level. Data compiled by the Illinois Municipal League shows that 656 municipalities, a little more than half of the state’s municipalities, have passed an ordinance establishing ...",
        "full_story": "1/2/26\nIllinois’ statewide 1% grocery tax went away yesterday, although many people continue to pay it at the local level.\nData compiled by the Illinois Municipal League shows that 656 municipalities, a little more than half of the state’s municipalities, have passed an ordinance establishing their own grocery tax.  Those communities are home to 7.2 million people, or 56.5% of the state’s population.  Three counties, Washington, Wabash and Moultrie have also approved countywide grocery taxes.  In Clay County, Flora, Louisville and Clay City have all passed a 1% grocery tax.\nGovernor JB Pritzker signed a bill in 2024 eliminating the 1% statewide grocery tax, which he touted as a measure to ease residents’ tax burden.  But because the revenue from the state grocery tax went to municipal governments, rather than state coffers, the measure allowed local governments to levy their own 1% tax via ordinance, rather than a referendum to voters.",
        "category": "State News",
        "tags": [
            "County News"
        ],
        "link": "https://supportmylocalcommunity.com/clay-county-news-center/#grocerytaxgone",
        "date_added": "2026-01-04T14:34:34.097640"
    },
    {
        "id": "gingerbreadhousedisplay",
        "title": "GINGERBREAD HOUSE DISPLAY",
        "summary": "Time is running out to vote for your favorite Flora High School Foods Class Gingerbread house.  Displays are at the Flora Public Library through Tuesday.  The students were asked to make houses from children’s books. There are 30 different houses, and the public is ...",
        "full_story": "1/2/26\nTime is running out to vote for your favorite Flora High School Foods Class Gingerbread house.  Displays are at the Flora Public Library through Tuesday.  The students were asked to make houses from children’s books.\nThere are 30 different houses, and the public is encouraged to go into the library and vote for their favorite creation.  Simply write the number of your favorite house on your ballot and place it in the box.  After January 6\nth\n the 1\nst\n, 2\nnd\n and 3\nrd\n prize winners will be named.",
        "category": "School News",
        "tags": [
            "Flora"
        ],
        "link": "https://supportmylocalcommunity.com/clay-county-news-center/#gingerbreadhousedisplay",
        "date_added": "2026-01-04T14:34:34.097640"
    },
    {
        "id": "ruralhealthcareaward",
        "title": "RURAL HEALTHCARE AWARD",
        "summary": "Illinois has been awarded $193,418,216 per year for five years through the $50 billion federal Rural Healthcare Transformation Program (RHTP) fund, which will be utilized to expand equitable access to healthcare and to eliminate barriers to care that many residents of rural communities face. ...",
        "full_story": "1/2/26\nIllinois has been awarded $193,418,216 per year for five years through the $50 billion federal Rural Healthcare Transformation Program (RHTP) fund, which will be utilized to expand equitable access to healthcare and to eliminate barriers to care that many residents of rural communities face.  All 50 states applied for the RHTP funding, and a total of $10 billion will be available each year over five years, beginning in fiscal year 2026.\nWhile this funding will provide support to improve healthcare access in rural Illinois communities, it will be far from enough to counteract the cuts imposed to the Medicaid program through various provisions in the Trump Administration’s budget bill.  According to an estimate from KFF, the Trump Administration’s budget bill is expected to cut $137 billion from rural healthcare providers nationally, nearly three times the $50 billion allocated in the fund.\nThe Illinois Department of Healthcare and Family Services (HFS), in strategic partnership with its sister agencies and interested parties, utilized the federal Centers for Medicare & Medicaid’s (CMS) five strategic goals from the RHTP Notice of Funding Opportunity (NOFO), to develop a comprehensive plan to strengthen Illinois’ rural healthcare system for the future.  The plan outlines a vision built on three key categories of initiatives designed to incentivize health system transformation and create regional partnerships, increase the use of technology and mobile health services, and expand the rural healthcare workforce within the state.\nRoughly 1.9 million people, or 15% of Illinois’ population, live in rural areas of the state.  RHTP funding will be directed to entities that serve these individuals in rural census tracts across Illinois.  Eighty-five counties, or more than two thirds of the counties in the state, include these types of census tracts as designated by the federal Health Resources and Services Administration (HRSA).  Within this framework, particular attention will be paid to sub-populations, such as individuals living with chronic disease and those with mental health conditions.\nHFS will continue engaging with stakeholders on next steps regarding funding distribution.  Staff planning and implementation are underway in partnership with other state agencies as well as with federal CMS.",
        "category": "General News",
        "tags": [
            "County News"
        ],
        "link": "https://supportmylocalcommunity.com/clay-county-news-center/#ruralhealthcareaward",
        "date_added": "2026-01-04T14:34:34.097640"
    },
    {
        "id": "farmpaymentsannounced",
        "title": "FARM PAYMENTS ANNOUNCED",
        "summary": "Farmers are now learning how much aid they can expect to receive from a $12 billion package that President Donald Trump announced earlier this month. The US Department of Agriculture released the figures on Wednesday for how much aid per acre farmers can plan ...",
        "full_story": "1/2/26\nFarmers are now learning how much aid they can expect to receive from a $12 billion package that President Donald Trump announced earlier this month.\nThe US Department of Agriculture released the figures on Wednesday for how much aid per acre farmers can plan on for each row crop.  The details arrived after most farmers had already met with their bankers to arrange financing for next year’s crops and placed orders for the seed and fertilizer they would need.  But officials have promised that the payments should arrive by the end of February.\nSoybean farmers have been hit especially hard by Trump’s trade war with China, which stopped buying any American crops after Trump announced his tariffs this spring.  China is the world’s largest buyer of soybeans. This aid package is expected to help farmers weather the trade disruptions until China buys more soybeans under an agreement announced in October and until provisions of Trump’s massive budget bill take effect later this year.\nSoybean farmers will get $30.88 per acre while corn farmers will receive $44.36 per acre.  Another crop hit hard when China stopped buying was sorghum, and those farmers will get $48.11 per acre.  The amounts are based on a USDA formula on the cost of production.\nBut farmers say the aid won’t solve all their problems as they continue to deal with the soaring costs of fertilizer, seeds and labor that make it hard to turn a profit right now.  Some agricultural trade groups have said they worry that thousands of farmers could go out of business, but others have said they believe most farmers have the financial resources and equity needed to survive.\nKentucky soybean farmer Caleb Ragland, who was president of the American Soybean Association until recently, said the aid is “a Band-Aid on a deep wound. We need competition and opportunities in the market to make our future brighter.”\nThe President of the National Corn Growers Association Jed Bower also urged the Trump administration to focus on cultivating additional uses for their crops.  Farmers will benefit from having more buyers whether it is for ethanol and animal feed at home or for international markets.\n“Corn growers have been sounding the alarm about the fact that farmers have been faced with multiple consecutive years of low corn prices and high input costs,” Bower said.  “While this financial assistance is helpful and welcomed, we urgently need the administration and Congress to develop markets in the United States and abroad that will provide growers with more long-term economic certainty.”\nAgriculture Secretary Brooke Rollins said that is the goal and promised to continue working to open new markets while strengthening the safety net for farmers.\nMinnesota Soybean Growers Association President Darin Johnson said the aid number for soybeans fell short of what farmers had been hoping for, so more help could be needed, though this package will help.\nMost farmers remain steadfast supporters of Trump even after the disruptions caused by the trade war.  They generally support many of his other policies and believe they will get a better trade deal in the end.\nThese aid payments will add up to $11 billion for row crop farmers who raise corn, soybeans, wheat, sorghum and other crops.  Another $1 billion has been set aside for specialty crops and sugar, but the administration hasn’t released any details of aid for those crops.\nThe aid payments will be capped at $155,000 per farmer or entity, and only farms that make less than $900,000 in adjusted gross income will be eligible.\nThe USDA says the average size of the 1.88 million farms nationwide was 466 acres last year.  Still, many farmers are much larger than that as larger operations have continued to buy up neighboring farms over time.",
        "category": "General News",
        "tags": [
            "County News"
        ],
        "link": "https://supportmylocalcommunity.com/clay-county-news-center/#farmpaymentsannounced",
        "date_added": "2026-01-04T14:34:34.097640"
    },
    {
        "id": "therevue",
        "title": "The ReVue",
        "summary": "Today on the ReVue I talk with the musical group the BurmaShavers, Steve Folwler and Jerry Wilson about their music. Burma Shavers.wav Booking information is available at theburmashavers@hotmail.com",
        "full_story": "12/31/25\nToday on the ReVue I talk with the musical group the BurmaShavers, Steve Folwler and Jerry Wilson about their music.\nBurma Shavers.wav\nBooking information is available at \n[email protected]",
        "category": "Arts & Entertainment",
        "tags": [
            "County News"
        ],
        "link": "https://supportmylocalcommunity.com/clay-county-news-center/#therevue",
        "date_added": "2026-01-04T14:34:34.097640"
    }
]