[
    {
        "id": "clay-city-board-meets",
        "title": "CLAY CITY BOARD MEETS",
        "full_story": "1/7/25\nBy Beth Fancher\nClay City village trustees met last night, dealing with a continuing employee benefits matter that has been under discussion for several months.  Board members expressed concern regarding the disparity in benefits provided to office personnel compared to other village employees.  Village trustees unanimously voted for all village employees to receive a five percent pay increase, though discussions about work hours with Village Attorney Barry Bright became heated.  Trustee Beth Prosser presented these recommendations by Zoom.\nTrustee Sue Lindeman said she was concerned the employes handbook was incorrect and questioned how Attorney Bright and a past mayor had allowed office personnel to work from 8 am to 4 pm and take an hour paid lunch break.  Attorney Bright said they were not given a raise at that time.  Trustee Lindeman asked why this was never voted on by the board and wanted to see this agreement on paper.  Attorney Bright said there was an oral agreement made several years ago, before Shannon Hall was employed by the village.\nTrustees approved an eight-hour workday with no paid lunch for all village employees.  Trustee Travis Strasbaugh voted no.  Strasbaugh later said he was concerned about a lawsuit.\nAfter an explanation on selling village owned property next to the Clay City Fellowship Church, Village President Mike Delonshaw was instructed to present an offer to the church and sell it as surplus property, to avoid legal paperwork and financial costs.\nTrustees approved purchasing a Chlorine Pocket Chlorometer replacing the current one that is not accurate at a cost of, $711.\nThey approved and signed of a lease with GFI (formerly Miller’s) for a new copy machine for $78.03 per month, plus $54.75 for maintenance and toner.  The second cost will only be as needed.\nSheriff Andy Myers presented the December sheriff’s report for the village.  Sheriff Myers said they are dealing with the Safety Act issues.\nHe also talked a little about the new body scan machine and that he is teaching a college credit course for all three schools in criminal justice.  He said last year he had 13 students and said there were 15 or 16 students this semester at Flora High School.",
        "tags": [
            "Flora",
            "Clay City"
        ],
        "date": "2026-01-07"
    },
    {
        "id": "gingerbread-house-winners",
        "title": "GINGERBREAD HOUSE WINNERS",
        "full_story": "1/7/26\nThe Flora High School Foods Class has announced the winners of the Annual Gingerbread House Competition.  There were 117 students that competed in 30 different groups.  All of the houses were based off a Children’s Christmas book.\nThe 4\nth\nplace winner was titled “‘Twas the Night before Christmas” and created by Adilynn O’Connor, Breta Heuerman, and Nicole Menghi.  The 3\nrd\nplace winner was titled “Christmas in the Cabin” and was created by Isham Lusk, Benny Allen, Parker Burmeister, Payton Herman, and Zaelin Welty.  The 2\nnd\nplace winner is the house titled “Christmas in the Big Woods” made by Phillip Smith, Jazzlyn Yates, and Kenet Banta.  And the 1st place entry titled “The Feeding & Care of the Grinch” was created by Makhara Spitzner, Neveah Alaniz, Maryssa Eldridge, and Makynlee Highsmith.\nThe foods class would like to thank everyone who stopped by the library to vote on the Gingerbread Houses.",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-07"
    },
    {
        "id": "weather-2025",
        "title": "WEATHER 2025",
        "full_story": "1/7/25\nWeather statistics kept at WNOI the US Weather Bureau Station in Clay County for 2025 have been compiled.\nThe average high for the year was 84.75 and the average low was 30.5.  We recorded 50.33 total inches of precipitation during the year.\nThe hottest day of 2025 happened on September 15\nth\nwhen the temperature reached 100.  The coldest day of the year was on January 16\nth\nwhen the thermometer read 1.  The day with the most rain was July 20\nth\nwhen we recorded 3.8 inches of rain.  The month with the most rainfall was April when the total rainfall was 11.2 inches.  December was the month with the least amount of rainfall with only 1.44 recorded.  January had the most snowfall with a total of 11 inches.  The most snowfall happened on January 6\nth\nwhen 6 inches of snow was measured.\nJuly was the hottest month with an average high temperature of 92.2 and January was the coldest month with an average high temperature of 34.3.",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-07"
    },
    {
        "id": "flora-city-council-meets",
        "title": "FLORA CITY COUNCIL MEETS",
        "full_story": "(1/6/25/26) pg\nThe Flora City Council met Monday afternoon and made quick work of a light agenda.\nWhen Mayor Linda Spicer called the meeting to order she called on visitors to address the group and welcomed April Carruthers with the Clay County Health Department.  Carruthers stated that the health department is requesting the use of the REA Building at the Clay County Fairgrounds in Charley Brown Park.  They plan to put on the next installment of their Spring Resource Carnival on Thursday, May 7\nth\n.  This year’s theme is Toy Story, and they hope to build on last year’s effort where they had over 500 participants.  Commissioners wasted little time in approving the request and wished them success with the event.\nNext, Heather Greenwood with Wabash General Hospital addressed the council to lobby for support for a new state backed program that she is volunteering with called Partners for Progress.  The local group covers 8 southeastern Illinois counties and seeks to work with individuals who may have contact with law enforcement but are not in the system.  They seek to deflect these people from further engagement with the legal system by what she described as relentless engagement with behavioral and mental health specialists.  She explained to commissioners how the program works and encourages them and other people in the community to get involved.  Flora Police Chief Jeremy Ruger echoed Greenwood’s remarks and stated that the program is showing positive results elsewhere.  Greenwood says local involvement is key and they are launching an event in Flora on March 3\nrd\nat Church of the Nazarene on Parsons Lane.  She said she will present additional details as the event draws nearer and will soon begin an effort to publicize it in various media.  Mayor Spicer and commissioners thanked her for her effort and encouraged her to keep her enthusiasm.\nAs the official meeting got underway members quickly approved the meeting agenda and consent agenda which included approval of past meeting minutes and the December Warrant List.\nIn regular business, Mayor Spicer announced the winners of the Best Christmas Lights in Town Contest.  She also thanked everyone who entered the contest and urged others to participate next year.  Earning Third Place and a $75 Utility Bill Credit are John and Casey Armstrong at 403 E. 5\nth\nSt.  Second Place and a $100 Utility Bill Credit goes to Jeff and Christy Pierson at 22 Holly Lane.  And First Place with a $150 Utility Bill Credit goes to Rob and Angie McKnight at 7 Sunset.  Congratulations to the winners.  Mayor Spicer added that city workers have now taken down the holiday decorations and the snowflakes are gone from Flora for the season.  She then polled commissioners for their comments.  Only one offered any comment and that was Phil Wiley.  He thanked the city for purchasing new decorations this year and encouraged them to purchase additional ones for next year.  He also thanked everyone for their efforts around town and suggested that perhaps a map can be created to help people find all the entries in the city contest.\nCity Administrator/Economic Development Director Mike Stanford called on Lee Beckman with Milano and Grunloh Engineers for an update on Flora’s grant applications.  Beckman quickly offered the latest on the Unsewered Areas and Lead Service Line grants.  He also Noted that Phase Two of the Safe Routes to School Grant is applied for and Phase One should go out for bids in February and construction could begin as early as March depending on the weather.  Stanford then asked the council to approve an ordinance for an intergovernmental agreement with the Village of Xenia.  He explained the ordinance will result in the city selling road salt to the village for $130 per ton.  Commissioners quickly approved the measure.  Stanford turned to three other informational items.  First, he noted that work will begin soon on the new housing project on South Stanford Road.  He says equipment is expected to be moved into the area this week for earthwork, but that is dependent on the weather.  Matt Johnson offered an update on the new sewer plant with additional news to come later this month.  Stanford also reported that results of the OSLAD Grant application were expected around the holidays, but Christmas and New Year’s Day have passed and there’s no word yet, but it should come, “soon”, which could mean Easter or the 4\nth\nof July for all he knows.   With that, all business was complete and the meeting adjourned.",
        "tags": [
            "Flora",
            "Xenia"
        ],
        "date": "2026-01-07"
    }
]