[
    {
        "id": "county-fair-queen-pageant",
        "title": "COUNTY FAIR QUEEN PAGEANT",
        "full_story": "1/13/26\nClay County Fair Queen Olivia Haun is headed to the 2026 Miss Illinois County Fair Queen Pageant which will be held on Saturday, and Sunday in Springfield.\nThe pageant happens during the 115\nth\nannual meeting and convention of the Illinois Association of Agricultural Fairs at the Crowne Plaza and Holiday Inn Express.  There are 75 County Fair Queens competing for the title.  With former county fair queens taking part, the actual competition on Saturday begins with rehearsal at 8:30 Saturday morning, and Pageant Finals beginning at 6:30 Sunday evening.\nVoting for this year’s People’s Choice award winner is underway.  Through midnight Saturday, use the link in this story to make your voice count and show support for Olivia by voting.  The cost is $1 per vote and you can vote as many times as you like.  The People’s Choice winner will be announced on stage and will earn a cash scholarship.  The winner will also get to donate $500 to a charity of their choice.\nJohnna Fulcher is the retiring Miss Illinois County Fair Queen.",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-13"
    },
    {
        "id": "empowering-the-next-generation",
        "title": "EMPOWERING THE NEXT GENERATION",
        "full_story": "1/13/26\nThe Full Armor Christian Academy in Louisville and Olney are bringing Alan and Lisa Robertson to Olney January 30\nth\nand 31\nst\nfor an event titled Empowering the Next Generation.\nThe event will be held at the Elm Street Christian Church at 6 pm on Friday, January 30\nth\nand at 2pm on Saturday January 31\nst\n.  Alan is a co-host of the “Unashamed” podcast, as well as an accomplished author and speaker.  Together, Alan and Lisa bring a message of vision, character, and hope as they challenge the community to invest in today’s youth, tomorrow’s leaders.  This uplifting night is designed for families, friends, and community members of all ages.  Don’t miss this special opportunity to come together and support a strong future for the next generation.\nTickets can be purchased by going to the Full Armor Facebook page and clicking the link for either the Friday night or the Saturday afternoon program and seating is limited.\nFor more information on sponsorship opportunities, please contact Full Armor at 618-392-0300.",
        "tags": [
            "Louisville"
        ],
        "date": "2026-01-13"
    }
]