[
    {
        "title": "COUNTY FAIR QUEEN PAGEANT",
        "brief": "The 2026 Miss Illinois County Fair Queen Pageant will be held on Saturday, January 17th and Sunday the 18th in Springfield.  Clay County Fair Queen Olivia Haun will be honored at a...",
        "full_story": "1/2/26\nThe 2026 Miss Illinois County Fair Queen Pageant will be held on Saturday, January 17th and Sunday the 18th in Springfield.  Clay County Fair Queen Olivia Haun will be honored at a sendoff party at the State Bank Suites Sunday from 1 to 3 pm.\nThe pageant happens during the annual meeting and convention of the Illinois Association of Agricultural Fairs.  With former county fair queens taking part, the actual competition on Saturday will include Speech, Swimsuit, and Evening Gown Competitions and Pageant Finals on Sunday the 18th.\nThe sendoff will be a come and go event.  Everyone is welcome to wish Olivia Good Luck as she heads off to represent Clay County.  T-shirt orders will also be ready for pickup at the party.\nVoting for this year’s People’s Choice award winner is now open.  Through midnight January 17th, use the link in this story to make your voice count and show support for Olivia by voting.  The cost is $1 per vote and you can vote as many times as you like.  The People&#8217;s Choice winner will be announced on stage and will earn a cash scholarship.  The winner will also get to donate $500 to a charity of their choice.\nJohnna Fulcher is the retiring Miss Illinois County Fair Queen.\nhttps://illinoiscountyfairs.org/peoples-choice/\n&nbsp;",
        "link": "https://supportmylocalcommunity.com/clay-county-news-center/",
        "tags": [
            "General"
        ]
    },
    {
        "title": "HO HO HOLIDAY HIGHLIGHT CONTEST",
        "brief": "Ho Ho Holiday Highlight entries are now due.  Each day in December a different business was featured, listeners were asked to keep track of those business’s then send us your list ...",
        "full_story": "1/2/26\nHo Ho Holiday Highlight entries are now due.  Each day in December a different business was featured, listeners were asked to keep track of those business’s then send us your list of all 31 highlighted business’s.\nYour completed contest entry list can be mailed to P.O. Box 368 in Flora, emailed to info@.com, faxed to 618-662-2407 or hand delivered to  Studios at 1001 North Olive Road in Flora.  Please include your name, address &amp; phone number.  Entries must be received at  by close of business (4pm) on Monday.\nThree winners will be drawn from all correct entries during The Revue Show at 2pm on Wednesday, January 7th.  1st Prize is a $300 Shopping Spree, 2nd Prize is a $150 Shopping Spree and 3rd Prize is a $75 Shopping Spree.  Winners will have three days to determine which one business sponsor they will redeem their prize at.\n&nbsp;",
        "link": "https://supportmylocalcommunity.com/clay-county-news-center/",
        "tags": [
            "Flora"
        ]
    },
    {
        "title": "GROCERY TAX GONE?",
        "brief": "Illinois’ statewide 1% grocery tax went away yesterday, although many people continue to pay it at the local level. Data compiled by the Illinois Municipal League shows that 656 mu...",
        "full_story": "1/2/26\nIllinois’ statewide 1% grocery tax went away yesterday, although many people continue to pay it at the local level.\nData compiled by the Illinois Municipal League shows that 656 municipalities, a little more than half of the state’s municipalities, have passed an ordinance establishing their own grocery tax.  Those communities are home to 7.2 million people, or 56.5% of the state’s population.  Three counties, Washington, Wabash and Moultrie have also approved countywide grocery taxes.  In Clay County, Flora, Louisville and Clay City have all passed a 1% grocery tax.\nGovernor JB Pritzker signed a bill in 2024 eliminating the 1% statewide grocery tax, which he touted as a measure to ease residents’ tax burden.  But because the revenue from the state grocery tax went to municipal governments, rather than state coffers, the measure allowed local governments to levy their own 1% tax via ordinance, rather than a referendum to voters.",
        "link": "https://supportmylocalcommunity.com/clay-county-news-center/",
        "tags": [
            "Flora",
            "Louisville",
            "Clay City"
        ]
    },
    {
        "title": "GINGERBREAD HOUSE DISPLAY",
        "brief": "Time is running out to vote for your favorite Flora High School Foods Class Gingerbread house.  Displays are at the Flora Public Library through Tuesday.  The students were asked t...",
        "full_story": "1/2/26\nTime is running out to vote for your favorite Flora High School Foods Class Gingerbread house.  Displays are at the Flora Public Library through Tuesday.  The students were asked to make houses from children’s books.\nThere are 30 different houses, and the public is encouraged to go into the library and vote for their favorite creation.  Simply write the number of your favorite house on your ballot and place it in the box.  After January 6th the 1st, 2nd and 3rd prize winners will be named.\n&nbsp;",
        "link": "https://supportmylocalcommunity.com/clay-county-news-center/",
        "tags": [
            "Flora"
        ]
    }
]