[
    {
        "id": "mcconnell-secures-541m-for-kentucky-in-federal-fun",
        "title": "McConnell secures $541M for Kentucky in federal funding",
        "image": "https://bloximages.newyork1.vip.townnews.com/wsiltv.com/content/tncms/assets/v3/editorial/d/a0/da0f0a77-ec74-5b4c-8d77-3e4aa946ffc3/6955927791bd4.image.jpg?crop=1280%2C672%2C0%2C144&resize=1200%2C630&order=crop%2Cresize",
        "full_story": "McConnell secures $541M for Kentucky in federal funding\nDigital Content Manager\nJan 15, 2026\n6 hrs ago\nCopy article link\nWASHINGTON, D.C. (WEVV) -- U.S. Sen. Mitch McConnell of Kentucky announced the Senate's passage of a federal funding bill that secures more than $540 million for Kentucky priorities. The bill, which focuses on areas such as Commerce-Justice-Science, Interior-Environment, and Energy-Water, now awaits President Trump's signature.\nThe funding includes $70 million for the University of Louisville's Center for Bioscience and $35 million for the University of Kentucky's Healthy Kentucky Research Building No. 2. \"This federal funding is an important investment in research infrastructure at UofL and UK,\" McConnell said.\nThe bill allocates $2.5 million for a new cybercrime training facility in Madisonville and $352,000 for law enforcement equipment in Warren County. \"These federal investments will equip Kentucky's law enforcement with the tools and training they need to keep our communities safe,\" McConnell said.\nAdditionally, $340 million is set aside for environmental remediation at the Paducah Gaseous Diffusion Plant. \"These federal investments deliver long-overdue cleanup at the Paducah Gaseous Diffusion Plant while positioning the site for the future,\" McConnell said.\nThe funding also includes $21.281 million for the Rough River Dam Safety Modification Project and $600,000 for an erosion study at Columbus-Belmont State Park. Investments in water infrastructure, such as $9.256 million for a water treatment plant in Edmonson County, are also part of the package. \"These critical federal investments in water and wastewater infrastructure will protect public health and ensure Kentucky communities can continue to grow,\" McConnell said.\nThe bill supports recreational areas with $7.45 million for Land Between the Lakes National Recreation Area and $1 million for improvements at Green River National Wildlife Refuge. \"Investing in Land Between the Lakes and the Green River National Wildlife Refuge strengthens Kentucky's outdoor recreation and tourism opportunities,\" McConnell said.\nOther priorities include $10.5 million in funding for invasive carp management in the lower Mississippi River Basin, funding for economic development initiatives, and for law enforcement support. The bill also ensures continued funding for a new federal prison in Letcher County and allocates $200 million for the Appalachian Regional Commission.\nCopy article link\nDigital Content Manager\nFollow Mike Mohundro\nUpdated\nFeb 25, 2023\nUpdated\nFeb 29, 2024\nAug 12, 2024\nUpdated\nJan 13, 2024\nUpdated\nDec 6, 2021\nUpdated\nJul 14, 2025\nRecommended for you",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#mcconnell-secures-541m-for-kentucky-in-federal-fun",
        "link": "https://supportmylocalcommunity.com/local-news/#mcconnell-secures-541m-for-kentucky-in-federal-fun",
        "tags": [
            "Louisville"
        ],
        "date": "2026-01-16",
        "is_primary": false
    },
    {
        "id": "oslad-grant-awarded",
        "title": "OSLAD GRANT AWARDED",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Grants-Awarded-1-resized.webp",
        "full_story": "1/15/26\nWednesday, Governor JB Pritzker and the Illinois Department of Natural Resources (IDNR) announced $36 million in grant funding was awarded to 67 local park projects throughout Illinois to help communities acquire land and develop recreational opportunities.  The grants were awarded through the Open Space Land Acquisition and Development, or OSLAD, program.\nThe City of Flora was awarded $344,800 for an accessible park redesign project.\nFor the fourth year in a row, the governor ensured funding was set aside for economically distressed communities, resulting in 20 underserved communities receiving $11.4 million in OSLAD grants this year.\nEstablished by the Illinois General Assembly in 1986, OSLAD is a cost-sharing program between state and local governments which helps communities fund land acquisition and development for parks and outdoor recreation projects.  It’s become one of the most popular grant programs in Illinois.  Since its establishment, OSLAD has awarded $675 million for park projects throughout Illinois.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#oslad-grant-awarded",
        "link": "https://supportmylocalcommunity.com/local-news/#oslad-grant-awarded",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-15",
        "is_primary": true
    },
    {
        "id": "radiography-information-session",
        "title": "RADIOGRAPHY INFORMATION SESSION",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/12/XRay-3-resized.webp",
        "full_story": "1/15/26\nOlney Central College is hosting a virtual information session for students interested in applying for Fall 2026 admission to the Radiography Program.\nThe next virtual session will be offered at 6 pm on Wednesday, January 21\nst\n.\nTo make application to the radiography program, contact Julie Bullard at 618-847-9201, ext. 4520.\nLogin information can be accessed at www.iecc.edu/radtech under the Prospective Student Menu.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#radiography-information-session",
        "link": "https://supportmylocalcommunity.com/local-news/#radiography-information-session",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-15",
        "is_primary": true
    },
    {
        "id": "spring-fish-sale",
        "title": "SPRING FISH SALE",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Spring-Fish-Sale-resized.webp",
        "full_story": "1/15/26\nThe Wayne and Clay County Soil and Water Conservation District will be holding its annual Spring Fish Sale Thursday, March 12\nth\nat 8 am.\nThe deadline to order grass carp is on Thursday, February 26\nth\n.  The deadline to order all other fish is noon on Thursday, March 5\nth\n.\nAvailable fish include Channel Catfish, Largemouth Bass, Hybrid Sunfish, Bluegill, Redear, Black Crappie, Fathead Minnows and Grass Carp.\nTo place your order for fish please contact the Wayne County Soil and Water Conservation District at 618-842-7602 ext. 3.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#spring-fish-sale",
        "link": "https://supportmylocalcommunity.com/local-news/#spring-fish-sale",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-15",
        "is_primary": true
    },
    {
        "id": "plummer-card-drive",
        "title": "PLUMMER CARD DRIVE",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Plumer-26-resized.webp",
        "full_story": "1/15/26\nState Senator Jason Plummer is encouraging residents across the district to help spread love and kindness this Valentine’s Day by participating in his Valentine’s for Seniors Card Drive.\nThe annual initiative invites individuals, families, classrooms, churches, and community organizations to create Valentine’s Day cards that will be delivered to seniors living in nursing homes and assisted living facilities throughout the 55\nth\nSenate district.\nSenator Plummer said, “This drive is a simple way to let seniors know they are connected to their community  A card may seem small, but it can make a real difference and really brighten someone’s day.”\nValentine’s Day cards may be dropped off in person at Senator Plummer’s district office by February 6\nth\nthe Vandalia District Office is at 310 West Gallatin Street.  Drop-off hours are 8:30 am to 4:30 pm, Monday through Friday.  When delivering cards in person, residents are asked to place them in the marked mailbox located inside the Vandalia office.\n“This card drive is an opportunity for people of all ages to come together and share encouragement with those who may need it most,” Senator Plummer added.  “I hope families and groups throughout the district will join us in making this Valentine’s Day brighter for our seniors.”\nFor more information, residents may contact Senator Plummer’s district office by calling 618-283-3000.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#plummer-card-drive",
        "link": "https://supportmylocalcommunity.com/local-news/#plummer-card-drive",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-15",
        "is_primary": true
    },
    {
        "id": "peak-scholarship",
        "title": "PEAK SCHOLARSHIP",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Scholarship-2A-resized.webp",
        "full_story": "1/15/26\nFrontier Community College and Olney Central College are pleased to announce the Kenton Peak Scholarship, a $1,000 annual award supporting students pursuing para-medical fields, emergency medical response, and other healthcare-related programs.\nThe Kenton Peak Scholarship can be awarded to either an incoming freshman or a returning sophomore.  Funds may be used for tuition, textbooks, fees, and other program-related expenses, helping students prepare for vital roles as future first responders and healthcare providers.\nTo be eligible, applicants must, be enrolled in a para-medical, EM responder, or healthcare program at FCC or OCC, maintain a minimum 2.5 GPA, take an active role in emergency preparedness, and plan to serve as an EMT or healthcare provider after graduation.\nThe application deadline for the Kenton Peak Scholarship is February 27\nth\n.\nFor more information or to apply, visit https://iecc.edu/fcc/admissions-aid/scholarships or contact FCC or OCC Student Services.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#peak-scholarship",
        "link": "https://supportmylocalcommunity.com/local-news/#peak-scholarship",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-15",
        "is_primary": true
    },
    {
        "id": "bost-case-progresses",
        "title": "BOST CASE PROGRESSES",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Bost-1-resized.webp",
        "full_story": "1/15/26\nUS Representative Mike Bost applauded the US Supreme Court’s 7-2 decision Wednesday granting him standing in his lawsuit challenging an Illinois law that allows vote-by-mail ballots received up to 14 days after Election Day to be counted.  Vote-by-mail ballots without postmarks can also currently be tabulated up to 14 days later if they are dated on or before Election Day.\n“I’m thankful the US Supreme Court has ruled strongly in our favor and concluded we have standing to challenge Illinois’ unconstitutional law allowing vote-by-mail ballots to be counted two weeks after Election Day,” said Bost.  “This is a critically important step forward in the fight for election integrity and fair elections.  I look forward to continuing to pursue this case as we navigate the next stages of the legal process.  It’s vitally important that we restore the people’s trust in our elections.”\nBost is being represented by Judicial Watch, a conservative foundation that fights for accountability and integrity in law, politics and government.\n“This is the most important Supreme Court election law ruling in a generation,” said Judicial Watch President Tom Fitton.  “Too many courts have denied candidates the standing to challenge unlawful election rules such as the outrageous ballots that arrive after Election Day.  American citizens concerned about election integrity should celebrate this Supreme Court victory.  I thank Judicial Watch’s legion of supporters and our election law team that helped achieve this historic result.”\nBost’s election integrity lawsuit was initially filed on May 25, 2022.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#bost-case-progresses",
        "link": "https://supportmylocalcommunity.com/local-news/#bost-case-progresses",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-15",
        "is_primary": true
    },
    {
        "id": "eagle-watch",
        "title": "EAGLE WATCH",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Eagle-1-resized.webp",
        "full_story": "1/15/26\nEagle Watch, a collaboration between the US Army Corps of Engineers (USACE) Carlyle Lake Project and Case-Halstead Public Library, will take place on Saturday, January 31\nst\n.  The World Bird Sanctuary will present two “All About Eagles” programs, one at 9:30 am and another at 10:30 am, featuring a live bald eagle and offering a closer look at the fascinating nature of this iconic species.\nWhile the event is free, tickets are required to ensure a quality experience and manage limited parking.  A maximum of 120 participants per session will be allowed.  There will be an eagle craft station for children, along with eagle identification sheets and maps of local eagle nests around Carlyle Lake.  To reserve your spot, visit ticketleap.events/events/carlylelakeusace.  For more information, call the Carlyle Lake Project Office at 618-594-2484 Option 3 or email\n.\nThe 2026 Midwinter Bald Eagle Survey, conducted by USACE employees from January 9\nth\nand 10\nth\n, revealed a thriving eagle population around Carlyle Lake.  The survey identified 17 mature and 13 immature bald eagles across four counties.  Carlyle Lake, with its extensive 80 miles of shoreline, offers an ideal habitat that provides all necessary resources for these birds.  Over time, the number of eagles at the lake has steadily risen, with several active nests now established.  This increase underscores the positive impact of federal conservation efforts and laws in safeguarding these magnificent raptors.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#eagle-watch",
        "link": "https://supportmylocalcommunity.com/local-news/#eagle-watch",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-15",
        "is_primary": true
    },
    {
        "id": "at-large-vacancy",
        "title": "AT LARGE VACANCY",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/12/Trial-4-resized.webp",
        "full_story": "1/15/26\nJustice David K. Overstreet of the Supreme Court of Illinois has begun an application process for an at-large circuit judge vacancy in the Sixth Judicial Circuit.\nThe vacancy was created by the retirement of Judge Jeffrey Geisler.\nPursuant to the authority of section 12, subsection (c) of article VI of the Constitution of Illinois, the Supreme Court will appoint a person to temporarily fill that vacancy until the vacancy is filled through the general election on November 7, 2028.  The temporary appointment will terminate December 4, 2028. To be eligible for appointment to fill this vacancy, a person must be a resident in the Sixth Judicial Circuit at the time of the appointment.\nQualifications for the office of Circuit Judge are set forth in section 11 of article VI of the Constitution of Illinois and 705 ILCS 40/2(d).  Persons meeting those qualifications are invited to submit applications containing the information requested in the Applicant Information for Circuit Judge At-Large, Sixth Judicial Circuit Vacancy, along with a cover letter to Justice David K. Overstreet, P.O. Box 489, Mt. Vernon, IL 62864 or electronically to his Judicial Secretary, René Gozia at\n.  Applications must be received in his office by Monday, January 12, 2026.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#at-large-vacancy",
        "link": "https://supportmylocalcommunity.com/local-news/#at-large-vacancy",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-15",
        "is_primary": true
    },
    {
        "id": "ifb-urges-year-round-e15",
        "title": "IFB URGES YEAR-ROUND E15",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/E15-resized.webp",
        "full_story": "1/15/25\nIllinois Farm Bureau signed onto a letter with about 75 other groups urging Congress to pass a legislative solution that allows for the sale of year-round E15 as soon as possible.  The letter was sent to congressional leadership and was signed by groups representing farmers and renewable fuel.\nA bipartisan, commonsense bill to permanently allow the sale of year-round, nationwide E15 would boost farm income and lower the price drivers pay at the pump, according to the letter.  The Ag Department projects a more than 17 billion-bushel corn harvest in 2025.  “While this demonstrates the strength and productivity of America’s farmers, it also intensifies pressure on corn prices and farm incomes.  Without new markets, too many bushels will be chasing too few buyers, threatening to deepen the financial strain in rural communities,” the letter states.  “Expanding E15 access is one of the most immediate and practical ways to address this imbalance.”\nA recent study found nationwide, year-round E15 sales would add up to $25.8 billion to US Gross Domestic Product, generate up to $10.3 billion in household income and support more than 128,000 new full-time jobs across the economy, the letter states.  For consumers, E15 typically sells for 10 to 30 cents less per gallon than standard gasoline, and more than 95% of vehicles on the road are approved to use the fuel.  In recent years, E15 availability during the summer driving season has depended on temporary emergency waivers.\n“Year-to-year uncertainty discourages investment in fuel infrastructure, confuses consumers and undermines confidence among retailers and refiners,” according to the letter.  “With record corn and sorghum crops filling bins across America, farmers cannot afford another season of uncertainty and negative margins.  Markets need consistency and predictability, which requires permanent legislative action by Congress.”\nThe Illinois Corn Growers Association and Illinois Renewable Fuels Association also signed the letter.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#ifb-urges-year-round-e15",
        "link": "https://supportmylocalcommunity.com/local-news/#ifb-urges-year-round-e15",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-15",
        "is_primary": true
    },
    {
        "id": "empowering-the-next-generation",
        "title": "EMPOWERING THE NEXT GENERATION",
        "full_story": "1/13/26\nThe Full Armor Christian Academy in Louisville and Olney are bringing Alan and Lisa Robertson to Olney January 30\nth\nand 31\nst\nfor an event titled Empowering the Next Generation.\nThe event will be held at the Elm Street Christian Church at 6 pm on Friday, January 30\nth\nand at 2pm on Saturday January 31\nst\n.  Alan is a co-host of the “Unashamed” podcast, as well as an accomplished author and speaker.  Together, Alan and Lisa bring a message of vision, character, and hope as they challenge the community to invest in today’s youth, tomorrow’s leaders.  This uplifting night is designed for families, friends, and community members of all ages.  Don’t miss this special opportunity to come together and support a strong future for the next generation.\nTickets can be purchased by going to the Full Armor Facebook page and clicking the link for either the Friday night or the Saturday afternoon program and seating is limited.\nFor more information on sponsorship opportunities, please contact Full Armor at 618-392-0300.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#empowering-the-next-generation",
        "link": "https://supportmylocalcommunity.com/local-news/#empowering-the-next-generation",
        "tags": [
            "Louisville"
        ],
        "date": "2026-01-14"
    },
    {
        "id": "county-fair-queen-pageant",
        "title": "COUNTY FAIR QUEEN PAGEANT",
        "full_story": "1/13/26\nClay County Fair Queen Olivia Haun is headed to the 2026 Miss Illinois County Fair Queen Pageant which will be held on Saturday, and Sunday in Springfield.\nThe pageant happens during the 115\nth\nannual meeting and convention of the Illinois Association of Agricultural Fairs at the Crowne Plaza and Holiday Inn Express.  There are 75 County Fair Queens competing for the title.  With former county fair queens taking part, the actual competition on Saturday begins with rehearsal at 8:30 Saturday morning, and Pageant Finals beginning at 6:30 Sunday evening.\nVoting for this year’s People’s Choice award winner is underway.  Through midnight Saturday, use the link in this story to make your voice count and show support for Olivia by voting.  The cost is $1 per vote and you can vote as many times as you like.  The People’s Choice winner will be announced on stage and will earn a cash scholarship.  The winner will also get to donate $500 to a charity of their choice.\nJohnna Fulcher is the retiring Miss Illinois County Fair Queen.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#county-fair-queen-pageant",
        "link": "https://supportmylocalcommunity.com/local-news/#county-fair-queen-pageant",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "whitetails-unlimited-banquet",
        "title": "WHITETAILS UNLIMITED BANQUET",
        "full_story": "1/13/26\nThe River Bottom Stump Sitters Chapter of Whitetails Unlimited will be having a banquet on Saturday, February 28\nth\n.  The banquet will be in the gym of the St. Theresa of Avila Church in Salem.\nDoors will open at 4 pm and the dinner will begin at 6 pm.\nThere will be door prizes, an auction and gun raffle.\nTickets are now on sale, for more information or to get tickets or raffle tickets, call Sandy at ACT Tire and Auto at 618-838-2253 or email\n.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#whitetails-unlimited-banquet",
        "link": "https://supportmylocalcommunity.com/local-news/#whitetails-unlimited-banquet",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "justin-townsend-honored",
        "title": "JUSTIN TOWNSEND HONORED",
        "full_story": "1/13/26\nFairfield Mules head football coach Justin Townsend is entering the Illinois High School Football Coaches Association hall of fame as a member of the class of 2026.\nTownsend will be honored on Saturday, March 28\nth\nat the annual hall of fame banquet.  Townsend is one of six active coaches to be enshrined as part of the 16-member class.\nHe took over as head coach of the Mules in 2001 and is the winningest coach in Fairfield Mules history with a record of 150-95.  He has lead the mules to 37 consecutive conference wins from 2016-2021 and 18 IHSA state playoff appearances.\nTownsend will also be inducted into the McKendree University Hall of Fame this year, where he played from 1996 to 1999 and was a 1999 First-Team NAIA All-American and All-Mid-States Football Association selection.\nAlso to be inducted into the hall of fame is retired Lawrenceville Coach Greg Wood.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#justin-townsend-honored",
        "link": "https://supportmylocalcommunity.com/local-news/#justin-townsend-honored",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "girl-scout-cookies",
        "title": "GIRL SCOUT COOKIES",
        "full_story": "1/13/26\nIt’s officially Girl Scout Cookie season in Southern Illinois.  Girl Scouts throughout the area will hold cookie booths, visit customers door-to-door, and sell to friends and family online as they explore more possibilities through the largest girl-led entrepreneurial program in the world.\nDuring this highly anticipated time of the year, girls acquire five important life skills, goal setting, decision making, money management, people skills, and business ethics.  All proceeds from cookie sales stay local to power Girl Scout adventures year-round.  Every box of cookies sold provides invaluable experiences for Girl Scouts such as service projects, troop travel, STEM programs, and summer camp.\nLoretta Graham, Chief Executive Officer for Girl Scouts of Southern Illinois said, “When people support the Girl Scout Cookie Program, they aren’t just purchasing cookies.  They are fueling experiences and empowering girls to explore new adventures – all while girls gain skills that last a lifetime.  The cookies that customers receive in return are a ‘thank you’ for building girls of courage, confidence, and character, who make the world a better place.”\nExploremores, a rocky road ice cream–inspired sandwich cookie, will join the legendary lineup for the 2026 Girl Scout Cookie season.  Filled with delicious flavors of chocolate, marshmallow, and toasted almond–flavored crème, Exploremores reflect the spirit of exploration at the heart of every Girl Scout.  In addition to the exciting new cookie, the 2026 cookie lineup will include fan favorites such as Thin Mints, Samoas, Tagalongs, and more.\nBooths are starting to pop up throughout the region this week.  To find a booth near you or to order cookies online, visit gsofsi.org/findcookies.  While picking up some cookies for yourself, you can also purchase a box or two to donate to the Bake It Forward program.  All cookies purchased through Bake It Forward will be donated to H.E.R.O.E.S. Care – an organization supporting military personnel and their families.  The Girl Scout Cookie Program runs through March 15\nth\nin Southern Illinois.\nGirl Scouts of Southern Illinois serves over 6,300 girls and engages nearly 3,600 adults in 40 counties in Southern Illinois.  Call 800-345-6858 or email\n.  Girl Scouts of Southern Illinois is a not-for-profit organization supported by United Ways, businesses, and individual donors throughout the region.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#girl-scout-cookies",
        "link": "https://supportmylocalcommunity.com/local-news/#girl-scout-cookies",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "firewood-collection",
        "title": "FIREWOOD COLLECTION",
        "full_story": "1/13/26\nSam Dale Lake State Fish and Wildlife Area is issuing firewood collection permits.  Park officials will issue a limited number of permits on a first come, first serve basis.\nEach permit allows the holder to collect two loads of firewood.  Depending on how many applicants there are, up to three permits can be issued per year.\nAnyone interested in securing a permit should call the site office at 618-835-2922 or visit the Sam Dale Lake office.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#firewood-collection",
        "link": "https://supportmylocalcommunity.com/local-news/#firewood-collection",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "deadline-extended",
        "title": "DEADLINE EXTENDED",
        "full_story": "1/13/26\nGet Covered Illinois announced Monday that it is giving residents an additional 16 days to enroll in health insurance through the state’s official marketplace.  Customers now have until January 31\nst\nto apply for and enroll in coverage.\n“We are seeing record numbers of customers finding more affordable coverage by taking the time to shop for and compare plans” said Morgan Winters, Director of Get Covered Illinois.  “As a state-based marketplace, not only do we now have the authority to offer this special enrollment extension, but we also have more resources to support our customers in finding affordable health coverage options.”\nIllinois invested nearly $7 million dollars into navigator grants that provide enrollment support to residents and has built a strong certified broker network.  Brokers are critical enrollment partners who both help customers navigate the application and enrollment process and provide individual plan recommendations.  These services are free to Illinois residents.\n“There are more than 140 navigators and 9,000 brokers located around the state who stand ready to help our customers apply for and enroll in quality health coverage,” said Ezra Watland, Chief Operating Officer at Get Covered Illinois.  “I recommend anyone needing health coverage or who hasn’t taken the time to compare their options, use this additional time to reach out to a broker or navigator.”\nIllinois residents can connect with navigators and brokers by using the Get Covered Illinois online directory.\nThe deadline for enrolling in coverage starting February 1\nst\n, is January 31\nst\n.  Visit GetCoveredIllinois.gov to apply and enroll or call our Customer Assistance Center at 1-866-311-1119 (TTY: 711).  The Customer Assistance Center is offering extended hours through January 31\nst\n.\nGet Covered Illinois is the state’s official health insurance marketplace and a division of the Illinois Department of Insurance.  We help residents shop, compare, and enroll in quality, affordable health coverage under the Affordable Care Act.  Free, one-on-one enrollment help is available statewide from trained navigators and licensed brokers, in person, by phone, and online, with support in multiple languages.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#deadline-extended",
        "link": "https://supportmylocalcommunity.com/local-news/#deadline-extended",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "preliminary-hearing-finally-held",
        "title": "PRELIMINARY HEARING FINALLY HELD",
        "full_story": "1/13/26\nThe long-delayed preliminary hearing for former Wabash County Sheriff’s Deputy Chase Cheadle was held on Thursday, where a judge found probable cause in the case.  Cheadle entered a plea of not guilty to the remaining charges.  A pretrial hearing has been scheduled for February 19\nth\n.\nCheadle’s preliminary hearing had been postponed multiple times, with delays dating back to November of 2024.\nThe former sheriff’s department canine handler was originally charged with eight counts, including four counts of official misconduct, one count of theft, one count of cruelty to animals, and two counts of animal owner duties violations.  Five of those charges were felonies.\nHowever, in June, Special Prosecutor Brian Towne requested dismissal of two felony counts, the theft charge and one count of official misconduct, which were granted by the court.\nAccording to investigators, the 30-year-old Cheadle found his K-9 partner, Kiki, unresponsive in July of 2024.  He was later arrested following the investigation and resigned from the Wabash County Sheriff’s Department one month later.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#preliminary-hearing-finally-held",
        "link": "https://supportmylocalcommunity.com/local-news/#preliminary-hearing-finally-held",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "theis-retires",
        "title": "THEIS RETIRES",
        "full_story": "1/13/26\nIllinois Supreme Court Justice Mary Jane Theis announced her retirement from the Illinois Supreme Court effective January 29\nth\n. Justice Theis has served on the Supreme Court since 2010 and retires as one of the most prolific judges in Illinois history, having served in all levels of the judiciary in 40-plus years on the bench.  She served as Chief Justice of the Supreme Court from 2022 to 2025.\nThe Supreme Court has constitutional authority to fill interim judicial vacancies and has appointed First District Appellate Court Justice Sanjay T. Tailor to fill Justice Theis’ seat.\nJustice Tailor, whose term is effective January 30\nth\n, through December 4\nth\n, 2028, will be the first Asian American to serve on the Illinois Supreme Court.\nJustice Sanjay Tailor has been a judge for 23 years, sitting on the trial and appellate courts.  His appointment makes him the first Asian American to serve as a justice of the Illinois Supreme Court.  He was first appointed to the bench as an Associate Judge in 2003 and won election as Circuit Judge in 2022.  He served in five different divisions of the Circuit Court including as Presiding Judge of the County Division.  He also served in the Chancery, Law, Domestic Relations and Municipal Divisions.  For the last three years he has served by assignment as a First District Appellate Court justice, including as Presiding Justice of his division.\nBefore joining the bench, Justice Tailor served as an Assistant State’s Attorney in the Cook County State’s Attorney’s Office.  He also practiced law as a senior attorney at the First National Bank of Chicago, and associate at Chapman and Cutler LLP.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#theis-retires",
        "link": "https://supportmylocalcommunity.com/local-news/#theis-retires",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "wabash-communications-scholarship",
        "title": "WABASH COMMUNICATIONS SCHOLARSHIP",
        "full_story": "1/12/26\nApplications are now open for Wabash Communications scholarships.  Wabash Communications is awarding more than $20,000 to graduating seniors in the service area to help with college, trade school, or certification programs.\nWabash Communications awards more than $20,000 in scholarships annually to graduating high school seniors across the service area.\nTo qualify for the Wabash Communications scholarships your parent or legal guardian must be a member/customer of Wabash Communications or Wabash Communications Co-op, you plan to continue your education after high school at University or College, Junior college, Trade school, or Certification program.  Any field of study qualifies, there is no GPA minimum, and there are no extracurricular requirements.\nEducation is expensive.  These scholarships are meant to help offset those costs so students can stay focused on what’s next, whether that’s college, technical training, or a certification program.  If you’re continuing your education, you’re eligible to apply.\nThe application process is straightforward, complete the application and required information at\n.  Submit your application by March 6\nth\nthere is no application fee.\nIf you’re a graduating senior and meet the eligibility requirements, don’t wait.  This is an opportunity to receive financial support from a local cooperative that’s invested in your future.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#wabash-communications-scholarship",
        "link": "https://supportmylocalcommunity.com/local-news/#wabash-communications-scholarship",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "chamber-awards",
        "title": "CHAMBER AWARDS",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Winners-1-resized.webp",
        "full_story": "1/14/26\nThe Flora Chamber of Commerce announced the 2025 Annual Recognition Award winners.\nThe Business of the Year Award winner is Two Glitzy Girlz, the New Business of the Year Award winner is the Flora Diner, the Non-Profit of the year award winner is the Rotary Club of Flora, and the Citizens of the Year Award winner is Peggy James.\nThe chamber would like to thank everyone for all the wonderful nominations that were submitted this year.  We hope that you will help celebrate these winners at the awards banquet on January 31\nst\n.  Tickets are on sale through Friday January 23\nrd\n.\nFor more information regarding the awards banquet, please call Arriel Dulaney at the Chamber office at 618-662-5646.\nArriel will be the guest today on the ReVue at 2 pm.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#chamber-awards",
        "link": "https://supportmylocalcommunity.com/local-news/#chamber-awards",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "county-board-meeting",
        "title": "COUNTY BOARD MEETING",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/12/CC-Court-1-resized.webp",
        "full_story": "1/14/25 Beth Fancher\nThe Clay County Board met in regular session last night.\nTed Whitehead, Representative for Snedeker Risk Management presented Joe Goodman, Clay County Board Chairman with a dividend check for $13,440.  Snedeker Risk Management  runs the HOPE Trust and members own the trust, which provides health benefits to county, school district, city, village and other local government employees throughout the State of Illinois.  Since commencing 15 years ago, there are currently 30 public entities and schools participating in the program.\nCounty Engineer Darin Koelm announced they will be posting seasonal weight limits from January 15\nth\nto April 15\nth\n.  “There are four ways to find weight limits,” Koelm said.  “You can call the office 24 /7 and the up-to-date weight limits are listed, as well as looking on the website, also WNOI lists the weight limits and the sheriff’s office has the latest limits.  We will do whatever we can to help and are just asking county residents to help us maintain the county roads.”\nKoelm received approval for the engineer’s report, approval for the local public agency amendment of the joint funding agreement and apprised the board the department has received $750,000 from an IDOT grant.  He said they would use the money for the Hickory Hill and Butternut Road project.\nState’s Attorney Phillip Givens received approval for an interim intergovernmental agreement for the Village of Louisville to receive animal control services through Clay County.\nHeather Greenwood, team leader with Partners for Progress Deflection Initiative provided the board with information concerning the multiple counties program with community-based resources to assist individuals struggling with substance use, mental health challenges or housing insecurities.  Greenwood said there will be two deflective specialists assigned to Clay County to help keep people out of the justice system or from returning.\nLaw enforcement will make referrals, and the specialists will keep track of the individuals.  “We will be launching an event in Flora at the Church of the Nazarene on March 4\nth\n,” Greenwood explained.  “More information will be announced on the upcoming event.”\nThe board passed an intergovernmental agreement and passed an ordinance for public transportation presented by Central Illinois Public Transit.\nClay County Hospital CEO and President Bob Sellers said there was a meeting for bid contractors.  The bids will be announced for the grant project for building a new Health Department at the February Hospital Board and then to the County Board meeting.  Sellers received approval for the Hospital Report, approval to have Lindy Kohn’s name added to the Bank ACH authorizations and approval to purchase hospital waiting room furniture and two infusion recliners for $72,895.  He also announced the hospital has signed a contract with Chiropractor Brittany Hoselton.  She will be working in the Louisville Clinic and said he felt this would add a new holistic realm of the medical needs the hospital can offer.\nSheriff Andy Myers obtained authorization for the Sheriff’s Office report for December and secured approval for a Major Case Squad Intergovernmental Agreement.  “The squad will be made up of officers from I-70 south,” Sheriff Myers said.  “With Lt. Abner’s experience I think he will fit the needs.  There will be no money exchange since we will be working together.”\nBoard member Terry Hronec with the board executive finance committee, received approval for the following purchases paid out of the Capital Expenditure Account: a track hoe for the Highway Department; a server for the courthouse, $18,719.29; computers for the County Clerk’s Office, $7,988 and scuba gear for ESDA, $13,895.89.\nA resolution was passed ensuring county office holders reimburse the county for associated benefits match payroll costs on employee stipend/bonuses.\nBoard member Barbara McGrew was appointed as a member of the Southern Illinois Economic Development Authority (SIEDA) board.  She will be replacing board member Jeremy Kohn who asked to be replaced because of meeting times.\nThe transfer of the proceeds for the sale of 935 Bryant Street, in Louisville to Clay County Hospital, $94,887 was approved for bookkeeping purposes.  A six-month extension for Kemper CPA to complete the Circuit Clerk’s audit was approved.\nBoard member Barb McGrew read the results of the December Claims Committee meeting.  There was $3,315,180.84 paid claims and $352,636.85 unpaid claims from the Hospital; $802,063.40 paid claims and $75.00 unpaid claims from County Highway; $780,479.54 paid claims and $2,819.77 unpaid claims from the Health Department; $258,509.31 paid claims from Clay County; $2,801.50 paid claims from 911; $108,529.16 paid claims from the Public Safety Tax and $4,616.45 paid claims from Animal Control.\nThe December Sheriff’s Department activity report included issuing 21 traffic citations, 25 criminal arrests served 26 various civil papers, conducted 30 criminal investigations and 17 accident investigations.  There were 19 people processed through the jail.  The Sheriff’s Office received $653.60 which included: $528 civil process; $6 E-citations; $89.60 IDOC transport fees and $30 report fees.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#county-board-meeting",
        "link": "https://supportmylocalcommunity.com/local-news/#county-board-meeting",
        "tags": [
            "Police/PD",
            "Louisville",
            "Flora"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "clip-and-tip-strays-cats",
        "title": "CLIP AND TIP STRAYS (C.A.T.S.)",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Cats-Jan-resized.webp",
        "full_story": "1/14/26\nTwenty Clay County cats were sterilized on Tuesday, January 13\nth\nat a Spay & Neuter Clinic Day in Flora run by the nonprofit Clip and Tip Strays (C.A.T.S.).\nLicensed traveling veterinarian Dr. Meghann Jerden conducted the surgeries at the Wags and Wash Salon at 421 West North Avenue in Flora.  Five C.A.T.S. volunteers from Louisville and Flora assisted.\nSurgeries were done at affordable rates: $80 for a spay and $50 for a neuter and included rabies vaccination.  The 10 female and 10 male cats were outside community cats, barn cats, and inside owned cats.  Surgeries were funded by cat owners and caretakers.\nCat Osterholtz, founder/chairperson of C.A.T.S., and owner of Wags and Wash Salon, said: “This is our second large Spay & Neuter Clinic Day with Dr. Jerden coming to Flora.  Our first Clinic Day in November sterilized 38 cats. Last month, our volunteers transported 10 cats to her location for surgeries.  Within a short span, our program has helped 68 cats in Clay County get on the road to healthier, longer lives.  We plan to conduct a sterilization clinic once a month to reduce the cat overpopulation problem in our county.”\nSpaying/neutering not only stops the breeding cycle, it also delivers numerous behavioral and health benefits for both male and female cats.\nClip and Tip Strays (C.A.T.S.) is a new, volunteer-driven nonprofit based in Flora.  The group aims to raise funds through fundraisers and donations and conduct Trap-Neuter-Release (TNR) as a cost-effective, humane way to control the feral and stray feline population in Clay County.  C.A.T.S. also offers traps and carriers to cat owners and caretakers for trapping and transport.\nFollow C.A.T.S. on its Facebook page for upcoming Clinic Day updates or call/text 618-662-3837, or contact them by mail at PO Box 23, Flora, IL 62839.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#clip-and-tip-strays-cats",
        "link": "https://supportmylocalcommunity.com/local-news/#clip-and-tip-strays-cats",
        "tags": [
            "Louisville",
            "Flora"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "xenia-village-board-meeting",
        "title": "XENIA VILLAGE BOARD MEETING",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/11/Xenia-1-resized.webp",
        "full_story": "1-13-2026Timothy Russell\nThe Xenia Village Board met in regular session last night.\nAll trustees were in attendance including the village attorney who attended via speaker phone.\nThe First item of business on the agenda was the appointment of Logan Dye to the Gateway water and sewer board of Trustees.  Followed by the approval of minutes from December’s meeting, and approval of the treasure’s report, and bills.\nIt was reported that water loss of 8% or 69,332 gallons for November thru December and 13% or 92,448 gallons for December thru January.  In old business, the board of trustees discussed recent construction work which had taken place on one property that had been purchased and remained vacant for some time.  Updates were provided on the Slagley property which trustees hoped might become the location of a Dollar General in the village.  However, the site was rejected due to its small size.\nThe Knapp gas station located in Xenia also closed unexpectedly last month after a visit from the Department of Revenue and is not expected to re-open.\nThe status of the IMRF state retirement fund for the village remains uncertain after months with no updates.  The Villages attorney plans to reach out to state representatives regarding the matter.\nIn police Business Officer Jerry Burkett told trustees that repairs had been made to police cruisers including a new battery in the Explorer and a new grill on the Impala.\nTrustees discussed options for repair and or replacement of the heating and air conditioning in the cafeteria and gathering options for the placement of a notice of bid for the repairs.  No action was taken on the matter after a question of numerous repairs to the gym were raised, and it could be determined which repair were a higher priority as well as where the money for repairs would come from.  Trustees discussed bringing in city engineer Mike Bridges to make assessments before any decision is made.\nThe reestablishing of committees to enforce village ordinances was also discussed before being tabled, citing the need for more information on how the committees’ function and clearer outlines of committee duties and responsibilities.  The Villages police breakfast was set for February 6\nth\nfrom 6 to 10 am.  Options of biscuits and gravy, eggs and sausage and possibly cinnamon rolls will be available to those who attend.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#xenia-village-board-meeting",
        "link": "https://supportmylocalcommunity.com/local-news/#xenia-village-board-meeting",
        "tags": [
            "Xenia",
            "Police/PD"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "kinmundy-fire",
        "title": "KINMUNDY FIRE",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Fire-1-resized.webp",
        "full_story": "1/14/26\nOne person was burned at about 4:30 on Monday afternoon when a fire destroyed a barn in rural Kinmundy.\nKinmundy-Alma Fire Chief Kevin Day says Trevor Robins was using a cooker inside a barn on Meachum Road.  Robins says he was using a cooker when he heard a propane tank beginning to pop off.  He told everyone to get out, but before he was able to exit a flash fire occurred.  Robins received first and second degree burns to his face and arms and was transported to Salem Township Hospital.\nWhen firemen arrived on the scene, Chief Day says the fire had fully engulfed the 30 by 60 foot pole barn.  The barn along with a car, boat, and three propane tanks were destroyed.  Firemen were on scene for about 2 hours.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#kinmundy-fire",
        "link": "https://supportmylocalcommunity.com/local-news/#kinmundy-fire",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "effingham-teacher-arrested",
        "title": "EFFINGHAM TEACHER ARRESTED",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/12/arrested-2-resized.webp",
        "full_story": "1/14/26\nA teacher was arrested by Effingham Police on Friday after they said he sent “inappropriate electronic messages” to a student.\nIn a news release Monday afternoon, Effingham Police officials said they took a report on Friday alleging this communication between a student and 32-year-old Dakota M. Czerwonka Montrose.  Czerwonka was described as the founder of Crossroads Montessori School in Effingham, where he also taught.\nThe Effingham County State’s Attorney’s Office charged Czerwonka with one count of grooming and one count of sexual exploitation of a child.  They are both Class 4 felonies punishable by one to three years in prison and mandatory sex offender registration if convicted.\nThe State’s Attorney’s Office has filed petition to detain Czerwonka throughout the pretrial phase of his case.  Grooming is a detainable offense under the SAFE-T Act, and the Effingham Police Department supports detention due to Czerwonka’s occupation and the victim’s status as a student and minor.\nCzerwonka made his first court appearance on Monday.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#effingham-teacher-arrested",
        "link": "https://supportmylocalcommunity.com/local-news/#effingham-teacher-arrested",
        "tags": [
            "Police/PD"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "laker-academic-invitational",
        "title": "LAKER ACADEMIC INVITATIONAL",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Academic-Callenge-26-resized.webp",
        "full_story": "1/14/26\nOn Friday, February 6\nth\n, Lake Land College will host local high school students for the first-ever Laker Academic Invitational, a competitive event designed to challenge and recognize academic excellence.\nDuring the event, more than 300 students across 17 local high schools will compete in a series of multiple-choice exams, demonstrating their knowledge in biology, chemistry, computer science, software applications, English, mathematics and physics.  Through these experiences, the event fosters curiosity and confidence as students challenge themselves in a supportive environment and explore future college and career pathways.\nThe Laker Academic Invitational was designed to provide an engaging academic challenge for high school students following the discontinuation of the traditional ACES competition, which was previously held every year at Lake Land College.\nTessa Wiles, Director of Dual Credit and Honors Experience explained “We received an overwhelming response from the community that showed just how much ACES meant for high schools and their students, so we wanted to do what we could to ensure the event lives on.”  “We’re thankful for everyone who helped make this possible, and we look forward to seeing the positive impact it has on students and the community.”\nTo learn more about the Laker Academic Invitational, contact Dual Credit Events & Onboarding Specialist Ashlyn Paige at 217-234-5396 or\n.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#laker-academic-invitational",
        "link": "https://supportmylocalcommunity.com/local-news/#laker-academic-invitational",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "corn-yields",
        "title": "CORN YIELDS",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Corn-Field-resized.webp",
        "full_story": "1/14/26\nUSDA estimates American corn farmers produced more than 17 billion bushels of corn in 2025.\nThe record estimate, higher than the average trade guess, was boosted by a significant increase in harvested acres.  Since the June acreage report, the agency bumped its harvested area estimate by 4.5 million acres to 91.25 million – the highest since 1933.  The corn yield estimate was also higher at a record 186.5 bushels per acre, up from 179.3 in 2024.\nUSDA pegged Illinois corn production from last season at 2.35 billion bushels with an average yield of 214 bushels per acre, down 3.2% from its November estimate.\nThe higher production number boosted ending stocks, now seen at 2.22 billion bushels nationwide.  According to the quarterly stocks report released the same day, U.S. quarterly corn stocks on December 1\nst\nwere 13.82 billion bushels, up from 12 billion the year prior.\nU.S. soybean production came in at 4.26 billion bushels, with harvested area of 80.4 million acres and a record average yield of 53 bushels per acre, all slightly above trade expectations.  Yield was higher than 2024/25 but production was lower due to fewer harvested acres.  For Illinois, soybean yield was down 3.8% from November at 62.5 bushels per acre.\nSoybean stocks estimates are 350 million bushels, up from 290 million in December.  Quarterly stocks on December 1\nst\nwere at 3.29 billion, up from 3.1 billion a year ago.\nUSDA also increased Brazilian soybean production by 3 million metric tons as the country’s harvest begins.\nWhile the January estimates are considered USDA’s final revisions to 2025 corn and soybean production, Camp said the agency could still make adjustments.  But it likely would not be until the September report.\nFor winter wheat, the agency estimates U.S. farmers planted 32.99 million acres in 2025, slightly above trade expectations but below the year prior (33.15 million).  Wheat ending stocks were pegged at 926 million bushels, up from 901 million in December due to lower use.  Quarterly stocks for wheat came in at 1.68 billion bushels.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#corn-yields",
        "link": "https://supportmylocalcommunity.com/local-news/#corn-yields",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "meet-the-candidates",
        "title": "MEET THE CANDIDATES",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Meet-the-Candidates-resized.webp",
        "full_story": "1/14/26\nFrontier Community College in Fairfield will be hosting a Meet the Candidates Forum at Workforce Development Center on Thursday, February 19\nth\nfrom 6 to 8 pm.\nThose that attend can meet the candidates in the following races: Wayne County Treasurer, Wayne County Clerk, Wayne County Coroner, and Illinois State Representative for District 116.\nThe event will follow an informal format.  The evening will begin with introductions of all candidates participating in the March primary, followed by a structured question-and-answer session for the three candidates in the coroner’s race.  After the Q&A, attendees will have the opportunity to visit each candidate during a meet-and-greet session, allowing for more personal conversations with constituents.\nMembers of the public are encouraged to submit questions for the candidates to be addressed during the forum.  Questions may be sent to the FCC Student Senate email at\n.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#meet-the-candidates",
        "link": "https://supportmylocalcommunity.com/local-news/#meet-the-candidates",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "farm-building-checkup",
        "title": "FARM BUILDING CHECKUP",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Farm-Building-resized.webp",
        "full_story": "1/12/26\nThe winter months serve as a good time for farm building checkups.  Jeremiah Fairbanks is with Morton Buildings.\ncut 1:26 ‘…there.’\nHe says walk around the building to inspect the splashboard, a protective baseboard around a building exterior, especially for older structures.  Replacement is one option, since a rotted splashboard impacts the structural integrity of the building.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#farm-building-checkup",
        "link": "https://supportmylocalcommunity.com/local-news/#farm-building-checkup",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "a-part-that-broke-on-a-ups-plane-that-crashed-in-k",
        "title": "A part that broke on a UPS plane that crashed in Kentucky failed 4 times on other planes years ago",
        "image": "https://bloximages.newyork1.vip.townnews.com/wsiltv.com/content/tncms/assets/v3/editorial/9/d7/9d7749da-5b75-45ed-9347-aa8f31f146a7/69680a397f06e.image.jpg?crop=1280%2C672%2C0%2C144&resize=1200%2C630&order=crop%2Cresize",
        "full_story": "AP\nA part that broke on a UPS plane that crashed in Kentucky failed 4 times on other planes years ago\nThe National Transportation Safety Board says Boeing warned plane owners in 2011 about a flaw in the part that failed and contributed to the engine flying off a UPS plane before it crashed and killed 15 in November but at that point the planemaker didn’t believe it threatened safety\nBy JOSH FUNK - AP Transportation Writer\nJan 14, 2026\nJan 14, 2026\nUpdated\n1 hr ago\nCopy article link\nBoeing warned plane owners in 2011 about a broken part that contributed to a UPS plane crash that killed 15 last year but at that point the planemaker didn't believe it threatened safety, the National Transportation Safety Board said Wednesday.\nThe\nin November 2025 shortly after taking off in Louisville, when the\nas the plane rolled down the runway.\nThe NTSB said Wednesday that Boeing had documented in 2011 there were four previous failures of a part that helps secure the MD-11's engines to the wings on three different planes, but at that point the planemaker \"determined it would not result in a safety of flight condition.\"\nNTSB didn't say whether there had been additional documented failures of the spherical bearing race since 2011. Investigators found that part broken into two pieces after the UPS crash, and the lugs that held that part were cracked.\nPhotos released by the NTSB of the Nov. 4 crash show flames erupting as the rear of the engine starting to detach before it flew up and over the wing. Then the wing was engulfed by fire as the burning engine flew above it.\non the plane that was headed for Hawaii were killed along with\non the ground near Louisville's Muhammad Ali International Airport.\nThe factual report released Wednesday doesn’t state what caused the engine to fly off. That conclusion won't come until the NTSB's final report, which usually doesn't come until more than a year after a crash.\nBoeing, UPS and the Federal Aviation Administration are limited on what they can say while the NTSB investigation is ongoing.\nUPS spokesperson Jim Mayer reiterated that the company was devastated by the crash. “We remain profoundly saddened by the Flight 2976 accident. Our thoughts continue to be with the families and Louisville community who are grieving, and we remain focused on the recovery effort,” Mayer said.\nThe NTSB previously said investigators\nin some of the parts that held the engine to the wing. Those cracks hadn't been caught in regular maintenance done on the plane, which raised questions about the adequacy of the maintenance schedule. The last time those key engine mount parts were examined closely was in October 2021, and the plane wasn't due for another detailed inspection for roughly 7,000 more takeoffs and landings.\nThe 34-year-old MD-11 plane only got 30 feet (9.1 meters) off the ground before crashing into several industrial buildings just past the runway and generating a massive fireball that could be\n. Dramatic videos of the crash showed the plane on fire as it plowed into buildings and released a massive plume of smoke.\nAirlines quit flying this type of plane commercially years ago because it isn't as efficient as newer models, but they had continued to fly for cargo carriers like UPS and FedEx and a few of these planes were also modified for use in firefighting. All the MD-11s that had been in use and 10 related DC-10s have been\n.\nIt's not clear when the cracks started to develop in the engine mounting pylon parts, but this crash is reminiscent of a 1979 crash in Chicago when the left engine flew off an American Airlines DC-10 during takeoff, killing 273 people. The DC-10 was the predecessor of the MD-11.\nThat previous crash led to the worldwide grounding of 274 DC-10s. The airline workhorse was allowed to return to the skies because the NTSB determined that maintenance workers damaged the plane that crashed while improperly using a forklift to reattach the engine. That meant the crash wasn’t caused by a fatal design flaw even though there had already been a number of accidents involving DC-10s.\nCopyright 2026 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.\nCopy article link\nTags\nAug 18, 2022\nDec 9, 2025\nUpdated\nJun 24, 2023\nUpdated\nMar 7, 2024\nFeb 28, 2025\nApr 16, 2025\nRecommended for you",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#a-part-that-broke-on-a-ups-plane-that-crashed-in-k",
        "link": "https://supportmylocalcommunity.com/local-news/#a-part-that-broke-on-a-ups-plane-that-crashed-in-k",
        "tags": [
            "Louisville"
        ],
        "date": "2026-01-14",
        "is_primary": false
    }
]