[
    {
        "id": "north-clay-board-meeting",
        "title": "NORTH CLAY BOARD MEETING",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/12/NorthClarCardinals-resized.webp",
        "full_story": "The North Clay School Board met in regular session on Wednesday night.\nKaitlin Zink, Elementary/Junior High Physical Education teacher spoke on behalf of the PE Department regarding the positive impact of the new facilities.  She highlighted how the expanded space has fostered a safer environment and allowed for more structured educational units across a wider variety of activities.\nSuperintendent Keith Price discussed what a school district’s Health Life Safety Survey is and the proposed amendment.  School districts have Health Life Safety Surveys that identify specific areas of school facilities that are in need of repair or improvement.  In order for an item to be on the survey, it must be approved by an architect, the Regional Office of Education and the Illinois State Board of Education.  Two items added include patchwork and recoating of the outer shell of the main high school building, and an electrical power upgrade for the high school industrial arts shop.\nThe board approved the purchase of a new drivers education vehicle.\nIn personnel matters the board hired Andrew Conrad as Head High School Bass Fishing Coach, and Dustin Smith as high school track and field head coach.  They also approved Gavin Hosselton as a high school boys basketball volunteer coach, and Malorie Craig as High School Volleyball Head Coach.  Resignations were accepted from Neal Conard as Head High School Bass Fishing Coach, effective immediately, and Amanda Bailey as head high school Track and Field Coach.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#north-clay-board-meeting",
        "link": "https://supportmylocalcommunity.com/local-news/#north-clay-board-meeting",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-23",
        "is_primary": true
    },
    {
        "id": "north-wayne-school-board",
        "title": "NORTH WAYNE SCHOOL BOARD",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/12/North-Wayne-School-District-resized.webp",
        "full_story": "The North Wayne School Board met in regular session Wednesday night.\nBoard members accepted an anonymous donation in the amount of $2500 to the Cisne High School FFA.  They also approved an agreement with Garaventa Lift Company to replace the lift at CHS, and an overnight trip for CHS FFA to attend the ground zero conference in Carbondale on January 30\nth\nand 31\nst\n.\nIn personnel matters the board hired Chynna Keyser as CMS Health and PE Teacher for the 2026-27 school year, and approved Rick Porter to serve as a volunteer softball coach for CHS.  They also accepted the letter of resignation from Lauren Grace Conard as CMS Assistant Softball Coach.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#north-wayne-school-board",
        "link": "https://supportmylocalcommunity.com/local-news/#north-wayne-school-board",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-23",
        "is_primary": true
    },
    {
        "id": "boy-scout-bbq",
        "title": "BOY SCOUT BBQ",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/BOY-Scout-26-resized.webp",
        "full_story": "The Flora Boy Scouts will have their 46th annual Boy Scout BBQ on Saturday, March 21\nst\nfrom Noon to 5 pm at the Flora Church of the Nazarene.  Menu is BBQ, baked beans, slaw, and cake and the cost is $8.\nTickets can be purchased from any boy scout or can be purchased on the day of the BBQ.\nAll proceeds go to the local Troop in preparation for the 2026 summer camp trip to the Current River and Merit Badge trainings.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#boy-scout-bbq",
        "link": "https://supportmylocalcommunity.com/local-news/#boy-scout-bbq",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-23",
        "is_primary": true
    },
    {
        "id": "honor-flight-accepting-applications",
        "title": "HONOR FLIGHT ACCEPTING APPLICATIONS",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/LOL-HF-resized.webp",
        "full_story": "Land of Lincoln Honor Flight is accepting applications from World War II, Korean Era, and Vietnam Era veterans for the 2026 flying season.  Veterans who served any time between 1942 and May 7, 1975; regardless of their duty assignment or where they were assigned for duty, are eligible to participate in an Honor Flight.\nThese veterans will experience a well-deserved day of gratitude by visiting the memorials in Washington DC dedicated to their heroic service.\nThis one-day flight from Springfield, is provided free to the Veteran.\nVeteran and Guardian Applications are available from the Land of Lincoln Honor Flight website (landoflincolnhonorflight.org) or by emailing to:",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#honor-flight-accepting-applications",
        "link": "https://supportmylocalcommunity.com/local-news/#honor-flight-accepting-applications",
        "tags": [
            "Obituary"
        ],
        "date": "2026-01-23",
        "is_primary": true
    },
    {
        "id": "idoa-senior-hall-of-fame",
        "title": "IDOA SENIOR HALL OF FAME",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/IDOA-1A-resized.webp",
        "full_story": "The Illinois Department on Aging (IDoA) is seeking nominations for the 2026 induction class of the Senior Illinoisans Hall of Fame, which honors the accomplishments of Illinois residents aged 65 and older.\nEach year, four older adults are inducted into the Hall of Fame for their work in the arts, sports, and entertainment; community service; education; or the labor force.  Anyone may nominate an older adult for consideration.\nTo be eligible for nomination to the Hall of Fame, nominees must be at least 65 years old at the time of nomination; and a current Illinois resident or a previous resident of Illinois for most of their life.\nPosthumous nominations are also accepted, provided the nominee was 65 or older and living in Illinois at the time of death.\nTo guarantee consideration for the 2026 induction class, nominations must be submitted on or before June 2\nnd\n.  Nominators of new Hall of Fame inductees are expected to participate in an award ceremony honoring their nominee and highlighting their accomplishments.\nCompleted nomination forms may be submitted electronically or returned via US mail, fax, or email.  For more information or to submit a nomination, please visit\n. Information about past Hall of Fame inductees is available",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#idoa-senior-hall-of-fame",
        "link": "https://supportmylocalcommunity.com/local-news/#idoa-senior-hall-of-fame",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-23",
        "is_primary": true
    },
    {
        "id": "winter-storm",
        "title": "WINTER STORM",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Winter-Warning-1-resized.webp",
        "full_story": "The National Weather Service has issued a Winter Storm Warning for portions of south east Illinois.  Heavy snow expected with total snow accumulations of between 5 and 9 inches.\nThe developing winter storm will impact portions of southern Illinois this weekend.  John Baranick is an ag meteorologist with DTN.\ncut 1:20 ‘…..lock in.’\nAny threat of freezing rain should say well south of the Ohio River.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#winter-storm",
        "link": "https://supportmylocalcommunity.com/local-news/#winter-storm",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-23",
        "is_primary": true
    },
    {
        "id": "winter-storm-watch",
        "title": "WINTER STORM WATCH",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/WSW1-resized.webp",
        "full_story": "The National Weather Service in Paducah says a Winter Storm Watch will be in effect for our listening area from late Friday night through Sunday morning.\nHeavy snow is possible with total snow accumulation between 4 and 8 inches.\nYou should check the latest forecasts for updates.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#winter-storm-watch",
        "link": "https://supportmylocalcommunity.com/local-news/#winter-storm-watch",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-22",
        "is_primary": true
    },
    {
        "id": "flora-school-board",
        "title": "FLORA SCHOOL BOARD",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/FloraHS-1-resized.webp",
        "full_story": "The Flora School Board met last night in regular session.\nBoard members recognized the 2025-2026 Illinois State Scholars and approved the purchase of the Flora High School gym video board through Nevco.\nSuperintendent Joel Hackney reported that the District Technology Committee met on January 12\nth\nand the next Curriculum Advisory Committee meeting will be on February 4\nth\n.  The Board discussed progress on district improvement goals, upcoming projects, and highlighted the institute on January 6\nth\nwhere staff received Stop the Bleed training.  And the board authorization of Superintendent to prepare the 2026-2027 school district budget.\nIn personnel action the board employed Allie Krutsinger as elementary teacher for the 2026-2027 school year and approved Jake Ledgerwood as high school boys’ track coach, and Emily Welty as head high school volleyball coach.  They also accepted the resignation as school nurse secretary submitted by Loretta Hutchens effective January 8\nth\n.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#flora-school-board",
        "link": "https://supportmylocalcommunity.com/local-news/#flora-school-board",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-22",
        "is_primary": true
    },
    {
        "id": "critter-fixers-report",
        "title": "CRITTER FIXERS REPORT",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Critter-Fixers.jpg-resized.webp",
        "full_story": "The members of the Southern Illinois Critter Fixers reported the progress made during 2025 toward the reduction of the feral pet population.  Southern Illinois Critter Fixers is a not for profit 501(c)(3) organization, therefore your donation is tax deductible.\nIn Flora there were a total of 40 spay and neuters, 41 in Louisville, 3 in Clay City, 3 in Xenia and 25 in Cisne.  In 2025, Southern Illinois Critter Fixers spayed or neutered 164 cats and kittens from Wayne, Clay, Edwards, and White counties.\nAll veterinary clinics in Wayne County and each adjacent county have been invited to participate in this endeavor.  The board will authorize all expenditures and payments to veterinary clinics for spay, neuter, and vaccinations.\nFor more information contact Mary Murphy at 618-599-6035.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#critter-fixers-report",
        "link": "https://supportmylocalcommunity.com/local-news/#critter-fixers-report",
        "tags": [
            "Xenia",
            "Louisville",
            "Flora",
            "Clay City"
        ],
        "date": "2026-01-22",
        "is_primary": true
    },
    {
        "id": "meet-and-greet",
        "title": "MEET AND GREET",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/CCH-MG-1.jpg-resized.webp",
        "full_story": "Clay County Hospital is welcoming its newest provider to the Louisville Medical Clinic with a meet the provider event on Friday, January 30th from 8 to 10 am.\nPeople will get to meet Dr. Brittani Hosselton and her office manager Becky Barber at Common Grounds Coffee Lounge.  Dr. Hosselton will open her practice at the Louisville clinic on March 2nd.  The first 50 customers will get a free drink courtesy of the Clay County Hospital.  Everyone is encouraged to stop in to welcome Dr. Hosselton as she prepares to move her practice into the Louisville Clinic.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#meet-and-greet",
        "link": "https://supportmylocalcommunity.com/local-news/#meet-and-greet",
        "tags": [
            "Louisville"
        ],
        "date": "2026-01-22",
        "is_primary": true
    },
    {
        "id": "reduced-weight-limits",
        "title": "REDUCED WEIGHT LIMITS",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Seasonal-Weight-Limit-resized.webp",
        "full_story": "Beginning Friday seasonal reduced weight limits will be suspended until further notice for all roads included in the county highway system with seasonal weight limit signs.  Weight limit restrictions may be in place on township roads.  Please contact the respective township road commissioner. Please tune to WNOI, Clay County Sheriff’s phone app or visit the Engineer/ Highway website under Offices Section of the Clay County web site.\nThe highway department would like to keep the roads open as much as possible.  PLEASE respect the load limits when they are in effect.  Damaging the roads with heavy loads not only costs taxpayer money but it also affects your neighbors and fellow Clay County residents.  Please be kind and respect the load limits.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#reduced-weight-limits",
        "link": "https://supportmylocalcommunity.com/local-news/#reduced-weight-limits",
        "tags": [
            "Police/PD"
        ],
        "date": "2026-01-22",
        "is_primary": true
    },
    {
        "id": "iecc-board-meeting",
        "title": "IECC BOARD MEETING",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/IECC-6-resized.webp",
        "full_story": "The Board of Trustees of the Illinois Eastern Community College met Tuesday at Lincoln Trail College, Robinson.\nBoard members approved affiliation agreement between Southern Illinois University (SIU) and IECC for continuation of the Motorcycle Rider Program and Crawford County Cares and Middle Tennessee School of Anesthesia.\nIn personnel action Ronald Banta was hired as a Maintenance Worker Team Lead, at OCC, and the resignations of Cori Stringfellow as Nursing Instructor, at WVC and Avery Miller, Custodian, at OCC.\nThe next regular meeting of the Board of Trustees will be on Tuesday, February 17\nth\n, at 6:15 pm at Olney Central College.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#iecc-board-meeting",
        "link": "https://supportmylocalcommunity.com/local-news/#iecc-board-meeting",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-22",
        "is_primary": true
    },
    {
        "id": "ribbon-cutting",
        "title": "RIBBON CUTTING",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/RIBBON-CUTTING-resized.webp",
        "full_story": "The Flora Chamber of Commerce will host a ribbon cutting ceremony on Tuesday, February 3\nrd\n, to celebrate Axiom Healthcare of Flora and welcome them to the local business community.\nThe event will begin at 1:00 pm and will take place at 232 Given Drive.  Chamber members, city officials, and community members are invited to attend and show their support.  Light refreshments will be available.\nAxiom Healthcare of Flora provides quality healthcare services and represents an important addition to Flora’s growing healthcare options.  The ribbon cutting marks the official opening and highlights the Chamber’s continued commitment to support businesses that strengthen the local community.\n“The Chamber is proud to welcome Axiom Healthcare of Flora,” said Arriel Dulaney, Flora Chamber of Commerce.  “We look forward to their positive impact on our community and are excited to celebrate this milestone with them.”\nFor more information about the ribbon cutting or the Flora Chamber of Commerce, please contact the Chamber office.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#ribbon-cutting",
        "link": "https://supportmylocalcommunity.com/local-news/#ribbon-cutting",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-22",
        "is_primary": true
    },
    {
        "id": "illinois-basin-safety-awareness-day",
        "title": "ILLINOIS BASIN SAFETY AWARENESS DAY",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/IL-Basin-Safety-resized.webp",
        "full_story": "The Illinois Petroleum Resources Board (IPRB) and Indiana Oil & Gas Association (INOGA) will be teaming up to host the Illinois Basin Safety Awareness Day on Thursday, February 26\nth\nat the 404 Seed Station in Carmi.  This event expands on the annual Illinois Basin Celebration held in Carmi since 2022, offering an extensive oilfield safety awareness-focused program in addition to the regular oilfield worker appreciation day theme.  The event will again be open to all Illinois Basin oil and gas exploration and production industry professionals, featuring a complimentary catered breakfast and lunch, as well as complimentary Illinois Basin Proud hoodies, stocking caps, flags and stickers.\nThe safety awareness program will kick off with a safety presentation by CountryMark Safety Manager Ben Vaupel from 10 am to10:45 am.  A team safety trivia competition led by Campbell Energy’s Alan Hatten will follow from 10:45-11:15 am.  A group drone photo will be taken outside of the 404 Seed Station from 11:15-11:30 am, followed by lunch and a live line demonstration conducted by Wayne-White Electrical Cooperative lineman and former oilfield worker Nathan Coston from 11:30 am till 12:30 pm.\nAlternate time slots for Vaupel’s presentation and Hatten’s safety trivia competition will be offered from 1 pm to 1:45 pm and 1:45 pm to 2:15 pm, respectively.  Attendees will not be required to attend the afternoon sessions if they attended the morning sessions.  IPRB will also offer careers presentations and oilfield equipment demos to area high school students throughout the day, weather permitting.\nPlease email , text or call IPRB executive director Seth Whitehead (\nor 618-367-4751) to reserve your seat today, as space will be limited.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#illinois-basin-safety-awareness-day",
        "link": "https://supportmylocalcommunity.com/local-news/#illinois-basin-safety-awareness-day",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-22",
        "is_primary": true
    },
    {
        "id": "weather-spotter-training",
        "title": "WEATHER SPOTTER TRAINING",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/WX-Spotter-1-resized.webp",
        "full_story": "The National Weather Service is offering their annual severe weather spotter training on March 19\nth\nat 6:00 pm.  The class will be held at Frontier Community College.\nSevere storm spotters are a VITAL part of the severe weather warning process.  Spotters provide critical, and potentially, lifesaving information to their communities and surrounding locations – and to National Weather Service (NWS) forecasters who are using these reports to help issue warnings and keep the public updated during severe weather events.\nThe in-person training covers severe weather hazards including thunderstorms and tornadoes, safety concerns, planning for and anticipating severe thunderstorms, general storm structure and movement, and identification of important storm features.\nThis year’s program offers more interactive portions of the sessions.  The session will last about 2 hours and are free and open to the public.  Registration is required and is available at wewather.gov/pah/spottertraining or scan the QR Code on the event flyers.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#weather-spotter-training",
        "link": "https://supportmylocalcommunity.com/local-news/#weather-spotter-training",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-22",
        "is_primary": true
    },
    {
        "id": "clmt-events-start-in-effingham",
        "title": "CLMT EVENTS START IN EFFINGHAM",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/CLMT-Training-1-resized.webp",
        "full_story": "Livestock operations are strengthened by having certified individuals on staff.  Certification helps minimize environmental impacts through increased awareness of regulations and proper manure nutrient management.  Anyone responsible for managing a facility can benefit from increasing their knowledge and expertise.\nFarm operators and staff can get certified through one of University of Illinois Extension and the Illinois Department of Agriculture’s (IDOA) 2026 Certified Livestock Manager Training or CLMT workshops, kicking off Tuesday, February 3\nrd\nin Effingham.\nDepending on the size of an operation, livestock manager training certification is required for many Illinois production livestock facilities.  A certified livestock manager is a full-time employee who is familiar with the farm’s manure management system and is located within one hour’s driving distance of the farm, accessible by phone when needed.\nThe Effingham event will be held at the University of Illinois Extension Office, at 1209 North Wenthe Avenue.  Find facility and size requirements described online at go.illinois.edu/CLMT.  Pre-registration is required to attend an in-person workshop.  Class size is limited.\nThe workshop will open at 8:30 am, and training will begin at 9 am.  The training lasts 3.5 hours, and IDOA staff will administer the exam after the training.  The Illinois Extension training fee is $40, and IDOA’s certification fee is $30.  To be certified, all participants need to attend the entire workshop.\nTraining covers a range of topics related to the operation, management, and utilization of livestock waste and waste facilities.  The training manual used is the Livestock and Poultry Environmental Stewardship Curriculum.  It is available online at go.illinois.edu/manual.\nFor those unable to attend, online training and testing are available year-round at go.illinois.edu/CLMT, following the same format as the in-person workshops.  Those needing certification for over 1,000 animal units may take the test online following the training.\nIf you have program questions or need a reasonable accommodation to participate, please contact Stanley Solomon, Illinois Extension educator at\nor by phone at 815-235-4125.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#clmt-events-start-in-effingham",
        "link": "https://supportmylocalcommunity.com/local-news/#clmt-events-start-in-effingham",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-22",
        "is_primary": true
    },
    {
        "id": "illinois-state-scholars",
        "title": "ILLINOIS STATE SCHOLARS",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/ISAC-1-resized.webp",
        "full_story": "The Illinois Student Assistance Commission (ISAC), the state’s college access and financial aid agency, is pleased to announce the 2026-27* Illinois State Scholars.  State scholars are chosen each year based on their ACT or SAT test scores and sixth semester class rank and are honored for their remarkable academic achievements.\nThe Illinois State Scholars in our area include Flora High School students, Haedyn Davis, Sydney Dawkins, Caroline Duke, Meredith Edwards, Andrea Henson, Halle Kitley, Connor Miller, Kristen Pipher, Catherine Warren, and Haley Wicke.  From North Clay High School, Haven Cash, and Sylvia Robey from Clay City High School, Leland O’Dell, and from Cisne High School, Ava Greifzu, Hagen Howard, and Kadence Hyder.\nThese talented students rank in approximately the top ten percent of graduates from Illinois high schools. Nearly 19,200 students from 686 high schools have been designated for this honor.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#illinois-state-scholars",
        "link": "https://supportmylocalcommunity.com/local-news/#illinois-state-scholars",
        "tags": [
            "Clay City",
            "Flora"
        ],
        "date": "2026-01-21",
        "is_primary": true
    },
    {
        "id": "nws-webinar",
        "title": "NWS WEBINAR",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/NWS-26-resized.webp",
        "full_story": "Do you get scared or nervous when severe weather is in the forecast?  The National Weather Service Central Illinois office in Lincoln is hosting a Storm Anxiety Webinar tonight according to meteorologist Ed Shimon.\ncut 1:05 ‘…with weather.’\nThe webinar is tonight at 6 pm.  To register, visit weather.gov/ilx.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#nws-webinar",
        "link": "https://supportmylocalcommunity.com/local-news/#nws-webinar",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-21",
        "is_primary": true
    },
    {
        "id": "southeastern-illinois-community-foundation",
        "title": "SOUTHEASTERN ILLINOIS COMMUNITY FOUNDATION",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/scholarship-4-resized.webp",
        "full_story": "Southeastern Illinois Community Foundation is accepting applications for the Lou & Nancy Kincaid Family Full Armor Scholarship and North Clay Scholarship.  The scholarship application is available online at https://southeasternillinois.org/students.  The application deadline is 11:59 pm on Tuesday, March 17\nth\n.\nLou and Nancy Kincaid Family Scholarships offer support for graduates of Full Armor Christian Academy and North Clay High School pursuing higher education as either full-time or part-time students at a college or university.  Special consideration will be given to students pursuing a degree in education, but the scholarship is open to students in any field of study.\nApplicants must complete the Southeastern Illinois Community Foundation Common Scholarship application, a general application that determines the applicant’s eligibility for one or more of the Community Foundation’s scholarships.  Applicants will need a high school or college transcript, ACT or SAT scores (if applicable), and college financial aid information.\nTo apply, visit southeasternillinois.org/students to begin the Southeastern Illinois Community Foundation Common Scholarship Application.\nFor more information, contact Kristen Bertrand, Program Officer, at 217.342.5413 or\n.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#southeastern-illinois-community-foundation",
        "link": "https://supportmylocalcommunity.com/local-news/#southeastern-illinois-community-foundation",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-21",
        "is_primary": true
    },
    {
        "id": "earthquake-tuesday",
        "title": "EARTHQUAKE TUESDAY",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Earthquake-1.jpg",
        "full_story": "An earthquake shook parts of the Land of Lincoln early Tuesday morning.\nThe United States Geological Survey (USGS) said a magnitude 3.8 earthquake was recorded at 1:27 am Central time Tuesday, a little more than 5 miles below ground.\nThe USGS said the epicenter was near Ohlman, Illinois. Ohlman is located in Christian County, about 40 miles southeast of Springfield or about 12 miles southeast of Taylorville.\nPeople reported feeling shaking from the earthquake in St. Louis.  USGS states there was light to moderate shaking.  An earthquake of this magnitude can often be felt but very rarely would cause damage.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#earthquake-tuesday",
        "link": "https://supportmylocalcommunity.com/local-news/#earthquake-tuesday",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-21",
        "is_primary": true
    },
    {
        "id": "blood-shortage",
        "title": "BLOOD SHORTAGE",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Blood-Crisis-resized.webp",
        "full_story": "The American Red Cross is facing a severe blood shortage, reporting supply has dropped by 35%.\nThe Red Cross said requests from hospitals are exceeding the available supply of blood.\nPeople falling ill with the flu may be keeping donors away from donation centers, slowing the national effort to rebuild blood supply.  Winter weather also impedes donation efforts with people choosing to stay off the roads and indoors.\nThe Red Cross is asking health individuals to book an appointment to give blood or platelets by using the Blood Donor App, visiting RedCrossBlood.org or calling 1-800-RED CROSS.\nThe next blood drive in Flora will be on February 12\nth\nat the Flora Church of the Nazarene; appointments are currently available but there are only 4 power red donation appointments available.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#blood-shortage",
        "link": "https://supportmylocalcommunity.com/local-news/#blood-shortage",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-21",
        "is_primary": true
    },
    {
        "id": "van-stolen",
        "title": "VAN STOLEN",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Stolen-Vehicle-resized.webp",
        "full_story": "Fairfield police are investigating the theft of a 12 passenger van from Frontier Community College.  The theft was reported last weekend.\nAuthorities are looking into the possibility that the theft may have been related to the arrest of Mannie Willis of Gary, Ind. following a chase near Geff.  Around the same time as Willis’ arrest, authorities received reports of ignition switches being damaged on vehicles belonging to David Watson of Wayne County Well Servicing and a vehicle owned by Carson White of Fairfield.\nAnyone with information about the theft and ignition switch damage incidents is asked to contact the Wayne County Crimestoppers Hotline at 618-842-9777.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#van-stolen",
        "link": "https://supportmylocalcommunity.com/local-news/#van-stolen",
        "tags": [
            "Police/PD"
        ],
        "date": "2026-01-21",
        "is_primary": true
    },
    {
        "id": "tax-season",
        "title": "TAX SEASON",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Tax-Season-26-resized.webp",
        "full_story": "The Illinois Department of Revenue (IDOR) announced that it will begin accepting 2026 individual income tax returns on Monday, the same day the Internal Revenue Service (IRS) opens the federal filing season.  The deadline to file Illinois returns is Wednesday, April 15\nth\n.\nIDOR encourages taxpayers to file their returns electronically and choose direct deposit to receive refunds as quickly and securely as possible.\nIDOR Director David Harris said, “We want the tax filing process to be as smooth and stress-free as possible.  Before filing, you should make sure you have all income documents, such as W-2s and 1099s.  Filing online, reviewing information carefully, and submitting your returns early can help avoid delays and get you any refunds you may be entitled to sooner.”\nDuring the 2025 filing season, IDOR received over 6.3 million individual income tax returns.  About 5.75 million, or 91.3 percent, were filed electronically.  Taxpayers who file accurate returns electronically and select direct deposit can typically receive their refunds in about four weeks.\nMyTax Illinois is IDOR’s free online filing option that allows taxpayers to file with or without an account.  The system guides users through a simple question-and-answer process, performs calculations automatically, and reduces errors by using prepopulated information when available.  In addition to filing, MyTax Illinois allows users to, Make payments, Respond to department inquiries, Check the status of refunds via Where’s My Refund?, and Look up IL-PINs, estimated tax payments, and Form 1099-G information.\nTaxpayers may also file using tax software, a tax professional, or paper Form IL-1040.\nIDOR reminds taxpayers to review their eligibility for tax credits that can reduce the amount of tax owed or increase a refund.  Commonly claimed credits include the Illinois Earned Income Tax Credit, the Property Tax Credit, and the K–12 Education Expense Credit, among others.\n“Tax credits can put more money back in your pocket,” Harris said.  “Taking time to review the credits you qualify for can make a real difference.”\nThe United States Postal Service (USPS) announced changes to postmarks that could impact tax filings in 2026.  The USPS postmark now shows the date of the first automated processing operation instead of when a piece of mail was dropped off.  This modification could impact time-sensitive documents such as tax returns and payments.\nUSPS will continue to add manual postmarks upon request at their offices.  IDOR encourages taxpayers who mail their returns and tax payments to mail those items earlier than they typically would to ensure timely delivery.\n“If you plan to mail your return or payment, don’t wait until the last day,” Harris stressed.  “Sending it early or requesting a manual postmark at the post office can help protect you from late penalties.”\nIDOR provides assistance by phone for tax-related questions, with automated options for checking refund status, identifying IL-PINs, or accessing estimated payments.\nTaxpayers may call 1-800-732-8866 or 217-782-3336. Free language assistance is available for Limited English Proficiency (LEP) individuals.\nFor the most up-to-date information, forms, schedules, and instructions for the 2026 tax season, visit tax.illinois.gov.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#tax-season",
        "link": "https://supportmylocalcommunity.com/local-news/#tax-season",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-21",
        "is_primary": true
    },
    {
        "id": "illinois-calls-for-year-round-e15",
        "title": "ILLINOIS CALLS FOR YEAR-ROUND E15",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/E15-resized.webp",
        "full_story": "The State of Illinois is again calling on the United States Congress and the Trump administration to require year-round sales of E15 fuel.  Earlier this year, Governor JB Pritzker sent a letter to Congressional leadership on November 4, 2025, urging nationwide, year-round E15.\n“Agriculture is the number one industry in Illinois.  Our farmers feed the world, and they have the potential to fuel it as well.  As Trump’s tariffs hurt farmers nationwide and rising costs put strain on American families, Congress must require permanent, year-round E15, said Governor JB Pritzker.  “E15 enhances our nation’s energy supply, helps the economy, and supports a cleaner environment all at once.  Year-round E15 is not optional — it’s essential.  That’s why I was the first Governor in the corn belt to sound the alarm for Congress in November.  I once again urge the federal government to act in favor of our farmers and the environment.”\nUnder current law, E15 access during the summer driving season has relied on temporary emergency waivers.  These stopgap measures provide only brief relief and fall short of a stable, long-term solution.\nIllinois is the second largest producer of corn in the nation.  With corn production at record highs – the USDA crop estimate puts corn crop estimates above 17 billion bushels for the first time, up from 14.9 billion bushels in 2024 – the surplus inventory drives prices down, hurting farmers already struggling to break even amid rising input costs.  Corn prices hit the lowest price since August after the USDA made its announcement.\nA year-round requirement for E15 would increase demand for corn by 2 billion bushels a year, according to a new report from the Renewable Fuels Association.\nWhile ethanol use supports jobs, lowers fuel costs and reduces emissions, federal regulations continue to block E15 sales during critical summer months, creating unnecessary uncertainty for farmers.\n“Illinois is a national leader in corn and ethanol production. Year-round E15 would keep energy dollars in the Midwest, reduce reliance on foreign oil, and cut harmful emissions without additional cost to taxpayers,” said Jerry Costello II, Director of the Illinois Department of Agriculture.\nAllowing nationwide, year-round use of American ethanol is a practical solution that strengthens the energy supply, reduces costs for consumers, and provides the long-term certainty that Illinois farmers deserve.\n“Illinois farmers cannot afford to do business.  The best solution is a stronger economy,” said US Senator Dick Durbin.  “First, the President must stop these trade wars that are damaging our top farm export markets.  Second, Congress must pass permanent E15, which will immediately help farm families, while cutting the cost of gasoline for everyone by up to 30 cents a gallon.  As a member of the Senate Agriculture Committee, I will fight to get E15 finished now.”\n“Illinois farmers are the backbone of our economy and the stewards of America’s food and fuel supply.  Year-round E15 isn’t just an agricultural issue; it’s an economic, environmental, and national security imperative.  By adopting a permanent, nationwide E15 standard, we can lower costs for families, strengthen rural communities, and reduce our dependence on foreign oil.  Congress must deliver the certainty our farmers and consumers deserve,” said Rep. Jonathan Jackson.\n“I have been fighting in Congress for several years to secure year-round, nationwide access to E-15, including cosponsoring the Nationwide Consumer and Fuel Retailer Choice Act,” said Rep. Robin Kelly.  “While temporary waivers for midwestern states have helped maintain the ethanol industry, it is past time to allow the sale of year-round E-15 across the country.  At a time when affordability is top of mind for Illinoisans, homegrown biofuels will lower fuel prices, reduce emissions, and provide support for our farmers as they navigate President Trump’s challenging tariffs.”\n“Illinois farmers are producing more than ever, but Washington’s stop-and-go approach to E15 keeps holding them back,” said Congressman Raja Krishnamoorthi.  “Making E15 available year-round would strengthen our energy supply, lower costs at the pump, and provide the certainty corn growers need to stay competitive.  It’s a practical, pro-farmer solution—and it’s time for federal action.”\n“I have long been a strong advocate for year-round E15, having seen firsthand the benefits it delivers to consumers at the pump and to the farmers in my district,” said Congresswoman Nikki Budzinski.  “As co-chair of the Biofuels Caucus in Congress, I will continue leading the charge for federal legislation that provides a permanent solution and long-term certainty for our growers.”\n“Year-round E15 is a win for Illinois farmers and for families feeling the pinch at the pump.  It creates steady demand for our corn, supports rural jobs, and gives drivers a cleaner, more affordable fuel choice,” said Congressman Eric Sorensen.  “Congress and the administration need to act so producers and consumers can count on certainty, not short-term fixes.”",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#illinois-calls-for-year-round-e15",
        "link": "https://supportmylocalcommunity.com/local-news/#illinois-calls-for-year-round-e15",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-21",
        "is_primary": true
    },
    {
        "id": "the-revue",
        "title": "The ReVue",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Dr.-Brittani-resized.webp",
        "full_story": "Today on the ReVue I talk with Amy Allen and Dr. Brittani Hosselton about Brittany’s move to the Louisville Clinic. &#160; CCH Louisville Clinic.wav",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#the-revue",
        "link": "https://supportmylocalcommunity.com/local-news/#the-revue",
        "tags": [
            "Louisville"
        ],
        "date": "2026-01-21",
        "is_primary": true
    },
    {
        "id": "village-of-clay-city-boil-order",
        "title": "VILLAGE OF CLAY CITY BOIL ORDER",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/10/Boil-Order-resized.webp",
        "full_story": "Water customers in Clay City on South 1\nst\nSE starting at the ball park and heading east, on South Clark Ave and South 4\nth\nSE, Blackberry Drive, Morning Glory Road, Big Four Road, Blue Bell Road, Saddle Club Road, Vincennes Road SE and SW, South Main south of highway 50, Tower Road, Teaberry Lane, Angling Road, Mead Street SW, and Park Avenue SE and SW.\nfor any questions, please call the village office at 618-676-1441.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#village-of-clay-city-boil-order",
        "link": "https://supportmylocalcommunity.com/local-news/#village-of-clay-city-boil-order",
        "tags": [
            "Clay City"
        ],
        "date": "2026-01-21",
        "is_primary": true
    },
    {
        "id": "flora-city-council-meeting",
        "title": "FLORA CITY COUNCIL MEETING",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Flora-1-resized.webp",
        "full_story": "Timothy Russell\nFollowing a call to order at and observance of the pledge of allegiance and an invocation lead by commissioner Jeremy Henderson Mayor Spicer and city council members heard public comments from Stephen Smith of the Flora Tourism board.  Smith requested the board approval to set May 16\nth\nas the day for the city’s spring festival.  Smith shared that the tourism board hopes to structure the spring festival like that of Ford Town Days, which has seen increasing success in the past few years.\nBefore requesting approval of the regular and the consent agenda which including the approval of the warrant list for December 31\nst\n, 2025, thru Jan 14\nth\n, accepting the police department and building and zoning reports for December, along with the treasurer’s report for December.  The Board approved the city-wide rummage sales to be held May 15\nth\nand 16\nth\n.  Approval of a city-wide spring cleanup week was also set for May 18\nth\nthrough 21\nst\n.  Also, final, approval of the Blue Tick Breeders and Coon Hunters’ Association hunt at Charley Brown Park April 18\nth\nthrough 21\nst\n.\nMoving To regular Business Mayor Spicer congratulated the Lady Pups on their hard work making it to the state tournament and shared that while it was not on the agenda the city had received OSLAD grants for further improvements to Rotary Park, Spicer also requested the appointment for both Ariel Dulaney and Debbie Lamb to the tourism board, with terms to expire January of 2028.\nCommissioner Jeremy Henderson requested the board’s approval to advertise for the hiring of swimming pool staff for the summer.  Commissioner Phil Wiley shared that we still have winter weather headed or way, and suggested residents take precautions to keep their homes warm.  Wiley then requested the board’s approval for a sales agreement with Constellation for the purchase of gas.\nFinally, Flora Police Chief Jeremy Ruger requested the board’s approval on an ordinance regulating the use of electric and gas bikes.  The ordnance will require electric/gas bikes and scooters to have rear view mirrors and prohibit their use on several city roads.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#flora-city-council-meeting",
        "link": "https://supportmylocalcommunity.com/local-news/#flora-city-council-meeting",
        "tags": [
            "Flora",
            "Police/PD"
        ],
        "date": "2026-01-20",
        "is_primary": true
    },
    {
        "id": "kinmundy-man-sentenced",
        "title": "KINMUNDY MAN SENTENCED",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/12/Trial-4-resized.webp",
        "full_story": "A 33-year-old Kinmundy man was sentenced to 13 years in prison after pleading guilty to indecent solicitation of a child, aggravated criminal sexual abuse and grooming.  Daniel Belfiore originally faced eight counts of sexual misconduct involving the same teenage girl who was described by police at the time of his arrest as a family friend.\nBelfiore was sentenced to five years in prison on both the indecent solicitation of a child and aggravated criminal sexual abuse charges and three years on a grooming charge.  Judge Mark Stedelin ordered all the sentences to be served consecutively.\nBelfiore gave a statement of allocution, and the victim and her father both provided victim impact statements.\nAt an earlier plea hearing, five other counts of aggravated criminal sexual abuse were dropped.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#kinmundy-man-sentenced",
        "link": "https://supportmylocalcommunity.com/local-news/#kinmundy-man-sentenced",
        "tags": [
            "Police/PD"
        ],
        "date": "2026-01-20",
        "is_primary": true
    },
    {
        "id": "illinois-sheriffs-association-scholarships",
        "title": "ILLINOIS SHERIFFS’ ASSOCIATION SCHOLARSHIPS",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/ILSA-1-resized.webp",
        "full_story": "The Illinois Sheriffs’ Association announced that it will be awarding over $58,000 in college scholarships throughout the State of Illinois to students wishing to pursue higher education during the 2026-2027 academic year.  The scholarships are to be applied to tuition, books, and fees only.  The student must be enrolled full-time at a certified institution of higher learning within the State of Illinois. Online learning is acceptable.\nClay County Sheriff Andy Myers will be awarding a scholarship in the amount of $500.00.\nThere will be no restriction on any applicant by reason of race, age, creed, color, sex or national origin. The only limitations are as follows, Applicants must be permanent Illinois residents, and Students must be enrolled as a full-time student during the 2026-2027 school year (excluding summer session).\nApplications are now available at your local Sheriff’s office or on the ISA Website https://www.ilsheriff.org/youth-2/.  Students must complete the application, answer the essay question, and return all documentation to the Sheriff’s office in their permanent county of residence by March 13\nth\n(must be postmarked by this date).\nFor more information, please contact your local Sheriff’s office, Illinois Sheriffs’ Association, high school advising center, or college financial aid office.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#illinois-sheriffs-association-scholarships",
        "link": "https://supportmylocalcommunity.com/local-news/#illinois-sheriffs-association-scholarships",
        "tags": [
            "Police/PD"
        ],
        "date": "2026-01-20",
        "is_primary": true
    },
    {
        "id": "flora-police-activity-report",
        "title": "FLORA POLICE ACTIVITY REPORT",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/10/Flora-Police-1-resized.webp",
        "full_story": "Flora Chief of Police Jeremy Ruger released his Activity Report for December during Monday’s Flora City Council meeting.\nDuring the month, Flora police officers investigated 7 traffic accidents.\nThey made 13 criminal arrests, 1 drug arrest was made, and 1 DUI arrest was made.  There was no local ordinance arrest, 6 traffic arrests and 1 warrant arrest.\nOfficers issued 37 warning tickets, responded to 19 alarms and had 1,054 calls for service and had 4 juvenile contacts.\nAlso, Flora police officers drove 3,213 miles and conducted 64 investigations during November.  They answered 325, 911 calls and conducted 7 UTV Inspections and no Golf Cart Inspections during November.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#flora-police-activity-report",
        "link": "https://supportmylocalcommunity.com/local-news/#flora-police-activity-report",
        "tags": [
            "Flora",
            "Police/PD"
        ],
        "date": "2026-01-20",
        "is_primary": true
    },
    {
        "id": "fall-occ-academic-honors",
        "title": "FALL OCC ACADEMIC HONORS",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Academic-Ex-resized.webp",
        "full_story": "Outstanding students at Olney Central College have received academic honors for the Fall 2025 Semester.\nStudents named to the Chancellor’s List attained a grade point average of 3.90 or higher, on a 4.0 scale.  Local students making the Chancellor’s List include, Flora residents Nathan Boyer, Cole Matthew, Brody Pruitt and Lily Speer, Louisville resident Brayden Hale and Hazel Ord, Clay City resident Connor Taylor, Dieterich resident Brittney Niemerg, Kinmundy resident Taegan Webster and Noble residents Brandy Cochran, John Higgason and Gavin Williams.\nThose on the President’s List achieved a grade point average between 3.75 and 3.89.  Making the Presidents List are Jacob Kimbro of Flora, Grant Kauble of Clay City, Hannah Fickas and Kaylin Loker of Cisne, Kyra Swift of Alma, Lucas Kepley of Ingraham, Ilyanna Ray, Raeleigh Rusk, Sarah Seals and Jersey Well of Noble and Cody Mix of Xenia.\nThose students named to the Dean’s List earned a grade point average between 3.50 and 3.74.  On the Fall Dean’s List are Flora residents Shay Allen, Sam Blanchette, Oliver Collins, Jack Hargis, Jeremy Holcomb, Gabriel Krutsinger, Justin McCormick, Jase Moore and Peyton Rose, Cisne resident Hadley Walker and Noble resident Jasper Tracy.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#fall-occ-academic-honors",
        "link": "https://supportmylocalcommunity.com/local-news/#fall-occ-academic-honors",
        "tags": [
            "Flora",
            "Clay City",
            "Xenia",
            "Louisville"
        ],
        "date": "2026-01-20",
        "is_primary": true
    },
    {
        "id": "flora-building-and-zoning-report",
        "title": "FLORA BUILDING AND ZONING REPORT",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Build-1-resized.webp",
        "full_story": "Building and Zoning Official Chad Bayles submitted his monthly report for December during Monday’s Flora City Council meeting.\nBayles’ Report shows 1 residential construction project was undertaken in December, valued at $80,000.\nThere was also 1 new commercial valued at $14,000 and 1 Industrial project valued at $600,000.\nThat equates to overall, there were three total new projects in Flora valued at $694,000, with $750 collected in permit fees and $350 deposit fees for November.\nFor the year 2025 Residential figures, there’s 70 total projects valued at $1,350,941.  For year 2025 Commercial projects there’s 10 valued at $1,023,000 and one new Industrial project valued at $600,000.\nOverall, for 2025, there are 80 total projects valued at $2,973,941 with $5,404.49 collected in permit fees and $2,250 in deposit fees collected for the year.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#flora-building-and-zoning-report",
        "link": "https://supportmylocalcommunity.com/local-news/#flora-building-and-zoning-report",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-20",
        "is_primary": true
    },
    {
        "id": "bobcat-dinner",
        "title": "BOBCAT DINNER",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/12/FCC-FP26-resized.webp",
        "full_story": "Frontier Community College will have its annual Bobcats Baseball First Pitch Dinner, this weekend.  The event will take place on Friday, at 6 pm at the Fairfield First Christian Church and is sponsored by FNB.\nThis special evening will celebrate the Bobcats Baseball program and offer community members an opportunity to meet the team in a fun and engaging setting.  Tickets are $30 per person, and tables of eight are available for $200.  The meal will be catered by Big Boy Catering.\nAttendees will enjoy a unique twist, Bobcats Baseball players will serve as the evening’s waiters and event staff, providing a memorable and interactive experience for all supporters.  Guests can purchase tickets in advance by scanning the QR code available on promotional materials, allowing for quick and convenient individual or table reservations.\nFor more information or questions, please contact Bobcats Baseball Head Coach Matt McCue at\nor by calling 618-847-9271, ext. 4242.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#bobcat-dinner",
        "link": "https://supportmylocalcommunity.com/local-news/#bobcat-dinner",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-20",
        "is_primary": true
    },
    {
        "id": "text-scams",
        "title": "TEXT SCAMS",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/12/Text-Scam-1-resized.webp",
        "full_story": "Illinois Secretary of State Alexi Giannoulias is warning Illinoisans to lookout for text message scams claiming to be from the “Illinois State Department of Motor Vehicles.”  The messages threaten to suspend vehicle registration and driving privileges, while falsely claiming that enforcement actions began January 17\nth\n.  The Illinois Secretary of State’s office never sends text messages requesting personal or financial information.\nThese text messages are phishing, or “smishing,” attempts designed to trick residents into giving up personal or financial information.  Recipients should not respond to these messages or open any links found in unsolicited texts and emails.\nThe Illinois Secretary of State’s office does not send text messages demanding payment for traffic fines or requesting driver’s license or vehicle registration information.  The only text messages sent by the office are appointment reminders for scheduled DMV appointments.\n“Scammers are constantly trying to find new ways to cheat Illinoisans out of their personal information and hard-earned money,” Giannoulias said.  “These deceptive scams are unfortunately an increasingly prevalent threat in our modern society, and they’re coming from many sources, including phone calls, text messages and email communications.  I encourage everyone to remain vigilant, avoid engaging with these messages and report scams to help protect themselves and others.”\nIllinoisans are encouraged to report scam attempts to the Federal Trade Commission by visiting reportfraud.ftc.gov.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#text-scams",
        "link": "https://supportmylocalcommunity.com/local-news/#text-scams",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-20",
        "is_primary": true
    },
    {
        "id": "friends-of-the-library-spring-book-sale",
        "title": "FRIENDS OF THE LIBRARY SPRING BOOK SALE",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/FOL-Book-Sale-2-resized.webp",
        "full_story": "The Friends of the Flora Public Library Spring Book Sale will be held on Saturday, April 11\nth\nat the Flora Public Library.  The sale will be from 8:00 am to 3:00 pm, in the library community room.  Books, DVD’s and CD’s will be .25 each and magazines will be priced at .10 each or 12 for $1.\nAnyone wishing to contribute books, magazines, DVDs, or CDs to the book sale can bring them to the east door of the Flora Public Library during regular library hours.  The Flora Public Library is open Monday – Thursday 1:00 – 8:00 pm, Friday 10:00 am – 6:00 pm and Saturday 10:00 am – 3:00 pm.\nFor more information, call the library at 618-662-6553.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#friends-of-the-library-spring-book-sale",
        "link": "https://supportmylocalcommunity.com/local-news/#friends-of-the-library-spring-book-sale",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-20",
        "is_primary": true
    },
    {
        "id": "bailey-bus-tour",
        "title": "BAILEY BUS TOUR",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Bailey-Del-Mar-resized.webp",
        "full_story": "1/19/26\nIllinois gubernatorial candidate and former State Senator Darren Bailey along with his running mate Aaron Del Mar are launching a statewide tour to “Take Back Illinois” tomorrow, a tour that will take them from the Chicagoland all the way to deep Southern Illinois.\n“Primary voters and the press are welcome to come out to these stops and get to know us,” Del Mar said.  “Darren and I want to hear from Republican voters and learn what issues are of the most concern to them.  We are committed to turning Illinois around and making state government work.”\nThe “Take Back Illinois” tour begins on Tuesday in Palatine and will conclude on Friday in Champaign.  The tour will be closest to us on Thursday when they stop at the Culver’s, in Mt Vernon, from 4:00 PM – 5:30 PM.  Then on Friday the bus will stop at the Smokerise Steakhouse, in Olney, from 12:00 PM – 1:30 PM.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#bailey-bus-tour",
        "link": "https://supportmylocalcommunity.com/local-news/#bailey-bus-tour",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-19",
        "is_primary": true
    },
    {
        "id": "clay-county-spelling-bee",
        "title": "CLAY COUNTY SPELLING BEE",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Spelling-Bee-resized.webp",
        "full_story": "1/19/26\nThe Clay County Spelling Bee will be held Friday afternoon at the Flora High School.\nStudents from Flora, North Clay and Clay City will participate at 1 pm in the auditorium.  The top 4 finishers will advance to the regional Spelling Bee on February 18\nth\nat Olney Central College.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#clay-county-spelling-bee",
        "link": "https://supportmylocalcommunity.com/local-news/#clay-county-spelling-bee",
        "tags": [
            "Flora",
            "Clay City"
        ],
        "date": "2026-01-19",
        "is_primary": true
    },
    {
        "id": "library-sponsors-annual-pet-food-drive",
        "title": "LIBRARY SPONSORS ANNUAL PET FOOD DRIVE",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Feed-the-Furry-1-resized.webp",
        "full_story": "1/19/26\nThe Flora Public Library, in cooperation with Fur a Good Paws, is sponsoring a pet food drive, Feed the Furry.  The library’s annual pet food drive will end Friday, February 20\nth\nat 6 pm.  Items can be dropped off at the library during regular operating hours.\nCurrently, the most needed item is clumping cat litter.\nOther needed items are kitten chow, bleach, vinegar and 30-gallon trash bags, food for dogs and cats, laundry detergent, nitrile gloves, paper towels, Clorox Wipes, and dish soap.  Monetary donations may also be left at the library.  Please make checks payable to, Fur a Good Paws.\nFur a Good Paws is an all-volunteer 501(c)(3) nonprofit in Clay County that provides a licensed no-kill rescue that cares for homeless pets.  The group promotes spaying and neutering and pet adoptions to reduce the number of homeless pets in the community.  For more information, visit furagoodpaws.org or look them up on Facebook.\nHours at the library are Monday – Thursday 1:00 to 8:00 pm, Friday 10:00 am to 6:00 pm and Saturday 10:00 am to 3:00 pm.  For more information, please call the library at 618-662-6553.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#library-sponsors-annual-pet-food-drive",
        "link": "https://supportmylocalcommunity.com/local-news/#library-sponsors-annual-pet-food-drive",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-19",
        "is_primary": true
    },
    {
        "id": "nursing-information-sessions",
        "title": "NURSING INFORMATION SESSIONS",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/12/IECC-Nursing-1-resized.webp",
        "full_story": "1/19/26\nFrontier Community College will host Zoom meetings for nursing information sessions, coming up.  Applicants must attend one of these sessions prior to submitting their nursing program application.\nDates for Zoom Meetings will be Wednesday at 6 pm and a Nursing only Zoom session on Thursday, February 26\nth\n2 pm.\nTo register for a session and begin the application process, contact Julie Bullard at 618-847-9201, ext. 4520.\nFor a full schedule of upcoming virtual sessions across the Illinois Eastern Community Colleges district, visit iecc.edu/nursinginfosessions.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#nursing-information-sessions",
        "link": "https://supportmylocalcommunity.com/local-news/#nursing-information-sessions",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-19",
        "is_primary": true
    },
    {
        "id": "pesticide-license-renewal",
        "title": "PESTICIDE LICENSE RENEWAL",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/12/Pest-1-resized.webp",
        "full_story": "1/19/26\nWhether renewing an Illinois pesticide license or applying for one, registration is now open for local in-person testing sessions to be held in Olney, Fairfield, and Effingham.\nWhile the testing is provided by the Illinois Department of Agriculture in collaboration with Illinois Extension, it is for  pesticide applicators and operators who need a commercial, private, or special license, the in-person testing is free and will be available in Richland, Wayne, and Effingham Counties through March.  Registration is required and early sign up is encouraged due to class size limitations.  With all in-person testing from 10:00 to 1:00 each day.  The next testing date is in Olney on Friday with a second class available on March. 13\nth\n.\nThe first testing date at the Farm Bureau Office in Effingham is on February 4\nth\nwith another on March 4\nth\nwith a morning and evening session for the March class. And the next testing date at the Extension Office in Fairfield is on February 6\nth\nwith a second class on March 19\nth\n.\nTo register, visit the IDOA website at www.agr.illinois.gov/pesticides/in-person-testing or contact your Extension Office in Olney, Fairfield, or Effingham.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#pesticide-license-renewal",
        "link": "https://supportmylocalcommunity.com/local-news/#pesticide-license-renewal",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-19",
        "is_primary": true
    },
    {
        "id": "postal-changes-for-mail-in-voting",
        "title": "POSTAL CHANGES FOR MAIL IN VOTING",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Mail-in-Ballot-1-A.jpg-resized.webp",
        "full_story": "1/19/26\nNew postal service changes to postmarking and transportation rules could disrupt mail-in voting in the 2026 election, Illinois county clerks warn.\nAhead of the March primary election, county clerks are telling voters not to rely on past processes and to mail their ballots as early as possible, no later than one week before Election Day.\nClerks from around the state discussed how to educate voters at the annual Illinois Association of County Clerks and Recorders Conference on Thursday in East Peoria.\nOne new rule, which took effect December 24\nth\n, states that the date a postmark is applied to a piece of mail may not reflect the day it was received by the Postal Service.\nCurrently, 14 states, including Illinois, will accept mail-in ballots if they are received within a certain period after Election Day if they are postmarked on or before Election Day.\nClerks warned that uncertainty about when ballots will now be postmarked necessitates voters to act earlier.  The way postmarks are applied is not changing, the USPS says.  Mail is only postmarked at distribution centers, and that will remain the same.\nBut in an effort to improve mail delivery efficiency, some localities’ mail may be sent to a different distribution center than in the past, which can increase the amount of time it takes for the USPS to receive and then postmark mail at these centers.\n“It’s a question mark of when will it actually get through a distribution center.  So I’m advising my voters to make sure that they get their vote-by-mail ballot in the mail no less than a week before Election Day,” John Ackerman, the Tazewell County clerk, said.\nVoters can also request a manual postmark from their local post office or drop off their ballot at the election official’s office.\nBut if election officials can’t rely on postmarks to reflect accurate dates, a number of mail-in ballots that were mailed prior to Election Day may not be counted at all clerks said.\nBallots also will no longer be automatically considered priority mail, increasing the amount of time it will take to deliver the mail.\nThese changes will be most felt during the recount process, when candidates are “scrambling,” Ackerman said.\nThe clerks generally agreed this could change the outcome of a race.\nClerks also said they are concerned about changes impacting voter trust in elections, especially because voter guidance is now going to be different depending on the county’s location and distribution center.\nIn the past, when this potential change was proposed, the clerks said they were able to speak to federal lawmakers to advocate for its reversal.\nIn late September 2025, a delegation of clerks traveled to Washington, DC, to meet with lawmakers and staff about changes to federal funding for election infrastructure and learned lawmakers didn’t know about the potential changes, Ackerman said.\n“They were all unaware that this change was going to take effect.  They were unaware, in my opinion, of the impacts it would have on vote by mail,” he said.\nThis time, however, clerks didn’t know the changes were proposed until days before they were implemented.\nTo be sure your vote has been counted, voters can call their county clerk’s office, or some counties offer ballot tracking online.\nCounty clerks emphasized that voting by mail is still safe and secure, but it might take more work and planning.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#postal-changes-for-mail-in-voting",
        "link": "https://supportmylocalcommunity.com/local-news/#postal-changes-for-mail-in-voting",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-19",
        "is_primary": true
    },
    {
        "id": "coaches-corner-9-17-26",
        "title": "COACHES CORNER 9-17-26",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/11/Conley-Gym-resized.webp",
        "full_story": "Click on the link below to hear the latest edition of Coaches Corner with Flora Wolves Head Basketball Coach Jason Hanson.  If you can’t join us Saturday mornings at 7:30, you’ll be able to listen here after the program airs at wnoi.com…",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#coaches-corner-9-17-26",
        "link": "https://supportmylocalcommunity.com/local-news/#coaches-corner-9-17-26",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-17",
        "is_primary": true
    },
    {
        "id": "mcconnell-secures-541m-for-kentucky-in-federal-fun",
        "title": "McConnell secures $541M for Kentucky in federal funding",
        "image": "https://bloximages.newyork1.vip.townnews.com/wsiltv.com/content/tncms/assets/v3/editorial/d/a0/da0f0a77-ec74-5b4c-8d77-3e4aa946ffc3/6955927791bd4.image.jpg?crop=1280%2C672%2C0%2C144&resize=1200%2C630&order=crop%2Cresize",
        "full_story": "McConnell secures $541M for Kentucky in federal funding\nDigital Content Manager\nJan 15, 2026\n6 hrs ago\nCopy article link\nWASHINGTON, D.C. (WEVV) -- U.S. Sen. Mitch McConnell of Kentucky announced the Senate's passage of a federal funding bill that secures more than $540 million for Kentucky priorities. The bill, which focuses on areas such as Commerce-Justice-Science, Interior-Environment, and Energy-Water, now awaits President Trump's signature.\nThe funding includes $70 million for the University of Louisville's Center for Bioscience and $35 million for the University of Kentucky's Healthy Kentucky Research Building No. 2. \"This federal funding is an important investment in research infrastructure at UofL and UK,\" McConnell said.\nThe bill allocates $2.5 million for a new cybercrime training facility in Madisonville and $352,000 for law enforcement equipment in Warren County. \"These federal investments will equip Kentucky's law enforcement with the tools and training they need to keep our communities safe,\" McConnell said.\nAdditionally, $340 million is set aside for environmental remediation at the Paducah Gaseous Diffusion Plant. \"These federal investments deliver long-overdue cleanup at the Paducah Gaseous Diffusion Plant while positioning the site for the future,\" McConnell said.\nThe funding also includes $21.281 million for the Rough River Dam Safety Modification Project and $600,000 for an erosion study at Columbus-Belmont State Park. Investments in water infrastructure, such as $9.256 million for a water treatment plant in Edmonson County, are also part of the package. \"These critical federal investments in water and wastewater infrastructure will protect public health and ensure Kentucky communities can continue to grow,\" McConnell said.\nThe bill supports recreational areas with $7.45 million for Land Between the Lakes National Recreation Area and $1 million for improvements at Green River National Wildlife Refuge. \"Investing in Land Between the Lakes and the Green River National Wildlife Refuge strengthens Kentucky's outdoor recreation and tourism opportunities,\" McConnell said.\nOther priorities include $10.5 million in funding for invasive carp management in the lower Mississippi River Basin, funding for economic development initiatives, and for law enforcement support. The bill also ensures continued funding for a new federal prison in Letcher County and allocates $200 million for the Appalachian Regional Commission.\nCopy article link\nDigital Content Manager\nFollow Mike Mohundro\nUpdated\nFeb 25, 2023\nUpdated\nFeb 29, 2024\nAug 12, 2024\nUpdated\nJan 13, 2024\nUpdated\nDec 6, 2021\nUpdated\nJul 14, 2025\nRecommended for you",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#mcconnell-secures-541m-for-kentucky-in-federal-fun",
        "link": "https://supportmylocalcommunity.com/local-news/#mcconnell-secures-541m-for-kentucky-in-federal-fun",
        "tags": [
            "Louisville"
        ],
        "date": "2026-01-16",
        "is_primary": false
    },
    {
        "id": "scores",
        "title": "SCORES",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/10/defaultimage.jpg",
        "full_story": "1/16/26\nJR High Boys Basketball\n6th Grade: St. Elmo 20, North Clay 18\n5th: North Clay 24, St. Elmo 16\n8th Grade: Woodlawn 56, Cisne 34\n7th Grade: Cisne 45, Woodlawn 42\nJR High Girls Basketball\nFlora Regional\nFlora 35, Olney 32\nMt. Carmel 40, Carmi 19",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#scores",
        "link": "https://supportmylocalcommunity.com/local-news/#scores",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-16",
        "is_primary": true
    },
    {
        "id": "clay-city-school-board-meets",
        "title": "CLAY CITY SCHOOL BOARD MEETS",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/11/Clay-City-Schools-resized.webp",
        "full_story": "(1/16/26) pg\nThe Clay City School Board met Thursday night in the district library and made quick work of a light agenda, but it did include a brief discussion about the topic of alternative school.\nBoard President Misty Lindeman called the meeting to order, and the roll was called with all members present.  The board approved the agenda and past meeting minutes.\nSuperintendent John Neubaum presented the Financial Report and noted that finances were pretty stable, except for an HVAC issue at the end of the year that cost the district around $15,000 to fix.  He also mentioned that the ISBE budget is being reduced and that will translate to belt tightening at schools across the state.  A motion was made to approve the financial report, and it was approved unanimously.\nIn informational items, Supt. Neubaum said there are 211 students enrolled at Clay City Schools.  He moved on to briefly comment on the Illinois School Report Card.  He said the state had changed how districts are rated in some regard.  Some schools that had achieved commendable status are now listed as not commendable and the change of descriptions was causing angst around the state.  Neubaum said ISBE normally just plows ahead despite concerns.  But this time they are conducting a listening tour to better understand the districts issues with the new system of ratings.  Supt. Neubaum also discussed the continuing issues with FOIA (Freedom of Information Act) Requests.  He says the district received a request from a law firm that specializes in suing Illinois school districts that redact names from documents.  He said the district’s law firm suggested that they deal with that particular FOIA request.\nPrincipal Brian Wattles presented the student activity update.  He noted Pre-K students are preparing to hatch chickens in their hands on science experience.  Kindergarten students were preparing for the 100\nth\nday of School on January 27 and learning about the impact of Dr. Martin Luther King Jr.  First grade students focused on their goal of earning 240 good grades and are earning a trip to The Scoop on Main for ice cream and studying about the legacy of Martin Lutrher King Jr.  Third grade students are working on division in math and reading both picture books and chapter books. Fourth graders are taking a new approach on Accelerated Reader assignments and look two complete two AR tests each week.  Sixth grade students are learning about Mediterranean Countries while seventh grade students are studying the founding of the 13 Original Colonies.  And eight graders are examining the differences between the North and South during the Industrial Revolution.  They also learned about sending professional emails.  Jr. high literature classes focused on non-fiction books.  At the high school, students completed CPR training and numerous students were recognized for their dedication and hard work.  Student Molly Lindeman was also recognized for performing the National Anthem at last weeks’ Clay City vs. North Clay basketball game.  Basketball Players, Cheerleaders and band members were also recognized.\nIn New Business, the board approved strategic goals that were set for the new calendar year submitted by a committee of teachers, board members and district staff.  Supt. Neubaum lead the board through a discussion of the School Maintenance Grant Project through Veregy.  He stated that next year the grant will become a competitive process that could work in the district’s favor.  He said Clay City Schools are in the process of updating the HVAC system around the various buildings.  Since the program appears to favor projects completed in stages, Clay City will likely seek to install the HVAC systems in multiple years and the motion was approved.\nSupt Neubaum told the board about a proposal to create a school within a school alternative program.  He explained the district has a small handful of jr. high level students that have fallen behind due to a combination of behavioral and attendance issues.  By creating an alternative school at Clay City, it is hoped that the students can succeed at academic recovery to catch up to what they’ve missed and then move forward and return to regular classes.  This intervention will remove the students from the general student population, and they will have no socialization with other students, except on the way to school and back home.  The students must agree to attend this version of alternative school.  Board members questioned this approach and had other concerns as well.  With encouragement from the supt., members  but did vote unanimously to approve the measure through the end of the current school year.  Supt. Neubaum will update the board about the situation in a month, and the board could agree to continue the program or eliminate it based on what the progress report shows.\nThe final agenda item was a request to approve the retirement of Kindergarten Teacher Beth Yates, effective at the end of the 2028/29 school year.  The board approved the request unanimously.\nClay City Senior Camden Bruner addressed the board on behalf of the Class of 2026.  He asked the board to approve the Senior Class Trip to Orange Beach, Alabama March 12-15 and discussed their fundraising efforts.  After answering a few questions, the board approved his request without dissent.\nAnd with all business complete, the meeting adjourned.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#clay-city-school-board-meets",
        "link": "https://supportmylocalcommunity.com/local-news/#clay-city-school-board-meets",
        "tags": [
            "Clay City"
        ],
        "date": "2026-01-16",
        "is_primary": true
    },
    {
        "id": "high-speed-chase",
        "title": "HIGH SPEED CHASE",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/High-Speed-1-resized.webp",
        "full_story": "1/16/26\nMannie M. Willis, 26 of Gary, Indiana is behind bars following a high-speed chase Thursday morning in the Geff area.\nWayne County Sheriff Chris Otey reports a deputy spotted a vehicle stopped on the side of the road on US 45 near Geff around 12:35 Thursday morning.  Immediately after the deputy pulled in behind the vehicle, the driver fled.  A lengthy pursuit ensued with speeds of around 100 mph.  The chase continued across rural Wayne County roads and on Route 45.  Sheriff Otey says Willis turned off his head lights multiple times in an attempt to elude police and even slammed on his brakes in an attempt to cause a crash.\nEventually, Willis fled on foot after crashing his car into a ditch.  He was eventually tased by an officer and was taken into custody without further incident.\nAn inventory of Willis’ vehicle revealed he was in possession of prescription pills and burglary tools.  Sheriff Otey also noted that the license plate matching the vehicle had been removed with a Kentucky plate duct taped to the vehicle.\nWillis has been detained in the Wayne County Jail.\nPreliminary charges include aggravated fleeing or eluding, obstruction of justice, reckless driving, resisting arrest and multiple traffic citations.\nSheriff Otey says the investigation is ongoing and additional charges are likely.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#high-speed-chase",
        "link": "https://supportmylocalcommunity.com/local-news/#high-speed-chase",
        "tags": [
            "Police/PD"
        ],
        "date": "2026-01-16",
        "is_primary": true
    },
    {
        "id": "spicer-statement-on-grant",
        "title": "SPICER STATEMENT ON GRANT",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Flora-Park-resized.webp",
        "full_story": "1/16/26\nFlora Mayor Linda Spicer released the following statement about the state approving the city’s OSLAD Grant.\nThe City of Flora is pleased to announce that it has been selected to receive $344,800 dollars through the Open Space Land Acquisition and Development Grant (OSLAD) used for developing public parks and outdoor recreational spaces in the State of Illinois.  This State grant program is the same program used by the City to construct the popular Pickleball Courts.  The City of Flora was one of a few applications selected in our area.\nThis project will focus on improving and enhancing the current Rotary Park.  The grant will ensure ADA compliance by making equipment and parking more accessible.  There will be new walking paths and replacement of some outdated equipment.  However, the familiar Rocket Slide will remain a sacred part of the existing park.\nThe total project will be $689,600 as the grant requires local match funding.  The timeline for start and completion is not defined at this time.  However, the City will move forward with their submitted plans when funds are secured.\nThe City Council appreciates the many community residents and Flora Rotary for their support at the public hearing held during the past year.  There were also many people who sent letters of support and students who contributed various forms of support.  Mayor Spicer said, “All of these contributions enabled us to secure this valuable grant to expand and improve recreational facilities in our community.\nRotary Park will continue to provide a welcoming space for all of our residents and visitors.”",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#spicer-statement-on-grant",
        "link": "https://supportmylocalcommunity.com/local-news/#spicer-statement-on-grant",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-16",
        "is_primary": true
    },
    {
        "id": "noble-village-board",
        "title": "NOBLE VILLAGE BOARD",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/11/Noble-1A-resized.webp",
        "full_story": "1/16/26\nThe Noble Village Board met in regular session this past Monday night.\nBoard members approved a payment of $58,813 to Enlow, Inc. for riprap lining at the Village’s Sewer Lagoon.  The payment is coming from the Village’s sewer lagoon grant.  They also approved a $1,777 estimate to build safety guards around the village fuel tanks as required by OSHA.  They also approved a $750 estimate for repairs to the bucket on the villages New Holland tractor.  The board accepted the resignation Cindy Manuel as Village Treasurer and then appointed her as the new Village Clerk.\nVillage hall will be closed on Monday in honor of Martin Luther King’s birthday.  The next regular meeting of the Noble Village Board will be on January 26\nth\n, at 7:00.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#noble-village-board",
        "link": "https://supportmylocalcommunity.com/local-news/#noble-village-board",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-16",
        "is_primary": true
    },
    {
        "id": "isp-stolen-vehicle-recovery",
        "title": "ISP STOLEN VEHICLE RECOVERY",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/ISP-2-resized.webp",
        "full_story": "1/16/26\nIllinois State Police say they’re stepping up efforts to fight vehicle theft and carjackings across the state, using grant funding from the Illinois Secretary of State’s vehicle theft prevention council.\nState police have received more than $10-million dollars to support these operations.\nFrom October through December of 2025, ISP says those missions helped recover 243 stolen or hijacked vehicles, led to 24 arrests, and resulted in the seizure of five firearms.\nOne of the latest cases happened December 22\nnd\n, when an Audi connected to an armed carjacking was found in Carbondale.  Police say the vehicle was abandoned in a field, and two people were taken into custody.\nISP says the operations are aimed at reducing vehicle-related crime and improving public safety statewide.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#isp-stolen-vehicle-recovery",
        "link": "https://supportmylocalcommunity.com/local-news/#isp-stolen-vehicle-recovery",
        "tags": [
            "Police/PD"
        ],
        "date": "2026-01-16",
        "is_primary": true
    },
    {
        "id": "white-squirrel-count",
        "title": "WHITE SQUIRREL COUNT",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/White-Squirrel-3-resized.webp",
        "full_story": "1/16/26\nThe results of the 47\nth\nannual Olney squirrel count are in, revealing a decline in the population of both white and grey squirrels.\nA total of 105 volunteers participated over three Saturdays in October to conduct the count.  They reported finding 60 white squirrels and 780 grey squirrels.  This represents a decrease of 21 white squirrels and 227 grey squirrels compared to 2024.\nCounters noted that more leaves on the trees and increased traffic noise on one Saturday made it difficult to spot the squirrels.\nDr. John Stencel expressed concerns about the future of the Olney white squirrels, suggesting they could be gone by 2034 if no conservation efforts are made.\nSuggestions to help preserve the population include providing water and food, as well as setting up houses to offer extra protection from the elements and predators.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#white-squirrel-count",
        "link": "https://supportmylocalcommunity.com/local-news/#white-squirrel-count",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-16",
        "is_primary": true
    },
    {
        "id": "carlyle-lake-rated",
        "title": "CARLYLE LAKE RATED",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Carlyle-Lake-1-resized.webp",
        "full_story": "1/16/26\nCarlyle has been named one of the 12 Best Boating Cities in the United States for the second year in a row.  The list is put together by BoatBooker.\nCarlyle Lake is recognized for its calm lake setting, relaxed atmosphere, and the welcoming boating community surrounding Illinois’ largest man-made lake.\nBoatBooker notes the wide-open waters are perfect for cruising, sailing, and family-friendly outings.  Visitors can enjoy pontoon rides, speedboat excursions, or fishing trips targeting bass, crappie, and catfish, all supported by experienced local captains and accessible marinas.  Kayaking and paddle boarding are also popular, giving travelers a peaceful way to explore scenic coves and shorelines.\nOff the water, BoatBooker finds Carlyle’s trails, picnic areas, campgrounds, and wildlife-viewing spots make it easy to turn a day on the lake into a full outdoor getaway.\nThe ratings are based on a combination of variety and quality of boating experiences, customer interest and booking trends, accessibility of rivers, lakes, and costal waterways, input from local captains and operators and broader destination appeal and tourism momentum.\nCarlyle Lake is the only lake in Illinois to make the list.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#carlyle-lake-rated",
        "link": "https://supportmylocalcommunity.com/local-news/#carlyle-lake-rated",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-16",
        "is_primary": true
    },
    {
        "id": "lincolns-birthday-at-vandalia-statehouse",
        "title": "LINCOLN’S BIRTHDAY AT VANDALIA STATEHOUSE",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Lincolns-birthday-resized.webp",
        "full_story": "1/16/26\nThe Vandalia Statehouse State Historic Site will celebrate President Abraham Lincoln’s birthday and America’s 250th anniversary with a free public event from 2 to 4 pm on Saturday, February 7\nth\nin the House of Representatives chamber where Lincoln once served.\nThe program will feature Fritz Klein as Lincoln, along with remarks from Vandalia Mayor Doug Knebel and music by the Vandalia Community High School Band.\nKlein, a professional actor and speaker, is known for his historically accurate and compelling portrayal of Lincoln.  He bears a striking physical resemblance to the former president and has appeared in documentaries and films for National Geographic, Discovery Channel and the History Channel.\nBirthday cake and cookies will be served.  The celebration is presented by the Illinois Department of Natural Resources, the Vandalia Illinois Tourism Commission and the Old Capitol Foundation.\nThe Vandalia Statehouse State Historic Site is the oldest surviving capitol building in Illinois and served as the state capitol from 1836 to 1839.  The site, at 315 W. Gallatin Street, is open to the public from 9 am to 4 pm Wednesday through Sunday.  For more information, call 618-283-1161.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#lincolns-birthday-at-vandalia-statehouse",
        "link": "https://supportmylocalcommunity.com/local-news/#lincolns-birthday-at-vandalia-statehouse",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-16",
        "is_primary": true
    },
    {
        "id": "oslad-grant-awarded",
        "title": "OSLAD GRANT AWARDED",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Grants-Awarded-1-resized.webp",
        "full_story": "1/15/26\nWednesday, Governor JB Pritzker and the Illinois Department of Natural Resources (IDNR) announced $36 million in grant funding was awarded to 67 local park projects throughout Illinois to help communities acquire land and develop recreational opportunities.  The grants were awarded through the Open Space Land Acquisition and Development, or OSLAD, program.\nThe City of Flora was awarded $344,800 for an accessible park redesign project.\nFor the fourth year in a row, the governor ensured funding was set aside for economically distressed communities, resulting in 20 underserved communities receiving $11.4 million in OSLAD grants this year.\nEstablished by the Illinois General Assembly in 1986, OSLAD is a cost-sharing program between state and local governments which helps communities fund land acquisition and development for parks and outdoor recreation projects.  It’s become one of the most popular grant programs in Illinois.  Since its establishment, OSLAD has awarded $675 million for park projects throughout Illinois.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#oslad-grant-awarded",
        "link": "https://supportmylocalcommunity.com/local-news/#oslad-grant-awarded",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-15",
        "is_primary": true
    },
    {
        "id": "radiography-information-session",
        "title": "RADIOGRAPHY INFORMATION SESSION",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/12/XRay-3-resized.webp",
        "full_story": "1/15/26\nOlney Central College is hosting a virtual information session for students interested in applying for Fall 2026 admission to the Radiography Program.\nThe next virtual session will be offered at 6 pm on Wednesday, January 21\nst\n.\nTo make application to the radiography program, contact Julie Bullard at 618-847-9201, ext. 4520.\nLogin information can be accessed at www.iecc.edu/radtech under the Prospective Student Menu.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#radiography-information-session",
        "link": "https://supportmylocalcommunity.com/local-news/#radiography-information-session",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-15",
        "is_primary": true
    },
    {
        "id": "spring-fish-sale",
        "title": "SPRING FISH SALE",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Spring-Fish-Sale-resized.webp",
        "full_story": "1/15/26\nThe Wayne and Clay County Soil and Water Conservation District will be holding its annual Spring Fish Sale Thursday, March 12\nth\nat 8 am.\nThe deadline to order grass carp is on Thursday, February 26\nth\n.  The deadline to order all other fish is noon on Thursday, March 5\nth\n.\nAvailable fish include Channel Catfish, Largemouth Bass, Hybrid Sunfish, Bluegill, Redear, Black Crappie, Fathead Minnows and Grass Carp.\nTo place your order for fish please contact the Wayne County Soil and Water Conservation District at 618-842-7602 ext. 3.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#spring-fish-sale",
        "link": "https://supportmylocalcommunity.com/local-news/#spring-fish-sale",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-15",
        "is_primary": true
    },
    {
        "id": "plummer-card-drive",
        "title": "PLUMMER CARD DRIVE",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Plumer-26-resized.webp",
        "full_story": "1/15/26\nState Senator Jason Plummer is encouraging residents across the district to help spread love and kindness this Valentine’s Day by participating in his Valentine’s for Seniors Card Drive.\nThe annual initiative invites individuals, families, classrooms, churches, and community organizations to create Valentine’s Day cards that will be delivered to seniors living in nursing homes and assisted living facilities throughout the 55\nth\nSenate district.\nSenator Plummer said, “This drive is a simple way to let seniors know they are connected to their community  A card may seem small, but it can make a real difference and really brighten someone’s day.”\nValentine’s Day cards may be dropped off in person at Senator Plummer’s district office by February 6\nth\nthe Vandalia District Office is at 310 West Gallatin Street.  Drop-off hours are 8:30 am to 4:30 pm, Monday through Friday.  When delivering cards in person, residents are asked to place them in the marked mailbox located inside the Vandalia office.\n“This card drive is an opportunity for people of all ages to come together and share encouragement with those who may need it most,” Senator Plummer added.  “I hope families and groups throughout the district will join us in making this Valentine’s Day brighter for our seniors.”\nFor more information, residents may contact Senator Plummer’s district office by calling 618-283-3000.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#plummer-card-drive",
        "link": "https://supportmylocalcommunity.com/local-news/#plummer-card-drive",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-15",
        "is_primary": true
    },
    {
        "id": "peak-scholarship",
        "title": "PEAK SCHOLARSHIP",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Scholarship-2A-resized.webp",
        "full_story": "1/15/26\nFrontier Community College and Olney Central College are pleased to announce the Kenton Peak Scholarship, a $1,000 annual award supporting students pursuing para-medical fields, emergency medical response, and other healthcare-related programs.\nThe Kenton Peak Scholarship can be awarded to either an incoming freshman or a returning sophomore.  Funds may be used for tuition, textbooks, fees, and other program-related expenses, helping students prepare for vital roles as future first responders and healthcare providers.\nTo be eligible, applicants must, be enrolled in a para-medical, EM responder, or healthcare program at FCC or OCC, maintain a minimum 2.5 GPA, take an active role in emergency preparedness, and plan to serve as an EMT or healthcare provider after graduation.\nThe application deadline for the Kenton Peak Scholarship is February 27\nth\n.\nFor more information or to apply, visit https://iecc.edu/fcc/admissions-aid/scholarships or contact FCC or OCC Student Services.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#peak-scholarship",
        "link": "https://supportmylocalcommunity.com/local-news/#peak-scholarship",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-15",
        "is_primary": true
    },
    {
        "id": "bost-case-progresses",
        "title": "BOST CASE PROGRESSES",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Bost-1-resized.webp",
        "full_story": "1/15/26\nUS Representative Mike Bost applauded the US Supreme Court’s 7-2 decision Wednesday granting him standing in his lawsuit challenging an Illinois law that allows vote-by-mail ballots received up to 14 days after Election Day to be counted.  Vote-by-mail ballots without postmarks can also currently be tabulated up to 14 days later if they are dated on or before Election Day.\n“I’m thankful the US Supreme Court has ruled strongly in our favor and concluded we have standing to challenge Illinois’ unconstitutional law allowing vote-by-mail ballots to be counted two weeks after Election Day,” said Bost.  “This is a critically important step forward in the fight for election integrity and fair elections.  I look forward to continuing to pursue this case as we navigate the next stages of the legal process.  It’s vitally important that we restore the people’s trust in our elections.”\nBost is being represented by Judicial Watch, a conservative foundation that fights for accountability and integrity in law, politics and government.\n“This is the most important Supreme Court election law ruling in a generation,” said Judicial Watch President Tom Fitton.  “Too many courts have denied candidates the standing to challenge unlawful election rules such as the outrageous ballots that arrive after Election Day.  American citizens concerned about election integrity should celebrate this Supreme Court victory.  I thank Judicial Watch’s legion of supporters and our election law team that helped achieve this historic result.”\nBost’s election integrity lawsuit was initially filed on May 25, 2022.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#bost-case-progresses",
        "link": "https://supportmylocalcommunity.com/local-news/#bost-case-progresses",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-15",
        "is_primary": true
    },
    {
        "id": "eagle-watch",
        "title": "EAGLE WATCH",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Eagle-1-resized.webp",
        "full_story": "1/15/26\nEagle Watch, a collaboration between the US Army Corps of Engineers (USACE) Carlyle Lake Project and Case-Halstead Public Library, will take place on Saturday, January 31\nst\n.  The World Bird Sanctuary will present two “All About Eagles” programs, one at 9:30 am and another at 10:30 am, featuring a live bald eagle and offering a closer look at the fascinating nature of this iconic species.\nWhile the event is free, tickets are required to ensure a quality experience and manage limited parking.  A maximum of 120 participants per session will be allowed.  There will be an eagle craft station for children, along with eagle identification sheets and maps of local eagle nests around Carlyle Lake.  To reserve your spot, visit ticketleap.events/events/carlylelakeusace.  For more information, call the Carlyle Lake Project Office at 618-594-2484 Option 3 or email\n.\nThe 2026 Midwinter Bald Eagle Survey, conducted by USACE employees from January 9\nth\nand 10\nth\n, revealed a thriving eagle population around Carlyle Lake.  The survey identified 17 mature and 13 immature bald eagles across four counties.  Carlyle Lake, with its extensive 80 miles of shoreline, offers an ideal habitat that provides all necessary resources for these birds.  Over time, the number of eagles at the lake has steadily risen, with several active nests now established.  This increase underscores the positive impact of federal conservation efforts and laws in safeguarding these magnificent raptors.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#eagle-watch",
        "link": "https://supportmylocalcommunity.com/local-news/#eagle-watch",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-15",
        "is_primary": true
    },
    {
        "id": "at-large-vacancy",
        "title": "AT LARGE VACANCY",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/12/Trial-4-resized.webp",
        "full_story": "1/15/26\nJustice David K. Overstreet of the Supreme Court of Illinois has begun an application process for an at-large circuit judge vacancy in the Sixth Judicial Circuit.\nThe vacancy was created by the retirement of Judge Jeffrey Geisler.\nPursuant to the authority of section 12, subsection (c) of article VI of the Constitution of Illinois, the Supreme Court will appoint a person to temporarily fill that vacancy until the vacancy is filled through the general election on November 7, 2028.  The temporary appointment will terminate December 4, 2028. To be eligible for appointment to fill this vacancy, a person must be a resident in the Sixth Judicial Circuit at the time of the appointment.\nQualifications for the office of Circuit Judge are set forth in section 11 of article VI of the Constitution of Illinois and 705 ILCS 40/2(d).  Persons meeting those qualifications are invited to submit applications containing the information requested in the Applicant Information for Circuit Judge At-Large, Sixth Judicial Circuit Vacancy, along with a cover letter to Justice David K. Overstreet, P.O. Box 489, Mt. Vernon, IL 62864 or electronically to his Judicial Secretary, René Gozia at\n.  Applications must be received in his office by Monday, January 12, 2026.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#at-large-vacancy",
        "link": "https://supportmylocalcommunity.com/local-news/#at-large-vacancy",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-15",
        "is_primary": true
    },
    {
        "id": "ifb-urges-year-round-e15",
        "title": "IFB URGES YEAR-ROUND E15",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/E15-resized.webp",
        "full_story": "1/15/25\nIllinois Farm Bureau signed onto a letter with about 75 other groups urging Congress to pass a legislative solution that allows for the sale of year-round E15 as soon as possible.  The letter was sent to congressional leadership and was signed by groups representing farmers and renewable fuel.\nA bipartisan, commonsense bill to permanently allow the sale of year-round, nationwide E15 would boost farm income and lower the price drivers pay at the pump, according to the letter.  The Ag Department projects a more than 17 billion-bushel corn harvest in 2025.  “While this demonstrates the strength and productivity of America’s farmers, it also intensifies pressure on corn prices and farm incomes.  Without new markets, too many bushels will be chasing too few buyers, threatening to deepen the financial strain in rural communities,” the letter states.  “Expanding E15 access is one of the most immediate and practical ways to address this imbalance.”\nA recent study found nationwide, year-round E15 sales would add up to $25.8 billion to US Gross Domestic Product, generate up to $10.3 billion in household income and support more than 128,000 new full-time jobs across the economy, the letter states.  For consumers, E15 typically sells for 10 to 30 cents less per gallon than standard gasoline, and more than 95% of vehicles on the road are approved to use the fuel.  In recent years, E15 availability during the summer driving season has depended on temporary emergency waivers.\n“Year-to-year uncertainty discourages investment in fuel infrastructure, confuses consumers and undermines confidence among retailers and refiners,” according to the letter.  “With record corn and sorghum crops filling bins across America, farmers cannot afford another season of uncertainty and negative margins.  Markets need consistency and predictability, which requires permanent legislative action by Congress.”\nThe Illinois Corn Growers Association and Illinois Renewable Fuels Association also signed the letter.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#ifb-urges-year-round-e15",
        "link": "https://supportmylocalcommunity.com/local-news/#ifb-urges-year-round-e15",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-15",
        "is_primary": true
    },
    {
        "id": "empowering-the-next-generation",
        "title": "EMPOWERING THE NEXT GENERATION",
        "full_story": "1/13/26\nThe Full Armor Christian Academy in Louisville and Olney are bringing Alan and Lisa Robertson to Olney January 30\nth\nand 31\nst\nfor an event titled Empowering the Next Generation.\nThe event will be held at the Elm Street Christian Church at 6 pm on Friday, January 30\nth\nand at 2pm on Saturday January 31\nst\n.  Alan is a co-host of the “Unashamed” podcast, as well as an accomplished author and speaker.  Together, Alan and Lisa bring a message of vision, character, and hope as they challenge the community to invest in today’s youth, tomorrow’s leaders.  This uplifting night is designed for families, friends, and community members of all ages.  Don’t miss this special opportunity to come together and support a strong future for the next generation.\nTickets can be purchased by going to the Full Armor Facebook page and clicking the link for either the Friday night or the Saturday afternoon program and seating is limited.\nFor more information on sponsorship opportunities, please contact Full Armor at 618-392-0300.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#empowering-the-next-generation",
        "link": "https://supportmylocalcommunity.com/local-news/#empowering-the-next-generation",
        "tags": [
            "Louisville"
        ],
        "date": "2026-01-14"
    },
    {
        "id": "county-fair-queen-pageant",
        "title": "COUNTY FAIR QUEEN PAGEANT",
        "full_story": "1/13/26\nClay County Fair Queen Olivia Haun is headed to the 2026 Miss Illinois County Fair Queen Pageant which will be held on Saturday, and Sunday in Springfield.\nThe pageant happens during the 115\nth\nannual meeting and convention of the Illinois Association of Agricultural Fairs at the Crowne Plaza and Holiday Inn Express.  There are 75 County Fair Queens competing for the title.  With former county fair queens taking part, the actual competition on Saturday begins with rehearsal at 8:30 Saturday morning, and Pageant Finals beginning at 6:30 Sunday evening.\nVoting for this year’s People’s Choice award winner is underway.  Through midnight Saturday, use the link in this story to make your voice count and show support for Olivia by voting.  The cost is $1 per vote and you can vote as many times as you like.  The People’s Choice winner will be announced on stage and will earn a cash scholarship.  The winner will also get to donate $500 to a charity of their choice.\nJohnna Fulcher is the retiring Miss Illinois County Fair Queen.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#county-fair-queen-pageant",
        "link": "https://supportmylocalcommunity.com/local-news/#county-fair-queen-pageant",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "whitetails-unlimited-banquet",
        "title": "WHITETAILS UNLIMITED BANQUET",
        "full_story": "1/13/26\nThe River Bottom Stump Sitters Chapter of Whitetails Unlimited will be having a banquet on Saturday, February 28\nth\n.  The banquet will be in the gym of the St. Theresa of Avila Church in Salem.\nDoors will open at 4 pm and the dinner will begin at 6 pm.\nThere will be door prizes, an auction and gun raffle.\nTickets are now on sale, for more information or to get tickets or raffle tickets, call Sandy at ACT Tire and Auto at 618-838-2253 or email\n.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#whitetails-unlimited-banquet",
        "link": "https://supportmylocalcommunity.com/local-news/#whitetails-unlimited-banquet",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "justin-townsend-honored",
        "title": "JUSTIN TOWNSEND HONORED",
        "full_story": "1/13/26\nFairfield Mules head football coach Justin Townsend is entering the Illinois High School Football Coaches Association hall of fame as a member of the class of 2026.\nTownsend will be honored on Saturday, March 28\nth\nat the annual hall of fame banquet.  Townsend is one of six active coaches to be enshrined as part of the 16-member class.\nHe took over as head coach of the Mules in 2001 and is the winningest coach in Fairfield Mules history with a record of 150-95.  He has lead the mules to 37 consecutive conference wins from 2016-2021 and 18 IHSA state playoff appearances.\nTownsend will also be inducted into the McKendree University Hall of Fame this year, where he played from 1996 to 1999 and was a 1999 First-Team NAIA All-American and All-Mid-States Football Association selection.\nAlso to be inducted into the hall of fame is retired Lawrenceville Coach Greg Wood.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#justin-townsend-honored",
        "link": "https://supportmylocalcommunity.com/local-news/#justin-townsend-honored",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "girl-scout-cookies",
        "title": "GIRL SCOUT COOKIES",
        "full_story": "1/13/26\nIt’s officially Girl Scout Cookie season in Southern Illinois.  Girl Scouts throughout the area will hold cookie booths, visit customers door-to-door, and sell to friends and family online as they explore more possibilities through the largest girl-led entrepreneurial program in the world.\nDuring this highly anticipated time of the year, girls acquire five important life skills, goal setting, decision making, money management, people skills, and business ethics.  All proceeds from cookie sales stay local to power Girl Scout adventures year-round.  Every box of cookies sold provides invaluable experiences for Girl Scouts such as service projects, troop travel, STEM programs, and summer camp.\nLoretta Graham, Chief Executive Officer for Girl Scouts of Southern Illinois said, “When people support the Girl Scout Cookie Program, they aren’t just purchasing cookies.  They are fueling experiences and empowering girls to explore new adventures – all while girls gain skills that last a lifetime.  The cookies that customers receive in return are a ‘thank you’ for building girls of courage, confidence, and character, who make the world a better place.”\nExploremores, a rocky road ice cream–inspired sandwich cookie, will join the legendary lineup for the 2026 Girl Scout Cookie season.  Filled with delicious flavors of chocolate, marshmallow, and toasted almond–flavored crème, Exploremores reflect the spirit of exploration at the heart of every Girl Scout.  In addition to the exciting new cookie, the 2026 cookie lineup will include fan favorites such as Thin Mints, Samoas, Tagalongs, and more.\nBooths are starting to pop up throughout the region this week.  To find a booth near you or to order cookies online, visit gsofsi.org/findcookies.  While picking up some cookies for yourself, you can also purchase a box or two to donate to the Bake It Forward program.  All cookies purchased through Bake It Forward will be donated to H.E.R.O.E.S. Care – an organization supporting military personnel and their families.  The Girl Scout Cookie Program runs through March 15\nth\nin Southern Illinois.\nGirl Scouts of Southern Illinois serves over 6,300 girls and engages nearly 3,600 adults in 40 counties in Southern Illinois.  Call 800-345-6858 or email\n.  Girl Scouts of Southern Illinois is a not-for-profit organization supported by United Ways, businesses, and individual donors throughout the region.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#girl-scout-cookies",
        "link": "https://supportmylocalcommunity.com/local-news/#girl-scout-cookies",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "firewood-collection",
        "title": "FIREWOOD COLLECTION",
        "full_story": "1/13/26\nSam Dale Lake State Fish and Wildlife Area is issuing firewood collection permits.  Park officials will issue a limited number of permits on a first come, first serve basis.\nEach permit allows the holder to collect two loads of firewood.  Depending on how many applicants there are, up to three permits can be issued per year.\nAnyone interested in securing a permit should call the site office at 618-835-2922 or visit the Sam Dale Lake office.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#firewood-collection",
        "link": "https://supportmylocalcommunity.com/local-news/#firewood-collection",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "deadline-extended",
        "title": "DEADLINE EXTENDED",
        "full_story": "1/13/26\nGet Covered Illinois announced Monday that it is giving residents an additional 16 days to enroll in health insurance through the state’s official marketplace.  Customers now have until January 31\nst\nto apply for and enroll in coverage.\n“We are seeing record numbers of customers finding more affordable coverage by taking the time to shop for and compare plans” said Morgan Winters, Director of Get Covered Illinois.  “As a state-based marketplace, not only do we now have the authority to offer this special enrollment extension, but we also have more resources to support our customers in finding affordable health coverage options.”\nIllinois invested nearly $7 million dollars into navigator grants that provide enrollment support to residents and has built a strong certified broker network.  Brokers are critical enrollment partners who both help customers navigate the application and enrollment process and provide individual plan recommendations.  These services are free to Illinois residents.\n“There are more than 140 navigators and 9,000 brokers located around the state who stand ready to help our customers apply for and enroll in quality health coverage,” said Ezra Watland, Chief Operating Officer at Get Covered Illinois.  “I recommend anyone needing health coverage or who hasn’t taken the time to compare their options, use this additional time to reach out to a broker or navigator.”\nIllinois residents can connect with navigators and brokers by using the Get Covered Illinois online directory.\nThe deadline for enrolling in coverage starting February 1\nst\n, is January 31\nst\n.  Visit GetCoveredIllinois.gov to apply and enroll or call our Customer Assistance Center at 1-866-311-1119 (TTY: 711).  The Customer Assistance Center is offering extended hours through January 31\nst\n.\nGet Covered Illinois is the state’s official health insurance marketplace and a division of the Illinois Department of Insurance.  We help residents shop, compare, and enroll in quality, affordable health coverage under the Affordable Care Act.  Free, one-on-one enrollment help is available statewide from trained navigators and licensed brokers, in person, by phone, and online, with support in multiple languages.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#deadline-extended",
        "link": "https://supportmylocalcommunity.com/local-news/#deadline-extended",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "preliminary-hearing-finally-held",
        "title": "PRELIMINARY HEARING FINALLY HELD",
        "full_story": "1/13/26\nThe long-delayed preliminary hearing for former Wabash County Sheriff’s Deputy Chase Cheadle was held on Thursday, where a judge found probable cause in the case.  Cheadle entered a plea of not guilty to the remaining charges.  A pretrial hearing has been scheduled for February 19\nth\n.\nCheadle’s preliminary hearing had been postponed multiple times, with delays dating back to November of 2024.\nThe former sheriff’s department canine handler was originally charged with eight counts, including four counts of official misconduct, one count of theft, one count of cruelty to animals, and two counts of animal owner duties violations.  Five of those charges were felonies.\nHowever, in June, Special Prosecutor Brian Towne requested dismissal of two felony counts, the theft charge and one count of official misconduct, which were granted by the court.\nAccording to investigators, the 30-year-old Cheadle found his K-9 partner, Kiki, unresponsive in July of 2024.  He was later arrested following the investigation and resigned from the Wabash County Sheriff’s Department one month later.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#preliminary-hearing-finally-held",
        "link": "https://supportmylocalcommunity.com/local-news/#preliminary-hearing-finally-held",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "theis-retires",
        "title": "THEIS RETIRES",
        "full_story": "1/13/26\nIllinois Supreme Court Justice Mary Jane Theis announced her retirement from the Illinois Supreme Court effective January 29\nth\n. Justice Theis has served on the Supreme Court since 2010 and retires as one of the most prolific judges in Illinois history, having served in all levels of the judiciary in 40-plus years on the bench.  She served as Chief Justice of the Supreme Court from 2022 to 2025.\nThe Supreme Court has constitutional authority to fill interim judicial vacancies and has appointed First District Appellate Court Justice Sanjay T. Tailor to fill Justice Theis’ seat.\nJustice Tailor, whose term is effective January 30\nth\n, through December 4\nth\n, 2028, will be the first Asian American to serve on the Illinois Supreme Court.\nJustice Sanjay Tailor has been a judge for 23 years, sitting on the trial and appellate courts.  His appointment makes him the first Asian American to serve as a justice of the Illinois Supreme Court.  He was first appointed to the bench as an Associate Judge in 2003 and won election as Circuit Judge in 2022.  He served in five different divisions of the Circuit Court including as Presiding Judge of the County Division.  He also served in the Chancery, Law, Domestic Relations and Municipal Divisions.  For the last three years he has served by assignment as a First District Appellate Court justice, including as Presiding Justice of his division.\nBefore joining the bench, Justice Tailor served as an Assistant State’s Attorney in the Cook County State’s Attorney’s Office.  He also practiced law as a senior attorney at the First National Bank of Chicago, and associate at Chapman and Cutler LLP.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#theis-retires",
        "link": "https://supportmylocalcommunity.com/local-news/#theis-retires",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "wabash-communications-scholarship",
        "title": "WABASH COMMUNICATIONS SCHOLARSHIP",
        "full_story": "1/12/26\nApplications are now open for Wabash Communications scholarships.  Wabash Communications is awarding more than $20,000 to graduating seniors in the service area to help with college, trade school, or certification programs.\nWabash Communications awards more than $20,000 in scholarships annually to graduating high school seniors across the service area.\nTo qualify for the Wabash Communications scholarships your parent or legal guardian must be a member/customer of Wabash Communications or Wabash Communications Co-op, you plan to continue your education after high school at University or College, Junior college, Trade school, or Certification program.  Any field of study qualifies, there is no GPA minimum, and there are no extracurricular requirements.\nEducation is expensive.  These scholarships are meant to help offset those costs so students can stay focused on what’s next, whether that’s college, technical training, or a certification program.  If you’re continuing your education, you’re eligible to apply.\nThe application process is straightforward, complete the application and required information at\n.  Submit your application by March 6\nth\nthere is no application fee.\nIf you’re a graduating senior and meet the eligibility requirements, don’t wait.  This is an opportunity to receive financial support from a local cooperative that’s invested in your future.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#wabash-communications-scholarship",
        "link": "https://supportmylocalcommunity.com/local-news/#wabash-communications-scholarship",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "chamber-awards",
        "title": "CHAMBER AWARDS",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Winners-1-resized.webp",
        "full_story": "1/14/26\nThe Flora Chamber of Commerce announced the 2025 Annual Recognition Award winners.\nThe Business of the Year Award winner is Two Glitzy Girlz, the New Business of the Year Award winner is the Flora Diner, the Non-Profit of the year award winner is the Rotary Club of Flora, and the Citizens of the Year Award winner is Peggy James.\nThe chamber would like to thank everyone for all the wonderful nominations that were submitted this year.  We hope that you will help celebrate these winners at the awards banquet on January 31\nst\n.  Tickets are on sale through Friday January 23\nrd\n.\nFor more information regarding the awards banquet, please call Arriel Dulaney at the Chamber office at 618-662-5646.\nArriel will be the guest today on the ReVue at 2 pm.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#chamber-awards",
        "link": "https://supportmylocalcommunity.com/local-news/#chamber-awards",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "county-board-meeting",
        "title": "COUNTY BOARD MEETING",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/12/CC-Court-1-resized.webp",
        "full_story": "1/14/25 Beth Fancher\nThe Clay County Board met in regular session last night.\nTed Whitehead, Representative for Snedeker Risk Management presented Joe Goodman, Clay County Board Chairman with a dividend check for $13,440.  Snedeker Risk Management  runs the HOPE Trust and members own the trust, which provides health benefits to county, school district, city, village and other local government employees throughout the State of Illinois.  Since commencing 15 years ago, there are currently 30 public entities and schools participating in the program.\nCounty Engineer Darin Koelm announced they will be posting seasonal weight limits from January 15\nth\nto April 15\nth\n.  “There are four ways to find weight limits,” Koelm said.  “You can call the office 24 /7 and the up-to-date weight limits are listed, as well as looking on the website, also WNOI lists the weight limits and the sheriff’s office has the latest limits.  We will do whatever we can to help and are just asking county residents to help us maintain the county roads.”\nKoelm received approval for the engineer’s report, approval for the local public agency amendment of the joint funding agreement and apprised the board the department has received $750,000 from an IDOT grant.  He said they would use the money for the Hickory Hill and Butternut Road project.\nState’s Attorney Phillip Givens received approval for an interim intergovernmental agreement for the Village of Louisville to receive animal control services through Clay County.\nHeather Greenwood, team leader with Partners for Progress Deflection Initiative provided the board with information concerning the multiple counties program with community-based resources to assist individuals struggling with substance use, mental health challenges or housing insecurities.  Greenwood said there will be two deflective specialists assigned to Clay County to help keep people out of the justice system or from returning.\nLaw enforcement will make referrals, and the specialists will keep track of the individuals.  “We will be launching an event in Flora at the Church of the Nazarene on March 4\nth\n,” Greenwood explained.  “More information will be announced on the upcoming event.”\nThe board passed an intergovernmental agreement and passed an ordinance for public transportation presented by Central Illinois Public Transit.\nClay County Hospital CEO and President Bob Sellers said there was a meeting for bid contractors.  The bids will be announced for the grant project for building a new Health Department at the February Hospital Board and then to the County Board meeting.  Sellers received approval for the Hospital Report, approval to have Lindy Kohn’s name added to the Bank ACH authorizations and approval to purchase hospital waiting room furniture and two infusion recliners for $72,895.  He also announced the hospital has signed a contract with Chiropractor Brittany Hoselton.  She will be working in the Louisville Clinic and said he felt this would add a new holistic realm of the medical needs the hospital can offer.\nSheriff Andy Myers obtained authorization for the Sheriff’s Office report for December and secured approval for a Major Case Squad Intergovernmental Agreement.  “The squad will be made up of officers from I-70 south,” Sheriff Myers said.  “With Lt. Abner’s experience I think he will fit the needs.  There will be no money exchange since we will be working together.”\nBoard member Terry Hronec with the board executive finance committee, received approval for the following purchases paid out of the Capital Expenditure Account: a track hoe for the Highway Department; a server for the courthouse, $18,719.29; computers for the County Clerk’s Office, $7,988 and scuba gear for ESDA, $13,895.89.\nA resolution was passed ensuring county office holders reimburse the county for associated benefits match payroll costs on employee stipend/bonuses.\nBoard member Barbara McGrew was appointed as a member of the Southern Illinois Economic Development Authority (SIEDA) board.  She will be replacing board member Jeremy Kohn who asked to be replaced because of meeting times.\nThe transfer of the proceeds for the sale of 935 Bryant Street, in Louisville to Clay County Hospital, $94,887 was approved for bookkeeping purposes.  A six-month extension for Kemper CPA to complete the Circuit Clerk’s audit was approved.\nBoard member Barb McGrew read the results of the December Claims Committee meeting.  There was $3,315,180.84 paid claims and $352,636.85 unpaid claims from the Hospital; $802,063.40 paid claims and $75.00 unpaid claims from County Highway; $780,479.54 paid claims and $2,819.77 unpaid claims from the Health Department; $258,509.31 paid claims from Clay County; $2,801.50 paid claims from 911; $108,529.16 paid claims from the Public Safety Tax and $4,616.45 paid claims from Animal Control.\nThe December Sheriff’s Department activity report included issuing 21 traffic citations, 25 criminal arrests served 26 various civil papers, conducted 30 criminal investigations and 17 accident investigations.  There were 19 people processed through the jail.  The Sheriff’s Office received $653.60 which included: $528 civil process; $6 E-citations; $89.60 IDOC transport fees and $30 report fees.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#county-board-meeting",
        "link": "https://supportmylocalcommunity.com/local-news/#county-board-meeting",
        "tags": [
            "Police/PD",
            "Louisville",
            "Flora"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "clip-and-tip-strays-cats",
        "title": "CLIP AND TIP STRAYS (C.A.T.S.)",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Cats-Jan-resized.webp",
        "full_story": "1/14/26\nTwenty Clay County cats were sterilized on Tuesday, January 13\nth\nat a Spay & Neuter Clinic Day in Flora run by the nonprofit Clip and Tip Strays (C.A.T.S.).\nLicensed traveling veterinarian Dr. Meghann Jerden conducted the surgeries at the Wags and Wash Salon at 421 West North Avenue in Flora.  Five C.A.T.S. volunteers from Louisville and Flora assisted.\nSurgeries were done at affordable rates: $80 for a spay and $50 for a neuter and included rabies vaccination.  The 10 female and 10 male cats were outside community cats, barn cats, and inside owned cats.  Surgeries were funded by cat owners and caretakers.\nCat Osterholtz, founder/chairperson of C.A.T.S., and owner of Wags and Wash Salon, said: “This is our second large Spay & Neuter Clinic Day with Dr. Jerden coming to Flora.  Our first Clinic Day in November sterilized 38 cats. Last month, our volunteers transported 10 cats to her location for surgeries.  Within a short span, our program has helped 68 cats in Clay County get on the road to healthier, longer lives.  We plan to conduct a sterilization clinic once a month to reduce the cat overpopulation problem in our county.”\nSpaying/neutering not only stops the breeding cycle, it also delivers numerous behavioral and health benefits for both male and female cats.\nClip and Tip Strays (C.A.T.S.) is a new, volunteer-driven nonprofit based in Flora.  The group aims to raise funds through fundraisers and donations and conduct Trap-Neuter-Release (TNR) as a cost-effective, humane way to control the feral and stray feline population in Clay County.  C.A.T.S. also offers traps and carriers to cat owners and caretakers for trapping and transport.\nFollow C.A.T.S. on its Facebook page for upcoming Clinic Day updates or call/text 618-662-3837, or contact them by mail at PO Box 23, Flora, IL 62839.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#clip-and-tip-strays-cats",
        "link": "https://supportmylocalcommunity.com/local-news/#clip-and-tip-strays-cats",
        "tags": [
            "Louisville",
            "Flora"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "xenia-village-board-meeting",
        "title": "XENIA VILLAGE BOARD MEETING",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/11/Xenia-1-resized.webp",
        "full_story": "1-13-2026Timothy Russell\nThe Xenia Village Board met in regular session last night.\nAll trustees were in attendance including the village attorney who attended via speaker phone.\nThe First item of business on the agenda was the appointment of Logan Dye to the Gateway water and sewer board of Trustees.  Followed by the approval of minutes from December’s meeting, and approval of the treasure’s report, and bills.\nIt was reported that water loss of 8% or 69,332 gallons for November thru December and 13% or 92,448 gallons for December thru January.  In old business, the board of trustees discussed recent construction work which had taken place on one property that had been purchased and remained vacant for some time.  Updates were provided on the Slagley property which trustees hoped might become the location of a Dollar General in the village.  However, the site was rejected due to its small size.\nThe Knapp gas station located in Xenia also closed unexpectedly last month after a visit from the Department of Revenue and is not expected to re-open.\nThe status of the IMRF state retirement fund for the village remains uncertain after months with no updates.  The Villages attorney plans to reach out to state representatives regarding the matter.\nIn police Business Officer Jerry Burkett told trustees that repairs had been made to police cruisers including a new battery in the Explorer and a new grill on the Impala.\nTrustees discussed options for repair and or replacement of the heating and air conditioning in the cafeteria and gathering options for the placement of a notice of bid for the repairs.  No action was taken on the matter after a question of numerous repairs to the gym were raised, and it could be determined which repair were a higher priority as well as where the money for repairs would come from.  Trustees discussed bringing in city engineer Mike Bridges to make assessments before any decision is made.\nThe reestablishing of committees to enforce village ordinances was also discussed before being tabled, citing the need for more information on how the committees’ function and clearer outlines of committee duties and responsibilities.  The Villages police breakfast was set for February 6\nth\nfrom 6 to 10 am.  Options of biscuits and gravy, eggs and sausage and possibly cinnamon rolls will be available to those who attend.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#xenia-village-board-meeting",
        "link": "https://supportmylocalcommunity.com/local-news/#xenia-village-board-meeting",
        "tags": [
            "Xenia",
            "Police/PD"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "kinmundy-fire",
        "title": "KINMUNDY FIRE",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Fire-1-resized.webp",
        "full_story": "1/14/26\nOne person was burned at about 4:30 on Monday afternoon when a fire destroyed a barn in rural Kinmundy.\nKinmundy-Alma Fire Chief Kevin Day says Trevor Robins was using a cooker inside a barn on Meachum Road.  Robins says he was using a cooker when he heard a propane tank beginning to pop off.  He told everyone to get out, but before he was able to exit a flash fire occurred.  Robins received first and second degree burns to his face and arms and was transported to Salem Township Hospital.\nWhen firemen arrived on the scene, Chief Day says the fire had fully engulfed the 30 by 60 foot pole barn.  The barn along with a car, boat, and three propane tanks were destroyed.  Firemen were on scene for about 2 hours.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#kinmundy-fire",
        "link": "https://supportmylocalcommunity.com/local-news/#kinmundy-fire",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "effingham-teacher-arrested",
        "title": "EFFINGHAM TEACHER ARRESTED",
        "image": "https://www.wnoi.com/wp-content/uploads/2025/12/arrested-2-resized.webp",
        "full_story": "1/14/26\nA teacher was arrested by Effingham Police on Friday after they said he sent “inappropriate electronic messages” to a student.\nIn a news release Monday afternoon, Effingham Police officials said they took a report on Friday alleging this communication between a student and 32-year-old Dakota M. Czerwonka Montrose.  Czerwonka was described as the founder of Crossroads Montessori School in Effingham, where he also taught.\nThe Effingham County State’s Attorney’s Office charged Czerwonka with one count of grooming and one count of sexual exploitation of a child.  They are both Class 4 felonies punishable by one to three years in prison and mandatory sex offender registration if convicted.\nThe State’s Attorney’s Office has filed petition to detain Czerwonka throughout the pretrial phase of his case.  Grooming is a detainable offense under the SAFE-T Act, and the Effingham Police Department supports detention due to Czerwonka’s occupation and the victim’s status as a student and minor.\nCzerwonka made his first court appearance on Monday.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#effingham-teacher-arrested",
        "link": "https://supportmylocalcommunity.com/local-news/#effingham-teacher-arrested",
        "tags": [
            "Police/PD"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "laker-academic-invitational",
        "title": "LAKER ACADEMIC INVITATIONAL",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Academic-Callenge-26-resized.webp",
        "full_story": "1/14/26\nOn Friday, February 6\nth\n, Lake Land College will host local high school students for the first-ever Laker Academic Invitational, a competitive event designed to challenge and recognize academic excellence.\nDuring the event, more than 300 students across 17 local high schools will compete in a series of multiple-choice exams, demonstrating their knowledge in biology, chemistry, computer science, software applications, English, mathematics and physics.  Through these experiences, the event fosters curiosity and confidence as students challenge themselves in a supportive environment and explore future college and career pathways.\nThe Laker Academic Invitational was designed to provide an engaging academic challenge for high school students following the discontinuation of the traditional ACES competition, which was previously held every year at Lake Land College.\nTessa Wiles, Director of Dual Credit and Honors Experience explained “We received an overwhelming response from the community that showed just how much ACES meant for high schools and their students, so we wanted to do what we could to ensure the event lives on.”  “We’re thankful for everyone who helped make this possible, and we look forward to seeing the positive impact it has on students and the community.”\nTo learn more about the Laker Academic Invitational, contact Dual Credit Events & Onboarding Specialist Ashlyn Paige at 217-234-5396 or\n.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#laker-academic-invitational",
        "link": "https://supportmylocalcommunity.com/local-news/#laker-academic-invitational",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "corn-yields",
        "title": "CORN YIELDS",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Corn-Field-resized.webp",
        "full_story": "1/14/26\nUSDA estimates American corn farmers produced more than 17 billion bushels of corn in 2025.\nThe record estimate, higher than the average trade guess, was boosted by a significant increase in harvested acres.  Since the June acreage report, the agency bumped its harvested area estimate by 4.5 million acres to 91.25 million – the highest since 1933.  The corn yield estimate was also higher at a record 186.5 bushels per acre, up from 179.3 in 2024.\nUSDA pegged Illinois corn production from last season at 2.35 billion bushels with an average yield of 214 bushels per acre, down 3.2% from its November estimate.\nThe higher production number boosted ending stocks, now seen at 2.22 billion bushels nationwide.  According to the quarterly stocks report released the same day, U.S. quarterly corn stocks on December 1\nst\nwere 13.82 billion bushels, up from 12 billion the year prior.\nU.S. soybean production came in at 4.26 billion bushels, with harvested area of 80.4 million acres and a record average yield of 53 bushels per acre, all slightly above trade expectations.  Yield was higher than 2024/25 but production was lower due to fewer harvested acres.  For Illinois, soybean yield was down 3.8% from November at 62.5 bushels per acre.\nSoybean stocks estimates are 350 million bushels, up from 290 million in December.  Quarterly stocks on December 1\nst\nwere at 3.29 billion, up from 3.1 billion a year ago.\nUSDA also increased Brazilian soybean production by 3 million metric tons as the country’s harvest begins.\nWhile the January estimates are considered USDA’s final revisions to 2025 corn and soybean production, Camp said the agency could still make adjustments.  But it likely would not be until the September report.\nFor winter wheat, the agency estimates U.S. farmers planted 32.99 million acres in 2025, slightly above trade expectations but below the year prior (33.15 million).  Wheat ending stocks were pegged at 926 million bushels, up from 901 million in December due to lower use.  Quarterly stocks for wheat came in at 1.68 billion bushels.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#corn-yields",
        "link": "https://supportmylocalcommunity.com/local-news/#corn-yields",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "meet-the-candidates",
        "title": "MEET THE CANDIDATES",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Meet-the-Candidates-resized.webp",
        "full_story": "1/14/26\nFrontier Community College in Fairfield will be hosting a Meet the Candidates Forum at Workforce Development Center on Thursday, February 19\nth\nfrom 6 to 8 pm.\nThose that attend can meet the candidates in the following races: Wayne County Treasurer, Wayne County Clerk, Wayne County Coroner, and Illinois State Representative for District 116.\nThe event will follow an informal format.  The evening will begin with introductions of all candidates participating in the March primary, followed by a structured question-and-answer session for the three candidates in the coroner’s race.  After the Q&A, attendees will have the opportunity to visit each candidate during a meet-and-greet session, allowing for more personal conversations with constituents.\nMembers of the public are encouraged to submit questions for the candidates to be addressed during the forum.  Questions may be sent to the FCC Student Senate email at\n.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#meet-the-candidates",
        "link": "https://supportmylocalcommunity.com/local-news/#meet-the-candidates",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "farm-building-checkup",
        "title": "FARM BUILDING CHECKUP",
        "image": "https://www.wnoi.com/wp-content/uploads/2026/01/Farm-Building-resized.webp",
        "full_story": "1/12/26\nThe winter months serve as a good time for farm building checkups.  Jeremiah Fairbanks is with Morton Buildings.\ncut 1:26 ‘…there.’\nHe says walk around the building to inspect the splashboard, a protective baseboard around a building exterior, especially for older structures.  Replacement is one option, since a rotted splashboard impacts the structural integrity of the building.",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#farm-building-checkup",
        "link": "https://supportmylocalcommunity.com/local-news/#farm-building-checkup",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-14",
        "is_primary": true
    },
    {
        "id": "a-part-that-broke-on-a-ups-plane-that-crashed-in-k",
        "title": "A part that broke on a UPS plane that crashed in Kentucky failed 4 times on other planes years ago",
        "image": "https://bloximages.newyork1.vip.townnews.com/wsiltv.com/content/tncms/assets/v3/editorial/9/d7/9d7749da-5b75-45ed-9347-aa8f31f146a7/69680a397f06e.image.jpg?crop=1280%2C672%2C0%2C144&resize=1200%2C630&order=crop%2Cresize",
        "full_story": "AP\nA part that broke on a UPS plane that crashed in Kentucky failed 4 times on other planes years ago\nThe National Transportation Safety Board says Boeing warned plane owners in 2011 about a flaw in the part that failed and contributed to the engine flying off a UPS plane before it crashed and killed 15 in November but at that point the planemaker didn’t believe it threatened safety\nBy JOSH FUNK - AP Transportation Writer\nJan 14, 2026\nJan 14, 2026\nUpdated\n1 hr ago\nCopy article link\nBoeing warned plane owners in 2011 about a broken part that contributed to a UPS plane crash that killed 15 last year but at that point the planemaker didn't believe it threatened safety, the National Transportation Safety Board said Wednesday.\nThe\nin November 2025 shortly after taking off in Louisville, when the\nas the plane rolled down the runway.\nThe NTSB said Wednesday that Boeing had documented in 2011 there were four previous failures of a part that helps secure the MD-11's engines to the wings on three different planes, but at that point the planemaker \"determined it would not result in a safety of flight condition.\"\nNTSB didn't say whether there had been additional documented failures of the spherical bearing race since 2011. Investigators found that part broken into two pieces after the UPS crash, and the lugs that held that part were cracked.\nPhotos released by the NTSB of the Nov. 4 crash show flames erupting as the rear of the engine starting to detach before it flew up and over the wing. Then the wing was engulfed by fire as the burning engine flew above it.\non the plane that was headed for Hawaii were killed along with\non the ground near Louisville's Muhammad Ali International Airport.\nThe factual report released Wednesday doesn’t state what caused the engine to fly off. That conclusion won't come until the NTSB's final report, which usually doesn't come until more than a year after a crash.\nBoeing, UPS and the Federal Aviation Administration are limited on what they can say while the NTSB investigation is ongoing.\nUPS spokesperson Jim Mayer reiterated that the company was devastated by the crash. “We remain profoundly saddened by the Flight 2976 accident. Our thoughts continue to be with the families and Louisville community who are grieving, and we remain focused on the recovery effort,” Mayer said.\nThe NTSB previously said investigators\nin some of the parts that held the engine to the wing. Those cracks hadn't been caught in regular maintenance done on the plane, which raised questions about the adequacy of the maintenance schedule. The last time those key engine mount parts were examined closely was in October 2021, and the plane wasn't due for another detailed inspection for roughly 7,000 more takeoffs and landings.\nThe 34-year-old MD-11 plane only got 30 feet (9.1 meters) off the ground before crashing into several industrial buildings just past the runway and generating a massive fireball that could be\n. Dramatic videos of the crash showed the plane on fire as it plowed into buildings and released a massive plume of smoke.\nAirlines quit flying this type of plane commercially years ago because it isn't as efficient as newer models, but they had continued to fly for cargo carriers like UPS and FedEx and a few of these planes were also modified for use in firefighting. All the MD-11s that had been in use and 10 related DC-10s have been\n.\nIt's not clear when the cracks started to develop in the engine mounting pylon parts, but this crash is reminiscent of a 1979 crash in Chicago when the left engine flew off an American Airlines DC-10 during takeoff, killing 273 people. The DC-10 was the predecessor of the MD-11.\nThat previous crash led to the worldwide grounding of 274 DC-10s. The airline workhorse was allowed to return to the skies because the NTSB determined that maintenance workers damaged the plane that crashed while improperly using a forklift to reattach the engine. That meant the crash wasn’t caused by a fatal design flaw even though there had already been a number of accidents involving DC-10s.\nCopyright 2026 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.\nCopy article link\nTags\nAug 18, 2022\nDec 9, 2025\nUpdated\nJun 24, 2023\nUpdated\nMar 7, 2024\nFeb 28, 2025\nApr 16, 2025\nRecommended for you",
        "read_more_link": "https://supportmylocalcommunity.com/local-news/#a-part-that-broke-on-a-ups-plane-that-crashed-in-k",
        "link": "https://supportmylocalcommunity.com/local-news/#a-part-that-broke-on-a-ups-plane-that-crashed-in-k",
        "tags": [
            "Louisville"
        ],
        "date": "2026-01-14",
        "is_primary": false
    }
]