[
    {
        "id": "flora-city-council-meets",
        "title": "FLORA CITY COUNCIL MEETS",
        "full_story": "(1/6/25/26) pg\nThe Flora City Council met Monday afternoon and made quick work of a light agenda.\nWhen Mayor Linda Spicer called the meeting to order she called on visitors to address the group and welcomed April Carruthers with the Clay County Health Department.  Carruthers stated that the health department is requesting the use of the REA Building at the Clay County Fairgrounds in Charley Brown Park.  They plan to put on the next installment of their Spring Resource Carnival on Thursday, May 7\nth\n.  This year’s theme is Toy Story, and they hope to build on last year’s effort where they had over 500 participants.  Commissioners wasted little time in approving the request and wished them success with the event.\nNext, Heather Greenwood with Wabash General Hospital addressed the council to lobby for support for a new state backed program that she is volunteering with called Partners for Progress.  The local group covers 8 southeastern Illinois counties and seeks to work with individuals who may have contact with law enforcement but are not in the system.  They seek to deflect these people from further engagement with the legal system by what she described as relentless engagement with behavioral and mental health specialists.  She explained to commissioners how the program works and encourages them and other people in the community to get involved.  Flora Police Chief Jeremy Ruger echoed Greenwood’s remarks and stated that the program is showing positive results elsewhere.  Greenwood says local involvement is key and they are launching an event in Flora on March 3\nrd\nat Church of the Nazarene on Parsons Lane.  She said she will present additional details as the event draws nearer and will soon begin an effort to publicize it in various media.  Mayor Spicer and commissioners thanked her for her effort and encouraged her to keep her enthusiasm.\nAs the official meeting got underway members quickly approved the meeting agenda and consent agenda which included approval of past meeting minutes and the December Warrant List.\nIn regular business, Mayor Spicer announced the winners of the Best Christmas Lights in Town Contest.  She also thanked everyone who entered the contest and urged others to participate next year.  Earning Third Place and a $75 Utility Bill Credit are John and Casey Armstrong at 403 E. 5\nth\nSt.  Second Place and a $100 Utility Bill Credit goes to Jeff and Christy Pierson at 22 Holly Lane.  And First Place with a $150 Utility Bill Credit goes to Rob and Angie McKnight at 7 Sunset.  Congratulations to the winners.  Mayor Spicer added that city workers have now taken down the holiday decorations and the snowflakes are gone from Flora for the season.  She then polled commissioners for their comments.  Only one offered any comment and that was Phil Wiley.  He thanked the city for purchasing new decorations this year and encouraged them to purchase additional ones for next year.  He also thanked everyone for their efforts around town and suggested that perhaps a map can be created to help people find all the entries in the city contest.\nCity Administrator/Economic Development Director Mike Stanford called on Lee Beckman with Milano and Grunloh Engineers for an update on Flora’s grant applications.  Beckman quickly offered the latest on the Unsewered Areas and Lead Service Line grants.  He also Noted that Phase Two of the Safe Routes to School Grant is applied for and Phase One should go out for bids in February and construction could begin as early as March depending on the weather.  Stanford then asked the council to approve an ordinance for an intergovernmental agreement with the Village of Xenia.  He explained the ordinance will result in the city selling road salt to the village for $130 per ton.  Commissioners quickly approved the measure.  Stanford turned to three other informational items.  First, he noted that work will begin soon on the new housing project on South Stanford Road.  He says equipment is expected to be moved into the area this week for earthwork, but that is dependent on the weather.  Matt Johnson offered an update on the new sewer plant with additional news to come later this month.  Stanford also reported that results of the OSLAD Grant application were expected around the holidays, but Christmas and New Year’s Day have passed and there’s no word yet, but it should come, “soon”, which could mean Easter or the 4\nth\nof July for all he knows.   With that, all business was complete and the meeting adjourned.",
        "tags": [
            "Flora",
            "Xenia"
        ],
        "date": "2026-01-07"
    },
    {
        "id": "gingerbread-house-display",
        "title": "GINGERBREAD HOUSE DISPLAY",
        "full_story": "1/6/26\nToday is the last day to vote for your favorite Flora High School Foods Class Gingerbread house.  The students were asked to make houses from children’s books.\nThere are 30 different houses, and the public is encouraged to go into the library and vote for their favorite creation.  Simply write the number of your favorite house on your ballot and place it in the box.",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-07"
    },
    {
        "id": "empowering-the-next-generation",
        "title": "EMPOWERING THE NEXT GENERATION",
        "full_story": "1/6/26\nThe Full Armor Christian Academy in Louisville and Olney are bringing Alan and Lisa Robertson to Olney January 30\nth\nand 31\nst\nfor an event titled Empowering the Next Generation.\nThe event will be held at the Elm Street Christian Church at 6 pm on Friday, January 30\nth\nand at 2pm on Saturday January 31\nst\n.  Alan is a co-host of the “Unashamed” podcast, as well as an accomplished author and speaker.  Together, Alan and Lisa bring a message of vision, character, and hope as they challenge the community to invest in today’s youth, tomorrow’s leaders.  This uplifting night is designed for families, friends, and community members of all ages.  Don’t miss this special opportunity to come together and support a strong future for the next generation.\nTickets can be purchased by going to the Full Armor Facebook page and clicking the link for either the Friday night or the Saturday afternoon program and seating is limited.\nFor more information on sponsorship opportunities, please contact Full Armor at 618-392-0300.",
        "tags": [
            "Louisville"
        ],
        "date": "2026-01-07"
    },
    {
        "id": "north-clay-school-drill",
        "title": "NORTH CLAY SCHOOL DRILL",
        "full_story": "1/5/26\nThe North Clay School District in conjunction with the Clay County Sheriff’s Department will be conducting a law enforcement drill this afternoon.\nStaff will be present, but students don’t return to the classrooms until tomorrow.  School law enforcement drills are a standard part of school safety protocols, mandated by state law to prepare staff for emergency situations.  These drills are designed to ensure familiarity with procedures and reduce panic during a real incident.\nToday’s activity around the North Clay Schools is only a drill.",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-07"
    }
]