[
    {
        "id": "north-clay-school-drill",
        "title": "NORTH CLAY SCHOOL DRILL",
        "full_story": "1/5/26\nThe North Clay School District in conjunction with the Clay County Sheriff’s Department will be conducting a law enforcement drill this afternoon.\nStaff will be present, but students don’t return to the classrooms until tomorrow.  School law enforcement drills are a standard part of school safety protocols, mandated by state law to prepare staff for emergency situations.  These drills are designed to ensure familiarity with procedures and reduce panic during a real incident.\nToday’s activity around the North Clay Schools is only a drill.",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-05"
    },
    {
        "id": "flora-police-report",
        "title": "FLORA POLICE REPORT",
        "full_story": "1/5/26\nFlora Police Chief Jeremy Ruger released the following activity report over the weekend.\nOn Friday, November 7\nth\n, at 3:02 am, Flora Police arrested Erica R. Abner, 50 of Flora, for Driving Under the Influence of Alcohol following a traffic stop in the 1400 block of North State Road.  Abner was transported to the Flora Police Department where she underwent booking procedures.  She was later released with a court date.\nOn Friday, December 12\nth\n, at 9:43 pm, Flora Police investigated a single vehicle traffic crash involving Shawn M. Higgason, 51 of Clay City driving a 2009 Chevrolet near the intersection of US Highway 50 and North Olive Road.  No injuries were reported and no citations were issued.\nOn Monday, December 15\nth\n, at 3:50 pm, Flora Police investigated a traffic crash involving a 16-year-old female from Louisville driving a 2025 Ford and Luis F. Ambrocio Bautista, 34 of Flora driving a 2014 Ford at the intersection of North Elm Street and West North Avenue.  No injuries were reported and no citations were issued.\nOn Thursday, December 18\nth\n, at 4:10 pm, Flora Police investigated a traffic crash involving Phillip R. Rutger, 59 of Flora, driving a 2014 Dodge and Christina L. Dial, 71 of Louisville, driving a 2016 Jeep in the 200 block of West North Avenue.  No injuries were reported and no citations were issued.\nOn Thursday, December 18\nth\n, at 7:23 pm, Flora Police investigated a traffic crash involving Deborah A. Tolliver, 61 of Flora, driving a 2008 Toyota and John T. Harrington, 78 of Flora driving a 2018 Dodge in the 800 block of East North Avenue.  No injuries were reported and no citations were issued.\nOn Friday, December 19\nth\n, at 3:43 pm, Flora Police investigated a traffic crash involving Thomas J. Henson, 80 of Xenia, driving a 2024 Volkswagon, Ciarra C. Herring, 27 of Flora, driving a 2013 GMC and Cameron C. Reed, 26 of Irvington, driving a 2010 Ford in the 200 block of Given Street.  No injuries were reported and no citations were issued.\nOn Friday, December 19\nth\n, at 5:12 pm, Flora Police investigated a traffic crash involving Amber D. Rush, 45 of Cisne, driving a 2017 Jeep and Joshua P. Stroud, 34 of Flora, driving a 2019 Kia near the intersection of US Highway 50 and North Worthey Street.  No injuries were reported.  Rush was issued a citation for Disregarding Traffic Control Light.\nOn Tuesday, December 23\nrd\n, at 8:34 pm, Flora Police arrested a 16-year-old male from Effingham for Possession of Stolen Motor Vehicle following an incident in Effingham.  The juvenile was transported to the Flora Police Department where he underwent booking procedures.  He was later transported to Effingham.\nOn Wednesday, December 24\nth\n, at 10:41 am, Flora Police arrested Britany L. Keller, 32 of Flora, for Trespass to Vehicle following an incident in the 300 block of Fair Ave.  Keller was transported to the Flora Police Department where she underwent booking procedures.  She was later transferred to the Clay County Sheriff’s Office.\nAll persons are merely accused of the charges against them and are presumed innocent unless proven guilty in a court of law.",
        "tags": [
            "Flora",
            "Louisville",
            "Clay City",
            "Xenia"
        ],
        "date": "2026-01-05"
    },
    {
        "id": "athletic-hall-of-flame",
        "title": "ATHLETIC HALL OF FLAME",
        "full_story": "1/5/26\nFlora High School has announced this year’s inductees into the Athletic Hall of Fame.\nThis year’s inductees are 1990 graduate and basketball player Curtis Leib, 1988 graduate, inducted for Track Joann Herring.  Baseball star and 1954 graduate Ron Ayers, 2016 graduate and basketball standout Crimson Jones.  From the class of 1976 for football Charlie Krutsinger, 1987 graduate and basketball standout Janet Krutsinger.  Football and Basketball star and 1947 graduate Melvin Dold, Wolves football coach for 1927, 28 and 57 and 58 Bert Dancey, WNOI Wolves and Wolfgals radio broadcaster Kenny Windle will get the service award.  1957 graduate Janice Hardy will be given the lifetime achievement award, and the 1984 Flora Wolves Basketball Team.\nThey will be inducted during Homecoming Weekend which is Saturday, September 26\nth\n.",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-05"
    },
    {
        "id": "nomination-forms",
        "title": "NOMINATION FORMS",
        "full_story": "1/5/26\nToday is the last day to Nominate a business, nonprofit or person for the Flora Chamber of Commerce Business of the year, New Business of the Year, Citizen of the year and Non-Profit Organization of the Year.\nThe Chamber Banquet will take place at the end of January and will honor the winning entries.  The Chamber wants people to take time to read the criteria for nomination for all four entries. You also don’t have to nominate someone for each category, but the Chamber would like to have a short essay on why you are nominating that person, new business, business or Non-Profit Organization of the year.\nNomination forms can be submitted by going to the homepage of\nand clicking on Nominations for “of the Year” Awards.  They can also be submitted by email as long as your contact information is included.\nThe deadline to submit nomination forms is the close of business today.  Forms can be emailed to\n, mailed to the Chamber office at 223 West Railroad Street or drop it off at the chamber office.\nThe awards banquet will be held on January 31\nst\n.",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-05"
    },
    {
        "id": "ceo-3-on-3-tournament",
        "title": "CEO 3 ON 3 TOURNAMENT",
        "full_story": "1/5/26\nOnly a few more days are left to register for the Clay County CEO 3 on 3 basketball tournament.  The basketball tournament will be held on Saturday, January 24\nth\nin the North Clay High School Arena and North Gym.\nRegistration fees are $25 per player with a maximum of four players per team.  The tournament is for boys or girls and team categories will be for those 8 and under, 10 and under, 12 and under, 14 and under, 16 and under, 18 and under and 19 and up.  This includes a t-shirt for all paying participants.  All teams are guaranteed a minimum of 3 games.  Entries are available on the Clay County CEO Facebook page.  Registration deadline is January 10\nth\n.  If you need more information or need help email\nor call 618-508-1801.",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-05"
    },
    {
        "id": "christmas-tree-recycling",
        "title": "CHRISTMAS TREE RECYCLING",
        "full_story": "1/5/26\nToday is the last day to drop off your live Christmas tree for recycling at the Clay County Health Department.  This is the 18\nth\nAnnual Christmas Tree Collection.\nTraditional, real Christmas trees can still serve a valuable purpose after the holiday season.  Because they are biodegradable, these trees can be used for environmental applications such as providing valuable habitats for fish in ponds and lakes or being turned into compost or mulch for erosion control and soil stabilization.\nThis year, any donated trees will be given to the Stephen A. Forbes State Park, where they will be used in the lake to provide cover and nutrients for fish.\nChristmas trees may be dropped off at the West end of the Clay County Health Department any time before today by the Christmas Tree Collection sign and orange fencing.  Remember to remove any ornaments, decorations, and tinsel from your tree before dropping it off, these items are not biodegradable and will cause harm to wildlife.  A good rule of thumb is to take your tree to the drop-off location in the same condition as you would find it naturally in the forest.\nIf you have any questions or would like additional information, please contact the Clay County Health Department at 618-662-4406.",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-05"
    }
]