[
    {
        "id": "louisville-village-board",
        "title": "LOUISVILLE VILLAGE BOARD",
        "full_story": "1/9/26 Beth Fancher\nThe Louisville Village Board met last night.\nTed Whitehead with Hope Trust, a health option for public entities, presented Louisville Village Mayor Chris Rinehart with a dividend check for $1,300 as part of the $345,000 dividend issuance for local government employees throughout Illinois for which they represent.\nVillage trustees passed the county animal control contract with a vote of three votes for and three voting against.  Since the vote was a tie Mayor Chris Rinehart, in his capacity as mayor, is authorized to vote and he voted for the contract.  The cost is $500 a month and is supposed to end in July when Maple Flats Solar Farms has a contract, for the county to sign supposedly next Tuesday, to take over the animal control costs.  Village Attorney Kyle Boose explained he has been talking to States Attorney Phillip Givens concerning this, and he said the contract is supposed to be signed by the County Board January 13\nth\n.\nTrustees Scott Ikemire, Chuck Smith and Austin Hartsey voted against and Craig Clifton, Mary Frazier and Tim Davis voted for it.  Trustees Smith and Ikemire stated, during the discussion, they would vote against the motion because they wanted to wait and see what the county board did.\nThe village dumpster was also a major topic of discussion.  The cost of having the dumpster has risen because of the cost per tonnage deposited in the dumpster.  The issue was discussed and then tabled until February.  “We just want the village residents to know the issues of having a dumpster has been a problem,” Mayor Rinehart said.  “We have contractors filling the dumpster and not paying for usage and making access to the fenced in dumpster isn’t always convenient for residents.  The dumpster has cost the village almost $19,000 a year for the past two years.”",
        "tags": [
            "Louisville"
        ],
        "date": "2026-01-11"
    },
    {
        "id": "ceo-3-on-3-tournament",
        "title": "CEO 3 ON 3 TOURNAMENT",
        "full_story": "1/9/26\nTomorrow is the last day to register for the Clay County CEO 3 on 3 basketball tournament.  The basketball tournament will be held on Saturday, January 24\nth\nin the North Clay High School Arena and North Gym.\nRegistration fees are $25 per player with a maximum of four players per team.  The tournament is for boys or girls and team categories will be for those 8 and under, 10 and under, 12 and under, 14 and under, 16 and under, 18 and under and 19 and up.  This includes a t-shirt for all paying participants.  All teams are guaranteed a minimum of 3 games.  Entries are available on the Clay County CEO Facebook page.  Registration deadline is tomorrow.  If you need more information or need help email\nor call 618-508-1801.",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-11"
    },
    {
        "id": "bailey-proposes-doge",
        "title": "BAILEY PROPOSES DOGE",
        "full_story": "1/9/26\nIllinois Republican candidate for Governor Darren Bailey says a DOGE-like system can achieve savings and efficiencies in Illinois’ budget.\n“It needs to be broken down,” Bailey told reporters at a news conference at the Statehouse Thursday in Springfield.  “It needs to be audited.  It needs to be opened up so that people know where the money’s coming from.  I am very confident there are going to be a lot of waste discovery in that.”\nBailey also announced a plan to address cost-of-living issues and other areas that relies on DOGE-style governing to achieve results.  The commission under a Bailey governorship would be led by his running mate, Aaron Del Mar.\nBailey and Del Mar did not specify any cuts they’ve already identified but stressed it would not be a tool to lay off large numbers of state employees or make cuts based on partisan politics.\n“We’re not going in here with a chainsaw,” Del Mar said.  “We’re going in here with an X-Acto knife.  We are doing this as a purely public policy effort.  This is not politically driven.”\nBailey and Del Mar suggested numerous state boards and commissions deserve more scrutiny, and any jobs or services that are duplicative could be consolidated.\n“People understand what it means,” Bailey said. “They’re going to have to get over the federal situation and we’re going to understand we have our own problems in Illinois.  I am my own person, and I have proven that, regardless of who I like, who I support.”\nBailey received Trump’s endorsement during his unsuccessful 2022 campaign and said on Thursday he is willing to accept it again.\nBeyond the DOGE plan, the former state legislator from Clay County is proposing a series of initiatives he hopes will address affordability.\nTopping that list is utility prices, which have increased substantially throughout the state.  Bailey said he would repeal the 2021 Climate and Equitable Jobs Act that many Republicans blame for rising prices and dwindling supply. He also wants to require independent audits of major utility contracts.\nBailey said he would cap annual property tax rates to not exceed a person’s mortgage rate.  In response, he said the state would do more to fund education but did not elaborate on how much he would increase spending for public schools to help them rely less on property taxes.",
        "tags": [
            "Clay County"
        ],
        "date": "2026-01-11"
    },
    {
        "id": "chamber-banquet",
        "title": "CHAMBER BANQUET",
        "full_story": "1/8/26\nTickets for the 2025 Flora Chamber of Commerce Awards Banquet are officially on sale.\nThe Banquet will be held at the Nostalgia Theatre on January 31\nst\nwith social hour at 6:00 PM and the Dinner and Program at 7:00 PM.  The meal will be provided by Poe’d Smoked BBQ.\nTickets are $30 per person and are available through January 23rd.  Tickets may be purchased in person at the Chamber office.  The office is open on Tuesday, Wednesday, and Friday from 8:00 AM to 5:00 PM.\nIf you have any questions, call Arriel Dulaney at the Chamber office at 618-662-5646.",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-11"
    }
]