[
    {
        "id": "chamber-banquet",
        "title": "CHAMBER BANQUET",
        "full_story": "1/12/26\nTickets for the 2025 Flora Chamber of Commerce Awards Banquet are officially on sale.\nThe Banquet will be held at the Nostalgia Theatre on January 31\nst\nwith social hour at 6:00 PM and the Dinner and Program at 7:00 PM.  The meal will be provided by Poe’d Smoked BBQ.\nTickets are $30 per person and are available through January 23rd.  Tickets may be purchased in person at the Chamber office.  The office is open on Tuesday, Wednesday, and Friday from 8:00 AM to 5:00 PM.\nIf you have any questions, call Arriel Dulaney at the Chamber office at 618-662-5646.",
        "tags": [
            "Flora"
        ],
        "date": "2026-01-12"
    },
    {
        "id": "louisville-village-board",
        "title": "LOUISVILLE VILLAGE BOARD",
        "full_story": "1/9/26 Beth Fancher\nThe Louisville Village Board met last night.\nTed Whitehead with Hope Trust, a health option for public entities, presented Louisville Village Mayor Chris Rinehart with a dividend check for $1,300 as part of the $345,000 dividend issuance for local government employees throughout Illinois for which they represent.\nVillage trustees passed the county animal control contract with a vote of three votes for and three voting against.  Since the vote was a tie Mayor Chris Rinehart, in his capacity as mayor, is authorized to vote and he voted for the contract.  The cost is $500 a month and is supposed to end in July when Maple Flats Solar Farms has a contract, for the county to sign supposedly next Tuesday, to take over the animal control costs.  Village Attorney Kyle Boose explained he has been talking to States Attorney Phillip Givens concerning this, and he said the contract is supposed to be signed by the County Board January 13\nth\n.\nTrustees Scott Ikemire, Chuck Smith and Austin Hartsey voted against and Craig Clifton, Mary Frazier and Tim Davis voted for it.  Trustees Smith and Ikemire stated, during the discussion, they would vote against the motion because they wanted to wait and see what the county board did.\nThe village dumpster was also a major topic of discussion.  The cost of having the dumpster has risen because of the cost per tonnage deposited in the dumpster.  The issue was discussed and then tabled until February.  “We just want the village residents to know the issues of having a dumpster has been a problem,” Mayor Rinehart said.  “We have contractors filling the dumpster and not paying for usage and making access to the fenced in dumpster isn’t always convenient for residents.  The dumpster has cost the village almost $19,000 a year for the past two years.”",
        "tags": [
            "Louisville"
        ],
        "date": "2026-01-12"
    }
]