[
    {
        "id": "north-clay-school-drill",
        "title": "NORTH CLAY SCHOOL DRILL",
        "summary": "1/5/26 The North Clay School District in conjunction with the Clay County Sheriff’s Department will be conducting a law enforcement drill this afternoon. Staff will be present, but students don’t return to the classrooms until tomorrow.  School law e...",
        "full_story": "1/5/26 The North Clay School District in conjunction with the Clay County Sheriff’s Department will be conducting a law enforcement drill this afternoon. Staff will be present, but students don’t return to the classrooms until tomorrow.  School law enforcement drills are a standard part of school safety protocols, mandated by state law to prepare staff for emergency situations.  These drills are designed to ensure familiarity with procedures and reduce panic during a real incident. Today’s activity around the North Clay Schools is only a drill.",
        "tags": [
            "Clay County"
        ],
        "source": "WNOI Radio",
        "link": "https://www.wnoi.com/north-clay-school-drill/",
        "date": "2026-01-05"
    },
    {
        "id": "flora-police-report",
        "title": "FLORA POLICE REPORT",
        "summary": "1/5/26 Flora Police Chief Jeremy Ruger released the following activity report over the weekend. On Friday, November 7 th , at 3:02 am, Flora Police arrested Erica R. Abner, 50 of Flora, for Driving Under the Influence of Alcohol following a traffic s...",
        "full_story": "1/5/26 Flora Police Chief Jeremy Ruger released the following activity report over the weekend. On Friday, November 7 th , at 3:02 am, Flora Police arrested Erica R. Abner, 50 of Flora, for Driving Under the Influence of Alcohol following a traffic stop in the 1400 block of North State Road.  Abner was transported to the Flora Police Department where she underwent booking procedures.  She was later released with a court date. On Friday, December 12 th , at 9:43 pm, Flora Police investigated a single vehicle traffic crash involving Shawn M. Higgason, 51 of Clay City driving a 2009 Chevrolet near the intersection of US Highway 50 and North Olive Road.  No injuries were reported and no citations were issued. On Monday, December 15 th , at 3:50 pm, Flora Police investigated a traffic crash involving a 16-year-old female from Louisville driving a 2025 Ford and Luis F. Ambrocio Bautista, 34 of Flora driving a 2014 Ford at the intersection of North Elm Street and West North Avenue.  No injuries were reported and no citations were issued. On Thursday, December 18 th , at 4:10 pm, Flora Police investigated a traffic crash involving Phillip R. Rutger, 59 of Flora, driving a 2014 Dodge and Christina L. Dial, 71 of Louisville, driving a 2016 Jeep in the 200 block of West North Avenue.  No injuries were reported and no citations were issued. On Thursday, December 18 th , at 7:23 pm, Flora Police investigated a traffic crash involving Deborah A. Tolliver, 61 of Flora, driving a 2008 Toyota and John T. Harrington, 78 of Flora driving a 2018 Dodge in the 800 block of East North Avenue.  No injuries were reported and no citations were issued. On Friday, December 19 th , at 3:43 pm, Flora Police investigated a traffic crash involving Thomas J. Henson, 80 of Xenia, driving a 2024 Volkswagon, Ciarra C. Herring, 27 of Flora, driving a 2013 GMC and Cameron C. Reed, 26 of Irvington, driving a 2010 Ford in the 200 block of Given Street.  No injuries were reported and no citations were issued. On Friday, December 19 th , at 5:12 pm, Flora Police investigated a traffic crash involving Amber D. Rush, 45 of Cisne, driving a 2017 Jeep and Joshua P. Stroud, 34 of Flora, driving a 2019 Kia near the intersection of US Highway 50 and North Worthey Street.  No injuries were reported.  Rush was issued a citation for Disregarding Traffic Control Light. On Tuesday, December 23 rd , at 8:34 pm, Flora Police arrested a 16-year-old male from Effingham for Possession of Stolen Motor Vehicle following an incident in Effingham.  The juvenile was transported to the Flora Police Department where he underwent booking procedures.  He was later transported to Effingham. On Wednesday, December 24 th , at 10:41 am, Flora Police arrested Britany L. Keller, 32 of Flora, for Trespass to Vehicle following an incident in the 300 block of Fair Ave.  Keller was transported to the Flora Police Department where she underwent booking procedures.  She was later transferred to the Clay County Sheriff’s Office. All persons are merely accused of the charges against them and are presumed innocent unless proven guilty in a court of law.",
        "tags": [
            "Flora",
            "Louisville",
            "Clay City",
            "Xenia"
        ],
        "source": "WNOI Radio",
        "link": "https://www.wnoi.com/flora-police-report-7/",
        "date": "2026-01-05"
    },
    {
        "id": "athletic-hall-of-flame",
        "title": "ATHLETIC HALL OF FLAME",
        "summary": "1/5/26 Flora High School has announced this year’s inductees into the Athletic Hall of Fame. This year’s inductees are 1990 graduate and basketball player Curtis Leib, 1988 graduate, inducted for Track Joann Herring.  Baseball star and 1954 graduate ...",
        "full_story": "1/5/26 Flora High School has announced this year’s inductees into the Athletic Hall of Fame. This year’s inductees are 1990 graduate and basketball player Curtis Leib, 1988 graduate, inducted for Track Joann Herring.  Baseball star and 1954 graduate Ron Ayers, 2016 graduate and basketball standout Crimson Jones.  From the class of 1976 for football Charlie Krutsinger, 1987 graduate and basketball standout Janet Krutsinger.  Football and Basketball star and 1947 graduate Melvin Dold, Wolves football coach for 1927, 28 and 57 and 58 Bert Dancey, WNOI Wolves and Wolfgals radio broadcaster Kenny Windle will get the service award.  1957 graduate Janice Hardy will be given the lifetime achievement award, and the 1984 Flora Wolves Basketball Team. They will be inducted during Homecoming Weekend which is Saturday, September 26 th .",
        "tags": [
            "Flora"
        ],
        "source": "WNOI Radio",
        "link": "https://www.wnoi.com/athletic-hall-of-flame/",
        "date": "2026-01-05"
    },
    {
        "id": "nomination-forms",
        "title": "NOMINATION FORMS",
        "summary": "1/5/26 Today is the last day to Nominate a business, nonprofit or person for the Flora Chamber of Commerce Business of the year, New Business of the Year, Citizen of the year and Non-Profit Organization of the Year. The Chamber Banquet will take plac...",
        "full_story": "1/5/26 Today is the last day to Nominate a business, nonprofit or person for the Flora Chamber of Commerce Business of the year, New Business of the Year, Citizen of the year and Non-Profit Organization of the Year. The Chamber Banquet will take place at the end of January and will honor the winning entries.  The Chamber wants people to take time to read the criteria for nomination for all four entries. You also don’t have to nominate someone for each category, but the Chamber would like to have a short essay on why you are nominating that person, new business, business or Non-Profit Organization of the year. Nomination forms can be submitted by going to the homepage of florachamber.com and clicking on Nominations for “of the Year” Awards.  They can also be submitted by email as long as your contact information is included. The deadline to submit nomination forms is the close of business today.  Forms can be emailed to [email protected] , mailed to the Chamber office at 223 West Railroad Street or drop it off at the chamber office. The awards banquet will be held on January 31 st .",
        "tags": [
            "Flora"
        ],
        "source": "WNOI Radio",
        "link": "https://www.wnoi.com/nomination-forms-7/",
        "date": "2026-01-05"
    },
    {
        "id": "ceo-3-on-3-tournament",
        "title": "CEO 3 ON 3 TOURNAMENT",
        "summary": "1/5/26 Only a few more days are left to register for the Clay County CEO 3 on 3 basketball tournament.  The basketball tournament will be held on Saturday, January 24 th in the North Clay High School Arena and North Gym. Registration fees are $25 per...",
        "full_story": "1/5/26 Only a few more days are left to register for the Clay County CEO 3 on 3 basketball tournament.  The basketball tournament will be held on Saturday, January 24 th in the North Clay High School Arena and North Gym. Registration fees are $25 per player with a maximum of four players per team.  The tournament is for boys or girls and team categories will be for those 8 and under, 10 and under, 12 and under, 14 and under, 16 and under, 18 and under and 19 and up.  This includes a t-shirt for all paying participants.  All teams are guaranteed a minimum of 3 games.  Entries are available on the Clay County CEO Facebook page.  Registration deadline is January 10 th .  If you need more information or need help email [email protected] or call 618-508-1801.",
        "tags": [
            "Clay County"
        ],
        "source": "WNOI Radio",
        "link": "https://www.wnoi.com/ceo-3-on-3-tournament-4/",
        "date": "2026-01-05"
    },
    {
        "id": "fmh-discounted-lab-tests",
        "title": "FMH DISCOUNTED LAB TESTS",
        "summary": "1/5/26 Fairfield Memorial Hospital will provide reduced-cost laboratory testing at multiple sites across the region from January 5 th through January 17 th . FMH staff encourage community members to take advantage of the limited-time rates to support...",
        "full_story": "1/5/26 Fairfield Memorial Hospital will provide reduced-cost laboratory testing at multiple sites across the region from January 5 th through January 17 th . FMH staff encourage community members to take advantage of the limited-time rates to support preventive care and early detection.  Appointments are required and may be scheduled by calling 618-847-0400. Tests available include Hemoglobin A1C, $20; PSA, $20; Thyroid Pannel, $40, Vitamin D test, $40, and Comprehensive Metabolic Panel, $40. Horizon Healthcare announced last week that the Cisne Clinic will reopen starting today.  Screenings will be offered at the Cisne Horizon Clinic at 413 Park Street today through Friday from 6 to 10:30 am and on Saturday, from 8:30 until 10:30 am.  You should not have food or drink after midnight the day before your test, payment is due at the time of service and test results will be mailed directly to your home.",
        "tags": [
            "Clay County"
        ],
        "source": "WNOI Radio",
        "link": "https://www.wnoi.com/fmh-discounted-lab-tests-3/",
        "date": "2026-01-05"
    },
    {
        "id": "christmas-tree-recycling",
        "title": "CHRISTMAS TREE RECYCLING",
        "summary": "1/5/26 Today is the last day to drop off your live Christmas tree for recycling at the Clay County Health Department.  This is the 18 th Annual Christmas Tree Collection. Traditional, real Christmas trees can still serve a valuable purpose after the ...",
        "full_story": "1/5/26 Today is the last day to drop off your live Christmas tree for recycling at the Clay County Health Department.  This is the 18 th Annual Christmas Tree Collection. Traditional, real Christmas trees can still serve a valuable purpose after the holiday season.  Because they are biodegradable, these trees can be used for environmental applications such as providing valuable habitats for fish in ponds and lakes or being turned into compost or mulch for erosion control and soil stabilization. This year, any donated trees will be given to the Stephen A. Forbes State Park, where they will be used in the lake to provide cover and nutrients for fish. Christmas trees may be dropped off at the West end of the Clay County Health Department any time before today by the Christmas Tree Collection sign and orange fencing.  Remember to remove any ornaments, decorations, and tinsel from your tree before dropping it off, these items are not biodegradable and will cause harm to wildlife.  A good rule of thumb is to take your tree to the drop-off location in the same condition as you would find it naturally in the forest. If you have any questions or would like additional information, please contact the Clay County Health Department at 618-662-4406.",
        "tags": [
            "Clay County"
        ],
        "source": "WNOI Radio",
        "link": "https://www.wnoi.com/christmas-tree-recycling-3/",
        "date": "2026-01-05"
    },
    {
        "id": "wilhour-traveling-office-hours",
        "title": "WILHOUR TRAVELING OFFICE HOURS",
        "summary": "1/5/26 State Representative Blaine Wilhour announced the first Traveling Office Hours for the New Year for constituents to meet with legislative staff to receive help with state programs.  Wilhour’s representatives will be available on Wednesday, fro...",
        "full_story": "1/5/26 State Representative Blaine Wilhour announced the first Traveling Office Hours for the New Year for constituents to meet with legislative staff to receive help with state programs.  Wilhour’s representatives will be available on Wednesday, from 8:30 AM to 10:00 AM at the Ramsey Village Hall from 10:30 AM to 12:30 PM at the Evans Public Library in Vandalia and from 2:00 PM to 3:30 PM at the Mulberry Grove Village Hall. On Wednesday January 14 th legislative staff will be available at the Case-Halstead Library in Carlyle, from 9:00 am to 10:30 am, at the Centralia Regional Library from 11:00 am to 12:30 pm, and at the Bryan-Bennett Library in Salem from 2:00 pm to 3:30 pm. Traveling Office Hours will also be held on Wednesday, January 21 st at the Olney Public Library from 1 to 4 pm. Representative Wilhour said “My staff will be available to meet with constituents about public policy issues and concerns as well as provide help with state programs.  I encourage everyone to sign up for my electronic news updates to learn about the activities of the General Assembly and encourage you to take advantage of the online technology to monitor legislative proceedings and file witness slips on legislation that you agree with or disagree with.” Constituents may contact the district office at 618-665-4109 or online at RepWilhour.com to schedule an appointment to meet with the legislative staff.",
        "tags": [
            "Clay County"
        ],
        "source": "WNOI Radio",
        "link": "https://www.wnoi.com/wilhour-traveling-office-hours-9/",
        "date": "2026-01-05"
    },
    {
        "id": "maps-accidentally-released",
        "title": "MAPS ACCIDENTALLY RELEASED",
        "summary": "1/5/26 The Illinois Department of Human Services announced a security issue involving internal planning maps. On September 22 nd , the department discovered that maps created by the Division of Family and Community Services were publicly accessible d...",
        "full_story": "1/5/26 The Illinois Department of Human Services announced a security issue involving internal planning maps. On September 22 nd , the department discovered that maps created by the Division of Family and Community Services were publicly accessible due to incorrect privacy settings. This affects 32,401 Division of Rehabilitation Services customers and 672,616 recipients of Medicaid and Medicare Savings programs. The mapping website was unable to identify who viewed the maps.  To date, IDHS is unaware of any actual or attempted misuse of personal information as a result of this incident. Upon discovering this incident, IDHS immediately changed the privacy settings on all maps between September 22, 2025, and September 26, 2025, to restrict access to only authorized IDHS employees.  IDHS conducted a comprehensive review to determine the data contained in each map and assess reporting obligations under applicable State and federal privacy laws. IDHS is in the process of sending notice, as required by law, to the individuals affected by this incident and to all applicable regulatory authorities.  IDHS is working to ensure that this does not happen again, as the privacy of customers is of paramount importance. The individual notices being sent to affected customers will include toll-free numbers where customers can call for additional information.  Credit reporting agencies and the Federal Trade Commission can also offer information about fraud alerts and security freezes and contact information for those organizations is being provided to the affected individuals.",
        "tags": [
            "Clay County"
        ],
        "source": "WNOI Radio",
        "link": "https://www.wnoi.com/maps-accidentally-released/",
        "date": "2026-01-05"
    },
    {
        "id": "cisne-clinic-reopens",
        "title": "CISNE CLINIC REOPENS",
        "summary": "1/2/26 Horizon Healthcare announced that the Cisne Clinic will reopen and resume full operations on Monday. The clinic was temporarily closed to allow for necessary facility maintenance and improvements to ensure a safe, comfortable, and welcoming en...",
        "full_story": "1/2/26 Horizon Healthcare announced that the Cisne Clinic will reopen and resume full operations on Monday. The clinic was temporarily closed to allow for necessary facility maintenance and improvements to ensure a safe, comfortable, and welcoming environment for patients and staff.  During this time, the clinic underwent partial remodeling and updates, enhancing the space while meeting all appropriate safety and care standards. Horizon Healthcare remains committed to delivering accessible, high-quality care and is eager to welcome patients back to the Cisne Clinic beginning Monday. For additional information or to schedule an appointment, contact Horizon Healthcare at 618-842-4617.",
        "tags": [
            "Clay County"
        ],
        "source": "WNOI Radio",
        "link": "https://www.wnoi.com/cisne-clinic-reopens/",
        "date": "2026-01-05"
    },
    {
        "id": "upcoming-freshmen-orientation-in-olney",
        "title": "UPCOMING FRESHMEN ORIENTATION IN OLNEY",
        "summary": "<p><img width=\"1281\" height=\"819\" src=\"https://freedom929.com/wp-content/uploads/sites/30/RICHLAND_COUNTY_SCHOOL_Graphic.jpg\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://freedom929.com/w...",
        "full_story": "<p><img width=\"1281\" height=\"819\" src=\"https://freedom929.com/wp-content/uploads/sites/30/RICHLAND_COUNTY_SCHOOL_Graphic.jpg\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://freedom929.com/wp-content/uploads/sites/30/RICHLAND_COUNTY_SCHOOL_Graphic.jpg 1281w, https://freedom929.com/wp-content/uploads/sites/30/RICHLAND_COUNTY_SCHOOL_Graphic-300x192.jpg 300w, https://freedom929.com/wp-content/uploads/sites/30/RICHLAND_COUNTY_SCHOOL_Graphic-150x96.jpg 150w, https://freedom929.com/wp-content/uploads/sites/30/RICHLAND_COUNTY_SCHOOL_Graphic-768x491.jpg 768w\" sizes=\"(max-width: 1281px) 100vw, 1281px\" /></p><!-- wp:paragraph -->\n<p>(OLNEY) With the Richland County schools to resume classes and activities next week, it’s been announced that Richland County High School will host its Freshmen Orientation for all 8th graders of Richland County on Wednesday evening, January 14th, from 5:30 to 7:00. Following a brief presentation, students and their guests will tour the High School. Refreshments will be provided and RSVP’s are not required. If questions, call the Student Services Office at Richland County High School at 618-393-2191, next week. All 8th graders and guests are urged to attend.</p>\n<!-- /wp:paragraph -->",
        "tags": [
            "Clay County"
        ],
        "source": "Freedom 92.9",
        "link": "https://freedom929.com/upcoming-freshmen-orientation-in-olney/",
        "date": "2026-01-05"
    },
    {
        "id": "sign-up-now-for-upcoming-conference",
        "title": "SIGN UP NOW FOR UPCOMING CONFERENCE",
        "summary": "<p><img width=\"1281\" height=\"819\" src=\"https://freedom929.com/wp-content/uploads/sites/30/AGRICULTURE_UPDATE_Graphic-1.jpg\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://freedom929.com/wp-...",
        "full_story": "<p><img width=\"1281\" height=\"819\" src=\"https://freedom929.com/wp-content/uploads/sites/30/AGRICULTURE_UPDATE_Graphic-1.jpg\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://freedom929.com/wp-content/uploads/sites/30/AGRICULTURE_UPDATE_Graphic-1.jpg 1281w, https://freedom929.com/wp-content/uploads/sites/30/AGRICULTURE_UPDATE_Graphic-1-300x192.jpg 300w, https://freedom929.com/wp-content/uploads/sites/30/AGRICULTURE_UPDATE_Graphic-1-150x96.jpg 150w, https://freedom929.com/wp-content/uploads/sites/30/AGRICULTURE_UPDATE_Graphic-1-768x491.jpg 768w\" sizes=\"(max-width: 1281px) 100vw, 1281px\" /></p><!-- wp:paragraph -->\n<p>(SPRINGFIELD) Registration is now open for the Fourth Annual From Food to Flowers : Everything Local Conference, scheduled for January 28th thru 30th, at the Bank of Springfield Center. The three day event combines the Illinois Specialty Crop Conference and the Local Food and Farmers Market Conference, a collaborative effort among producers and agribusiness leaders to enhance local food systems, hosted in part by Farm Bureau. Featured will be exhibitors, free consultations, breakout sessions, various meetings, and more. Those interested can register by January 16th, two weeks from today, for a discounted registration rate. For more details or to register, visit the ILFB website, at ilfb.org/get-involved/evens/everything-local-conference.</p>\n<!-- /wp:paragraph -->",
        "tags": [
            "Clay County"
        ],
        "source": "Freedom 92.9",
        "link": "https://freedom929.com/sign-up-now-for-upcoming-conference/",
        "date": "2026-01-05"
    },
    {
        "id": "news-from-around-illinois",
        "title": "NEWS FROM AROUND ILLINOIS",
        "summary": "<p><img width=\"1281\" height=\"819\" src=\"https://freedom929.com/wp-content/uploads/sites/30/State-News.jpeg\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://freedom929.com/wp-content/uploads/s...",
        "full_story": "<p><img width=\"1281\" height=\"819\" src=\"https://freedom929.com/wp-content/uploads/sites/30/State-News.jpeg\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://freedom929.com/wp-content/uploads/sites/30/State-News.jpeg 1281w, https://freedom929.com/wp-content/uploads/sites/30/State-News-300x192.jpeg 300w, https://freedom929.com/wp-content/uploads/sites/30/State-News-150x96.jpeg 150w, https://freedom929.com/wp-content/uploads/sites/30/State-News-768x491.jpeg 768w\" sizes=\"(max-width: 1281px) 100vw, 1281px\" /></p><!-- wp:paragraph -->\n<p>(SPRINGFIELD) One of the nearly 300 new laws that took effect yesterday in Illinois is a ban on compact fluorescent light bulbs. While the law prohibits the sale and distribution of screw-base and bayonet-base compact fluorescent lamps, restrictions on pin-base compact fluorescent and linear fluorescent lamps are set to begin next year, in 2027. Democratic sponsors of the new law say that toxic pollutants in fluorescent bulbs are the problem, posing a health risk to all ages.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>(SPRINGFIELD) Another new law that began yesterday will let statewide veterinarians renew yearly medical exemptions for pets that are too sick to receive rabies shots, a change that many supporters call “common sense.” While the Illinois State Veterinary Medical Association says the law finally brings needed clarity to state rules, which allows veterinarians the sole ability to exempt an animal from rabies vaccination if it would compromise the particular animal’s health, although the percentage of animals affected is very low, plus the risk to the public is zero.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>(SPRINGFIELD) Illinois Community Colleges have announced that its second annual “Feed the Need” Campus Food Drive, which started in 2024 to help combat food insecurity on junior college campuses and support students in need, collected nearly 180,000 non-perishable food items for local campus and community food banks, dwarfing last year’s collection of nearly 91,000 food items. Most all of the 45 junior colleges in 39 community college districts, including those in the Illinois Eastern Community College District, took part in the statewide initiative.</p>\n<!-- /wp:paragraph -->",
        "tags": [
            "Clay County"
        ],
        "source": "Freedom 92.9",
        "link": "https://freedom929.com/news-from-around-illinois-95/",
        "date": "2026-01-05"
    },
    {
        "id": "regional-weather-outlook",
        "title": "REGIONAL WEATHER OUTLOOK",
        "summary": "<p><img width=\"1281\" height=\"819\" src=\"https://freedom929.com/wp-content/uploads/sites/30/FRIDAY_WeatherUpdate_Graphic.jpg\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://freedom929.com/wp-...",
        "full_story": "<p><img width=\"1281\" height=\"819\" src=\"https://freedom929.com/wp-content/uploads/sites/30/FRIDAY_WeatherUpdate_Graphic.jpg\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://freedom929.com/wp-content/uploads/sites/30//FRIDAY_WeatherUpdate_Graphic.jpg 1281w, https://freedom929.com/wp-content/uploads/sites/30//FRIDAY_WeatherUpdate_Graphic-300x192.jpg 300w, https://freedom929.com/wp-content/uploads/sites/30//FRIDAY_WeatherUpdate_Graphic-150x96.jpg 150w, https://freedom929.com/wp-content/uploads/sites/30//FRIDAY_WeatherUpdate_Graphic-768x491.jpg 768w\" sizes=\"(max-width: 1281px) 100vw, 1281px\" /></p><!-- wp:paragraph -->\n<p>(OLNEY/NEWTON) With a high pressure ridge hanging over the Midwest, we’ll stay dry with plenty of clouds and maybe some sunshine on this Friday, and after a seasonably cool weekend, our downstate area temperatures will rise and average 10 to 15 degrees above normal most of the work week, next week. At this point in time, our next significant chance of precipitation in the next week will be in the form of rain next Thursday into Friday. Stay tuned for weather updates and monitor a NOAA Weather Alert Radio for more weather information and forecast details.</p>\n<!-- /wp:paragraph -->",
        "tags": [
            "Clay County"
        ],
        "source": "Freedom 92.9",
        "link": "https://freedom929.com/regional-weather-outlook-102/",
        "date": "2026-01-05"
    },
    {
        "id": "local-municipal-meetings-next-week",
        "title": "LOCAL MUNICIPAL MEETINGS NEXT WEEK",
        "summary": "<p><img width=\"1281\" height=\"819\" src=\"https://freedom929.com/wp-content/uploads/sites/30/NEWS_UPDATE_Graphic.jpg\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://freedom929.com/wp-content/u...",
        "full_story": "<p><img width=\"1281\" height=\"819\" src=\"https://freedom929.com/wp-content/uploads/sites/30/NEWS_UPDATE_Graphic.jpg\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://freedom929.com/wp-content/uploads/sites/30/NEWS_UPDATE_Graphic.jpg 1281w, https://freedom929.com/wp-content/uploads/sites/30/NEWS_UPDATE_Graphic-300x192.jpg 300w, https://freedom929.com/wp-content/uploads/sites/30/NEWS_UPDATE_Graphic-150x96.jpg 150w, https://freedom929.com/wp-content/uploads/sites/30/NEWS_UPDATE_Graphic-768x491.jpg 768w\" sizes=\"(max-width: 1281px) 100vw, 1281px\" /></p><!-- wp:paragraph -->\n<p>(NEWTON/OLNEY) There are two municipal meetings coming up next week :</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The City of Olney Plan Commission will meet this coming Monday night, January 5th, at Olney City Hall, starting at 7:30 – the only agenda item is a public hearing with discussion and a possible vote on the rezoning request of 4751 East Radio Tower Lane from a Light Industrial District (M-1) to a Single-Family Residence District (R-1)</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>The Newton City Council will have a regularly scheduled meeting next Tuesday night, January 6th, at the Newton City Hall, beginning at 6:00 – the Council’s Finance &amp; Audit Committee meets a half hour earlier at 5:30, also at the Newton City Hall</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>All the meetings are open to the public, with the exception of any executive sessions.</p>\n<!-- /wp:paragraph -->",
        "tags": [
            "Clay County"
        ],
        "source": "Freedom 92.9",
        "link": "https://freedom929.com/local-municipal-meetings-next-week/",
        "date": "2026-01-05"
    },
    {
        "id": "olney-central-college-nursing-program",
        "title": "OLNEY CENTRAL COLLEGE / NURSING PROGRAM",
        "summary": "<p><img width=\"1281\" height=\"819\" src=\"https://freedom929.com/wp-content/uploads/sites/30/Olney-Central-College-2.png\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://freedom929.com/wp-conte...",
        "full_story": "<p><img width=\"1281\" height=\"819\" src=\"https://freedom929.com/wp-content/uploads/sites/30/Olney-Central-College-2.png\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://freedom929.com/wp-content/uploads/sites/30/Olney-Central-College-2.png 1281w, https://freedom929.com/wp-content/uploads/sites/30/Olney-Central-College-2-300x192.png 300w, https://freedom929.com/wp-content/uploads/sites/30/Olney-Central-College-2-150x96.png 150w, https://freedom929.com/wp-content/uploads/sites/30/Olney-Central-College-2-768x491.png 768w\" sizes=\"(max-width: 1281px) 100vw, 1281px\" /></p><!-- wp:paragraph -->\n<p>(OLNEY) The next one hour meeting for students interested in applying for Fall 2026 admission to the Associate Degree Nursing Program at OCC is later this month in Wattleworth Hall Room 213, plus there will be two more virtual sessions, one this month and another in February. To make an application to the OCC nursing program or for a meeting appointment, call Julie at 618-847-9201, extension 4520, next week, when the Olney Central College offices reopen.</p>\n<!-- /wp:paragraph -->",
        "tags": [
            "Clay County"
        ],
        "source": "Freedom 92.9",
        "link": "https://freedom929.com/olney-central-college-nursing-program/",
        "date": "2026-01-05"
    },
    {
        "id": "harvested-deer-can-help-those-in-need",
        "title": "HARVESTED DEER CAN HELP THOSE IN NEED",
        "summary": "<p><img width=\"1281\" height=\"819\" src=\"https://freedom929.com/wp-content/uploads/sites/30/HUNTING_Graphic.jpg\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://freedom929.com/wp-content/uploa...",
        "full_story": "<p><img width=\"1281\" height=\"819\" src=\"https://freedom929.com/wp-content/uploads/sites/30/HUNTING_Graphic.jpg\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://freedom929.com/wp-content/uploads/sites/30//HUNTING_Graphic.jpg 1281w, https://freedom929.com/wp-content/uploads/sites/30//HUNTING_Graphic-300x192.jpg 300w, https://freedom929.com/wp-content/uploads/sites/30//HUNTING_Graphic-150x96.jpg 150w, https://freedom929.com/wp-content/uploads/sites/30//HUNTING_Graphic-768x491.jpg 768w\" sizes=\"(max-width: 1281px) 100vw, 1281px\" /></p><!-- wp:paragraph -->\n<p>(NEWTON/OLNEY) Area deer hunters are encouraged to help out this year’s Hunters Feeding Illinois program whereas harvested deer are donated to participating meat processors, who in turn provide venison meat to statewide food pantries to help families in need. Hunters in Clay, Richland, Jasper, Lawrence, Edwards, Wayne, and most of the surrounding counties are urged to help out. As hunter donate their harvested deer, the freshly ground venison will be provided to local food pantries, but only based on the amount of harvested deer donated. Others in the area can also help out with monetary donations for the meat processing cost. For each $50 donated, the Feeding Illinois program matches that to pay for the $100 processing fee. To see how folks and/or hunters can help out, go to the go.illinois.edu/HuntersFeedingIllinois website. The first four days of the Late Winter Firearm Season is tomorrow through Sunday, but only for thirty counties around the state, including Jasper, Crawford, Coles, Effingham, Fayette, Clay, Marion, Jefferson, and Hamilton. The final three days of the season will be January 16th –18th. </p>\n<!-- /wp:paragraph -->",
        "tags": [
            "Clay County"
        ],
        "source": "Freedom 92.9",
        "link": "https://freedom929.com/harvested-deer-can-help-those-in-need/",
        "date": "2026-01-05"
    },
    {
        "id": "upcoming-activities",
        "title": "UPCOMING ACTIVITIES",
        "summary": "<p><img width=\"1281\" height=\"819\" src=\"https://freedom929.com/wp-content/uploads/sites/30/LOCAL_EVENT_Graphic-1.jpg\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://freedom929.com/wp-content...",
        "full_story": "<p><img width=\"1281\" height=\"819\" src=\"https://freedom929.com/wp-content/uploads/sites/30/LOCAL_EVENT_Graphic-1.jpg\" class=\"attachment-post-thumbnail size-post-thumbnail wp-post-image\" alt=\"\" decoding=\"async\" srcset=\"https://freedom929.com/wp-content/uploads/sites/30/LOCAL_EVENT_Graphic-1.jpg 1281w, https://freedom929.com/wp-content/uploads/sites/30/LOCAL_EVENT_Graphic-1-300x192.jpg 300w, https://freedom929.com/wp-content/uploads/sites/30/LOCAL_EVENT_Graphic-1-150x96.jpg 150w, https://freedom929.com/wp-content/uploads/sites/30/LOCAL_EVENT_Graphic-1-768x491.jpg 768w\" sizes=\"(max-width: 1281px) 100vw, 1281px\" /></p><!-- wp:paragraph -->\n<p>(OLNEY) The Richland County Soil &amp; Water Conservation District has announced its Annual Meeting is coming up on Thursday night, January 22nd, 2026, at the Best Western Parkside Event Center in Olney. With the doors to open that evening at 5:30 with registration, the catered meal will be served at 6:00, followed by the annual business meeting at 7:00, and guest speaker Holly Spangler. The $10.00 tickets can be purchased from any of the SWCD Directors, at the SWCD District Office along South Route 130, or by calling the District Office and reserving tickets at 618-392-7141. There will be no ticket sales made after Friday, January 16th, 2026.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>(OLNEY) The next Queen of Hearts drawing at the Olney VFW Post is this coming Sunday afternoon at 4:00, with tickets on sale all this week, up until about 3:55 on Sunday. This week’s jackpot should be over $11,000 to the winner, if they are present. Open to the public, the Queen of Hearts ticket sales goes to support the VFW Post along with local Veterans and their families.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>(BIBLE GROVE) It’s the next scheduled Gym Bob’s Jamboree Show this weekend up in Bible Grove, in northern Clay County, with the doors opening at 12:00 noon this Sunday and showtime at 1:00. Hosted by Mike Porter, Marsha Banning, and Gym Bob’s Jamboree Band, this month’s special will feature another “50’s &amp; 60’s Show.” While not necessary, reservations can be made by calling 618-665-3956. With tickets on sale at the door, go to GymBobs.com for more details.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>(SAILOR SPRINGS) The Clay City/Sailor Springs American Legion Post 230 will have another first Saturday of the month breakfast this weekend with serving from 7:00 to 10:00, featuring pancakes, sausage, biscuits, gravy, and drinks, all for a donation at the door, plus carry outs are available. All ages are welcome to enjoy a great breakfast and support the local Veterans. That’s just off the Clay City / Dieterich Blacktop in Sailor Springs this coming Saturday morning.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>(OLNEY) The Olney VFW is hosting a “Drive-By Birthday Celebration” tomorrow, on January 1st, 2026, for World War II Veteran, Robert “Bob” Sayre, who’ll be turning 102 years old. Those who’d like to take part should gather at the VFW on North Walnut Street by 1:45 as the Birthday Celebration convoy is scheduled to leave the VFW at 1:50. All are invited to take part.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>(OLNEY) Tonight is the final night to visit the Christmas Lights Display in the Olney City Park, lit up at dusk on this New Year’s Eve. Monetary donations are accepted by the Bucket Brigade at the end of the display with all the money to assist with display expenses and repairs.</p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p></p>\n<!-- /wp:paragraph -->\n\n<!-- wp:paragraph -->\n<p>(NEWTON) Only a few more nights remain to visit the Christmas Lights Display in Newton’s Peterson Park, open each night from 5:00 to 10:00 through this Sunday night, January 4th.</p>\n<!-- /wp:paragraph -->",
        "tags": [
            "Clay City",
            "Sailor Springs"
        ],
        "source": "Freedom 92.9",
        "link": "https://freedom929.com/upcoming-activities/",
        "date": "2026-01-05"
    }
]